{
  "name": "Boardwalk Empire",
  "category": "🄱 Boardwalk Empire",
  "info": {
    "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/kL6SqlVPpfAof2nQbh1VxkUuXBQ.jpg",
    "bg": "https://image.tmdb.org/t/p/w500_and_h282_face/7Yj4QbECkH3JavlZxw4NWReoN7B.jpg",
    "plot": "Atlantic City at the dawn of Prohibition is a place where the rules don't apply. And the man who runs things -- legally and otherwise -- is the town's treasurer, Enoch \"Nucky\" Thompson, who is equal parts politician and gangster.",
    "rating": "8.0",
    "genre": [
      "crime",
      "drama"
    ],
    "cast": [
      "Steve Buscemi",
      "Kelly Macdonald",
      "Michael Shannon",
      "Shea Whigham",
      "Stephen Graham"
    ]
  },
  "seasons": [
    {
      "season": 1,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/i7pWWzunPNGDhzHlqHoot7qXYRe.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "On the eve of Prohibition in 1920, Atlantic City county treasurer Enoch \"Nucky\" Thompson is looking to cash in. Prohibition may have outlawed alcohol, but in Nucky's world it has opened up highly lucrative opportunities for gangsters and rumrunners looking to provide \"liquid gold\" for a thirsty nation. In a city defined by notorious backroom politics and vicious power struggles, Nucky battles a relentless federal agent, ambitious underlings, and opportunistic rivals—including Arnold Rothstein, Lucky Luciano, and Al Capone.",
        "year": "2010",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Boardwalk Empire",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/mav2rDhy0Bb7SuAcBxCYQkEiiXK.jpg",
            "plot": "January 1920. On the eve of Prohibition, Atlantic City's Treasurer, Nucky Thompson, condemns alcohol at a Women's Temperance League meeting, where he is noticed by Margaret Schroeder, a pretty, pregnant housewife who comes to him for help in getting her abusive husband Hans a job. Later that evening, the duplicitous Nucky privately tells his ward bosses about the opportunity to make huge profits selling bootleg liquor. At a countdown-to-midnight blast at Babette's Supper Club, he assures Jimmy Darmody, a recently returned WWI vet, that his appointment as \"Man Friday\" to the new Chief Clerk of the Fourth Ward, Paddy Ryan, will lead to bigger things. Jimmy, meanwhile, has higher aspirations and ends up making an alliance that could have dire consequences for both him and Nucky.",
            "duration": 4380,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/mav2rDhy0Bb7SuAcBxCYQkEiiXK.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 2,
          "name": "The Ivory Tower",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/xcG2tBqq76QQqHUhrKRgxqxw1cU.jpg",
            "plot": "Nucky deals with the fallout from Jimmy's rogue heist, sending Eli to sow the seeds of doubt in the mind of Margaret, who seeks help in the wake of her husband's demise.",
            "duration": 3180,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/xcG2tBqq76QQqHUhrKRgxqxw1cU.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 3,
          "name": "Broadway Limited",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/nFQOi4Ikf2hzjdMmEnM5ziTMx25.jpg",
            "plot": "An unlikely witness to the woods massacre threatens to expose the perpetrators, sending both Eli and Van Alden rushing to the hospital. Margaret starts a new job at an upscale French dress shop at the Ritz, while Chalky's team pays a heavy price for taking over Mickey Doyle's bootleg operation.",
            "duration": 3120,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/nFQOi4Ikf2hzjdMmEnM5ziTMx25.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 4,
          "name": "Anastasia",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/rpE8i2phu3M0kHByTj0uIJPHSm9.jpg",
            "plot": "In Chicago, Jimmy bonds with one of Johnny Torrio's prostitutes, Pearl, and finds himself increasingly at odds with the hot-headed Al Capone. Back in Atlantic City, Nucky looks to leverage his political relationships with ambitious U.S. Senator Walter Edge and Jersey City Mayor Frank Hague, while Eli and Chalky go to extremes to interrogate a local KKK leader.",
            "duration": 3240,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/rpE8i2phu3M0kHByTj0uIJPHSm9.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 5,
          "name": "Nights in Ballygran",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/AhtTrLBclY5fyx2j2W5H8cRH2V3.jpg",
            "plot": "On the day of the annual St. Patrick's Eve dinner, Nucky deals with Eli's oratory ambitions, as well as a group of disenchanted \"Leprechauns\". Feeling ignored by Nucky, a frustrated Margaret feeds Van Alden information. In Chicago, Jimmy copes with the aftermath of a vicious attack orchestrated by Torrio rival Charlie Sheridan.",
            "duration": 3240,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/AhtTrLBclY5fyx2j2W5H8cRH2V3.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 6,
          "name": "Family Limitation",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/lao2k4eM5Y6yRmRQb8qtp9r6Hlk.jpg",
            "plot": "After the brazen robbery of one of his ward bosses, Nucky turns up the heat on Lucky Luciano. An emboldened Margaret stands up to Lucy at the dress shop and accepts an offer from Nucky to change her circumstances. In Chicago, Al's frustration over family issues spills over into his relationship with Jimmy, who scores points with Johnny Torrio for a bold power play involving Sheridan and the neighborhood of Greektown.",
            "duration": 3600,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/lao2k4eM5Y6yRmRQb8qtp9r6Hlk.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 7,
          "name": "Home",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/dHciY6aLrYUdy5AhNnmpO6L8b80.jpg",
            "plot": "After his father Ethan is injured in a fall, Nucky uses the opportunity to refurbish his childhood home. On a double-date with new friend Annabelle and her beaux, Margaret tries to get Nucky to open up about some painful childhood memories. During a visit to an army hospital, Jimmy befriends disfigured vet Richard Harrow, whose sharp eye proves invaluable. Van Alden gets a lead on the woods massacre.",
            "duration": 3180,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/dHciY6aLrYUdy5AhNnmpO6L8b80.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 8,
          "name": "Hold Me in Paradise",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ftwCvfiq9u95N166lsqhnn2mUWQ.jpg",
            "plot": "Nucky visits Chicago for the Republican National Convention, where he finds himself intrigued by the candidacy of Warren G. Harding over more established candidates. The D'Alessio gang moves in on Nucky's territory at the expense of Eli, who has been watching over his brother's affairs. Margaret finds herself entangled in Nucky's business affairs, while Van Alden struggles with his wife's desire for a child. Rothstein prepares for legal trouble over his role in fixing the 1919 World Series. Nucky asks Jimmy to return to Atlantic City to reinforce his position.",
            "duration": 3000,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ftwCvfiq9u95N166lsqhnn2mUWQ.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 9,
          "name": "Belle Femme",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/hfeoqnSCKQwv6djZx5RgoMwUkh6.jpg",
            "plot": "Nucky is forced to readjust his political alliances with a Democratic mayoral candidate promising to wipe out corruption. Jimmy returns from Chicago to deal with the D'Alessio gang, which has allied with Rothstein to import European scotch through Atlantic City, but is arrested by Agent Van Alden for the massacre in the woods. Margaret intercedes with Nucky on Madame Jeunet's behalf, while Angela finds her romantic and artistic ambitions halted by Jimmy's return.",
            "duration": 3180,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/hfeoqnSCKQwv6djZx5RgoMwUkh6.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 10,
          "name": "The Emerald City",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/f7fUrRZW9GGsyLzf26Q3qPWTiv1.jpg",
            "plot": "Nucky asks for Margaret's assistance in backing his mayoral candidate with the passage of women's right to vote, leaving her conflicted about her role. Doyle switches sides back from Rothstein, which leads Nucky to conspire with Chalky against Lansky and the D'Alessios. Angela witnesses Jimmy's violent side against her photographer friend, and considers leaving Atlantic City for good in the aftermath. Van Alden grapples with his emotions, and has encounters with both Margaret and Lucy.",
            "duration": 3540,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/f7fUrRZW9GGsyLzf26Q3qPWTiv1.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 11,
          "name": "Paris Green",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/tQ3tMcKJab7yhzQmJpIVpmBfbdv.jpg",
            "plot": "\"Paris Green\" is the 11th episode of the first season of the HBO television series Boardwalk Empire, which premiered November 28, 2010. The episode was written by supervising producer Howard Korder and directed by Allen Coulter.",
            "duration": 3420,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/tQ3tMcKJab7yhzQmJpIVpmBfbdv.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 12,
          "name": "A Return to Normalcy",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/6NbGTun2IWEnHuw5CNbdVCDenZM.jpg",
            "plot": "Nucky faces Election Day in Atlantic City and pulls out all the stops to keep power in Republican hands. Torrio brokers a discussion between Nucky and Rothstein to resolve their growing gang war, as well as Rothstein's looming federal indictment over the World Series.  Both Jimmy and Eli voice their growing resentment towards Nucky, and find they have an ally in the Commodore. Van Alden seeks a sign on whether or not to leave Atlantic City, but receives unexpected news from Lucy. Margaret weighs new information about Nucky's first marriage and her uncertain future to make a final decision on her role in his life.",
            "duration": 3660,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/6NbGTun2IWEnHuw5CNbdVCDenZM.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        }
      ]
    },
    {
      "season": 2,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/d4B8glaJVUvi0sEs9ItsmNSP45L.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "It's 1921 and after rigging the Atlantic City mayoral election, Nucky appears to be in control of the city. However, Nucky's grip soon begins to unravel as he is arrested for election fraud and members of both his inner circle and family begin to question their allegiances, while mobsters including Arnold Rothstein, Lucky Luciano, Meyer Lansky, and Al Capone wait in the wings, looking for the right opportunity to grab a bigger piece of Nucky's pie.",
        "year": "2011",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "21",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/A99C3ZYHAHHhQr2myan7HZIFJSL.jpg",
            "plot": "Nucky is shocked by an insurrection among his inner circle. An attack threatens Chalky's life and livelihood. Margaret deals with her son's problems. Angela vies for Jimmy's affection. Van Alden shows his wife around town.",
            "duration": 3240,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/A99C3ZYHAHHhQr2myan7HZIFJSL.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 2,
          "name": "Ourselves Alone",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/i8tMCAxJIQmH3rR5FSsUEmBlc26.jpg",
            "plot": "Despite being publicly embarrassed by legal trouble, Nucky's biggest concern may be holding on to his private army in a battle for control of Atlantic City. Meanwhile, Jimmy pitches a business deal to Arnold Rothstein in New York, but may have more in common with Meyer Lansky and Lucky Luciano. Margaret draws on past experience to retrieve some valuable information, Chalky clashes with a fellow inmate, and an Irish nationalist comes to town looking for support.",
            "duration": 3540,
            "rating": "8.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/i8tMCAxJIQmH3rR5FSsUEmBlc26.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 3,
          "name": "A Dangerous Maid",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/Acr5x5Ypheq3ziuYPg2BtwJn22w.jpg",
            "plot": "The Commodore throws his weight around with the Coast Guard to disrupt the delivery of alcohol, which creates an opportunity for Owen to demonstrate his value to Nucky and a struggling casino. Meanwhile, a letter dredges up painful memories for Margaret, Nucky calls in a favor with the U.S. attorney general, Meyer and Lucky learn the price of power, and Lucy searches for ways to cure her loneliness.",
            "duration": 3360,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/Acr5x5Ypheq3ziuYPg2BtwJn22w.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 4,
          "name": "What Does the Bee Do?",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/rkhIYkdxfv81iT3ebtqXqFo4A9j.jpg",
            "plot": "During Mayor Bader's birthday party, Nucky's attorney comes up with a solution that might help Nucky in his election-rigging case. With a liquor surplus likely, Jimmy and Mickey travel to Philadelphia to search for buyers while Nucky makes a surprising deal to try and get alcohol into Atlantic City. Eli is concerned over the Commodore's ability to lead. Margaret decides to give her staff bonuses. Chalky is cornered while at work and home. Owen takes his munitions expertise and uses it. Van Alden's agents set their eyes on Mickey's warehouse. Richard lets his guard down in the name of art. And Gillian thinks of the first time she was ever with the Commodore.",
            "duration": 3480,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/rkhIYkdxfv81iT3ebtqXqFo4A9j.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 5,
          "name": "Gimcrack & Bunkum",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/mDoVgtV1z1FjOZCv5ML0FtEjsDa.jpg",
            "plot": "After a dispute with his enemies, Nucky brings in a surprise guest speaker at a Memorial Day dedication for war veterans. Running out of options, Eli questions his allegiances, but it ends up sending him deeper into the hole. Nucky hires a new lawyer. Jimmy is taught a lesson by one of the Commodore's men that he won't soon forget. Richard decides to go hunting in the forest.",
            "duration": 3000,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/mDoVgtV1z1FjOZCv5ML0FtEjsDa.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 6,
          "name": "The Age of Reason",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/wGiYcBvKKRvYQCRksGW8UXTXpBn.jpg",
            "plot": "Nucky tries to set up a risky liquor delivery to Philadelphia. Later, Attorney General Daugherty sees a problem that might complicate Nucky's case. Jimmy finds a new mentor in Leander Whitlock who is the Commodore's lawyer. Margaret finally goes to confessional. Lucy continues to struggle with loneliness while Van Alden tries to settle his conscience.",
            "duration": 3540,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/wGiYcBvKKRvYQCRksGW8UXTXpBn.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 7,
          "name": "Peg of Old",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/g8bFtVdh40Pqrr9ZW06ZdHJLbz2.jpg",
            "plot": "Margaret has a family reunion. Owen gets even with a rival. Van Alden recognizes the hierarchy of the law. Jimmy wonders how a decision will affect the future.",
            "duration": 3540,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/g8bFtVdh40Pqrr9ZW06ZdHJLbz2.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 8,
          "name": "Two Boats and a Lifeguard",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/cAbZnhVAITFM66I9ZFC8KX7WGJw.jpg",
            "plot": "In the wake of a personal loss, Nucky solicits advice on his political situation from Arnold Rothstein, while Eli remains suspicious of his brother’s actions. Nucky finds himself in the unfamiliar position of showing gratitude toward a federal agent. Angela meets a new friend at the beach, and eavesdrops on her husband’s treachery. Nelson gets a nanny. Nucky approaches Owen with an overseas proposition. Jimmy flexes his muscles, at Mickey Doyle’s expense.",
            "duration": 3600,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/cAbZnhVAITFM66I9ZFC8KX7WGJw.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 9,
          "name": "Battle of the Century",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/lmIP4dbubm9oBkqyzNlXbCkzLdI.jpg",
            "plot": "Arriving in Belfast, Nucky and Owen meet with IRA leaders with a barter proposition. Meanwhile, in Atlantic City, Jimmy and his partners broker a deal with George Remus for his “medicinal” alcohol before taking a break to see/hear the Dempsey fight. Margaret frets when Emily’s illness takes a turn for the worse. Dunn Purnsley orchestrates a worker’s strike at the Ritz. Waxey Gordon takes action against Manny Horvitz in Philadelphia, and Randolph and Clifford Lathrop grill Halloran about Nucky’s past.",
            "duration": 2940,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/lmIP4dbubm9oBkqyzNlXbCkzLdI.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 10,
          "name": "Georgia Peaches",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/32vjtX861QHoXlTYIRAUUVoO7MB.jpg",
            "plot": "Undercut by Nucky, who has a new source for alcohol, Jimmy and his partners look to cultivate a new revenue stream in Atlantic City. With the peak tourist season approaching, the Commodore’s crew faces a choice in dealing with the city’s striking workers; either negotiate or fight back. Fearing that sin has led to misfortune, Margaret approaches Father Brennan with an “act of devotion.” Nucky gets a new lawyer. Van Alden faces an uncertain future. Manny Horvitz takes exception to a debt payment.",
            "duration": 3540,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/32vjtX861QHoXlTYIRAUUVoO7MB.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 11,
          "name": "Under God's Power She Flourishes",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/LK0XdSezlrS45flzMx9prlQAIQ.jpg",
            "plot": "With Margaret pondering the consequences of sin, Nucky prepares her for a worst-case scenario as Esther Randolph plays out her trump cards. Jimmy revisits his college days with Angela and Gillian. Mickey Doyle chafes at sharing his liquor profits. Eli refuses to cop a plea. Nelson's past comes back to haunt him, tipping the scale in Nucky's favor.",
            "duration": 3540,
            "rating": "8.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/LK0XdSezlrS45flzMx9prlQAIQ.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 12,
          "name": "To the Lost",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/v2CVMSWCxMLy8RrA2fNsF1rtkXv.jpg",
            "plot": "Esther Randolph's case is weakened by the sudden death of one witness and the sudden marriage of another. Jimmy turns away from the influence of others, including his mother. Nucky, acting the family man to Margaret, faces a difficult, bottom-line business decision.",
            "duration": 3480,
            "rating": "8.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/v2CVMSWCxMLy8RrA2fNsF1rtkXv.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        }
      ]
    },
    {
      "season": 3,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/ikyoujr6jpzn28ulhb6ZUopYpvS.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "Atlantic City, 1922: The Roaring '20s are about to begin in earnest and despite a booming economy, alcohol is scarce and gangster violence is heating up. Amidst this backdrop, Nucky, whose marriage to Margaret has become a sham after she signed away his highway windfall to the church, faces the challenge of mending old relationships while encountering new competition from hair-trigger gangster Gyp Rosetti, who builds a strategic bulkhead between New York and Atlantic City in an effort to siphon off Nucky's alcohol business.",
        "year": "2012",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Resolution",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/uA4BuRtS6RcNEuYr302iJWw5yoQ.jpg",
            "plot": "Nucky makes a resolution; Margaret considers a hospital expansion; Gillian builds a new business; Van Alden stumbles onto a confrontation.",
            "duration": 3420,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/uA4BuRtS6RcNEuYr302iJWw5yoQ.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 2,
          "name": "Spaghetti & Coffee",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/jB5yzz1E7JDN3vlu3n1wGqzEX3D.jpg",
            "plot": "Mixing business with pleasure in New York, Nucky bristles at the collection tactics of Gaston Means, a “special investigator” with ties to Attorney General Harry Daugherty. At St. Theresa’s, Margaret is troubled when her altruism is met with resistance by both a patient and an idealistic doctor. Gyp extends his stopover in Tabor Heights, a town halfway between Atlantic City and New York, with an eye towards establishing a strategic foothold. Chalky and his daughter Maybelle (Christina Jackson) fail to agree on her future with Samuel (Ty Michael Robinson); Eli gets a new boss and faces new realities at home; a major liquor shipment takes an unexpected detour.",
            "duration": 3480,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/jB5yzz1E7JDN3vlu3n1wGqzEX3D.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 3,
          "name": "Bone for Tuna",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/kZiJyNXvSUJNB2MYF3cT8OcqpPd.jpg",
            "plot": "Disturbed by a recent nightmare and Billie’s absence, Nucky reluctantly joins Margaret to receive a high honor from the Church. Meanwhile, Gyp makes a deal with Nucky for a onetime liquor shipment, though the mobster’s longtime intentions remain very much up in the air. Van Alden regrets trying to socialize with his co-workers; Margaret takes her women’s-clinic pitch to a higher authority; Lucky and Meyer (Anatol Yusef) protect their investments; Richard sets the record straight with Mickey, and with Nucky.",
            "duration": 3360,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/kZiJyNXvSUJNB2MYF3cT8OcqpPd.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 4,
          "name": "Blue Bell Boy",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/bQ0Fg60WKz7CC2GxMC8kyS1Isgl.jpg",
            "plot": "After tracking down a liquor thief, Nucky and Owen spend a long night hiding out from the fedswith the precocious perp. In his boss’ absence, and with Rothstein fuming over a late delivery, Mickey overrules Eli to make a routing call that will have far-reaching consequences for Nucky and Gyp. Margaret encounters a familiar face while promoting Dr. Mason’s classes at the new women’s clinic at St. Theresa’s. In New York, Lucky haggles with Joe Masseria over heroin splits, while in Chicago, Capone’s feud with O’Banion heats up when one of his collectors gets roughed up on the South Side.",
            "duration": 3420,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/bQ0Fg60WKz7CC2GxMC8kyS1Isgl.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 5,
          "name": "You'd Be Surprised",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/a60QgHSpbrsUjEVUPpjvWRoGcbV.jpg",
            "plot": "Rothstein vents to Nucky and delivers a message to Gyp. Gaston Means sees an opportunity. Billie gets a new co-start. Van Alden and Sigrid receive an unexpected visitor. Gillian worries about her business.",
            "duration": 3540,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/a60QgHSpbrsUjEVUPpjvWRoGcbV.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 6,
          "name": "Ging Gang Goolie",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/gcR0PI6VS4Dm1yH795tXEDNl0cj.jpg",
            "plot": "Nucky is detained in Washington; Margaret copes with Teddy's demons; Owen investigates a suspicious fire; Richard makes a connection with a veteran and his daughter.",
            "duration": 3360,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/gcR0PI6VS4Dm1yH795tXEDNl0cj.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 7,
          "name": "Sunday Best",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/wiWDC67fC6UJFA00WGx6z28uW0C.jpg",
            "plot": "Eli hopes to get back in Nucky's good graces; Gillian tries to improve her future; Gyp asks for a blessing in New York.",
            "duration": 3540,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/wiWDC67fC6UJFA00WGx6z28uW0C.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 8,
          "name": "The Pony",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/bLFfEZPOE1mayMYTndlqbaNnCM2.jpg",
            "plot": "Gillian makes her peace with Jimmy's death; Van Alden attends a meeting with Capone and Torrio; Nucky makes an offer to Andrew Mellon; Margaret makes a stand on birth control; Nucky and Owen shop for a pony; Billie considers a future in film.",
            "duration": 3540,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/bLFfEZPOE1mayMYTndlqbaNnCM2.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 9,
          "name": "The Milkmaid's Lot",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/vTL1zqKJWsna4NXQLTFx67jgshy.jpg",
            "plot": "Nucky vows to eliminate his nemesis. A high-profile bootlegger is arrested. Emily's birthday party is scaled down. Gillian blames Harrow for Tommy's trouble. Gyp decides to buy a town's silence.",
            "duration": 3240,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/vTL1zqKJWsna4NXQLTFx67jgshy.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 10,
          "name": "A Man, A Plan...",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/uJuuLXJzQaIENzYgDXuVKwC29zi.jpg",
            "plot": "Nucky tries to keep Jess Smith quiet and neutralize Gyp's alliance with Joe Masseria; Margaret considers an alternate future; Van Alden's side business backfires; Gyp's shipment is short; Chalky sees an opportunity.",
            "duration": 3480,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/uJuuLXJzQaIENzYgDXuVKwC29zi.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 11,
          "name": "Two Imposters",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/mcvJPbaTty7GbtCCFgtDqk1rwzP.jpg",
            "plot": "Gyp makes his move in Atlantic City, forcing Nucky and Eddie to seek refuge with Chalky. With the Artemis Club overrun by Rosetti thugs, Gillian contemplates a business future that includes an unwelcome partner. Luciano makes a deal he’ll come to regret. Harrow loses his house privileges.",
            "duration": 3000,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/mcvJPbaTty7GbtCCFgtDqk1rwzP.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 12,
          "name": "Margate Sands",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/bvDCvlKnoMBhqcc8JoSePRmAdUo.jpg",
            "plot": "Nucky makes a deal with Rothstein as his war with Gyp Rosetti reaches its climax. Season finale.",
            "duration": 3600,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/bvDCvlKnoMBhqcc8JoSePRmAdUo.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        }
      ]
    },
    {
      "season": 4,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/vywEAQJiyjtVJgSH1AMSu65AORA.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "Atlantic City, 1924: Nucky is laying low at the end of the Boardwalk after barely surviving an overthrow by gangster Gyp Rosetti. But the calm will be short-lived, as Nucky faces new challenges, including a clash with a violent Harlem power broker, a battle with his brother Eli over Eli's college-age son, and the irresistible lure of lucrative—and perilous—opportunities in Florida.",
        "year": "2013",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "New York Sour",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/3GJAXJVml4L2LKqUDhaFasCfOjv.jpg",
            "plot": "Following his battle with Gyp Rosetti, Nucky makes a peace offering to Joe Masseria while working the odds with Arnold Rothstein. While Chalky is busy running the Onyx Club on the Boardwalk, the impulsive Dunn Purnsley clashes with a booking agent. Fresh-faced Federal Agent Warren Knox arrives in Atlantic City to learn the ropes from Agent Sawicki. Gillian seeks custody of her grandson, Tommy, while trying to find a “good” man to keep the Artemis Club afloat. Eli’s college-age son, Willie, turns to Nucky for career advice. Al Capone enlists his brothers, Frank and Ralph, to help him expand his business in the Chicago suburb of Cicero. Richard Harrow returns to his violent ways.",
            "duration": 3540,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/3GJAXJVml4L2LKqUDhaFasCfOjv.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 2,
          "name": "Resignation",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/OELohLurf1GpSBvAoOkCEaFODs.jpg",
            "plot": "Now working as a “delivery man” for Dean O’Banion, Van Alden is ordered to keep tabs on Al Capone, joining the ascendant mobster to help keep Cicero voters “informed” at a political rally. Dr. Valentin Narcisse arrives in Atlantic City, clashing with Chalky and Nucky over the loss of an employee. In Washington, Agent Knox aligns himself with J. Edgar Hoover, acting director of the Bureau of Investigation. Harrow fails to finish a job in Milwaukee, while Eddie demands a promotion after 11 years of service. With a business opportunity on the horizon, Nucky departs for Florida.",
            "duration": 3480,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/OELohLurf1GpSBvAoOkCEaFODs.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 3,
          "name": "Acres of Diamonds",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/tHECv8V16veMmR0XyGeW9aSZZHv.jpg",
            "plot": "Nucky has reservations about investing in a Tampa land deal engineered by transplanted bootlegger Bill McCoy. While there, he meets speakeasy owner Sally Wheet. Valentin Narcisse books a sexy jazz singer, Daughter Maitland, to perform at the Onyx, and gauges Dunn Purnsley’s allegiance to Chalky. Willie, Eli’s son, turns to Mickey Doyle and his bootleg warehouse to elevate his social standing at college. Gillian agrees to pose as Roy Phillips’ wife to impress a possible partner. Harrow tries to bury his past, though not before taking care of some unfinished business with Emma.",
            "duration": 3360,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/tHECv8V16veMmR0XyGeW9aSZZHv.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 4,
          "name": "All In",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/k4eswmSZSGUbSAE43TIRVvXTog0.jpg",
            "plot": "Nucky gets to know Arnold Rothstein over a card game, and sizes up an unexpected partner for his Tampa land deal. A newly promoted Eddie Kessler gets detoured after making a train-station delivery. When one of their collectors is incapacitated, Al and Frank Capone decide to finish his route, enlisting a reluctant Van Alden to tag along. Agent Knox fills Hoover in on the Thompson operation, vowing to exploit Nucky's weakest link. Chalky is intrigued by Daughter Maitland’s presence. Dunn Purnsley goes to Harlem, and is courted by Valentin Narcisse. Willie and his college roommate, Clayton, carry a practical joke too far.",
            "duration": 3420,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/k4eswmSZSGUbSAE43TIRVvXTog0.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 5,
          "name": "Erlkönig",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/xkWkA3PPWYZfm9RiviykDBIE6Df.jpg",
            "plot": "Nucky heads to Philadelphia; Agent Knox detains Eddie Kessler to obtain information about Nucky's organization; Gillian tries to score a fix; Van Alden is recruited by the Capones.",
            "duration": 3540,
            "rating": "8.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/xkWkA3PPWYZfm9RiviykDBIE6Df.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 6,
          "name": "The North Star",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/2DHFOOaMHyAk7O68naah9oBouHm.jpg",
            "plot": "Nucky heads to Tampa to work out details of his land deal with Bill McCoy; Richard Harrow returns to Atlantic City; Agent Knox tries to gain Eli's trust; Chalky takes out his frustrations on Daughter Maitland.",
            "duration": 3540,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/2DHFOOaMHyAk7O68naah9oBouHm.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 7,
          "name": "William Wilson",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/lM2eSdEbKk8Ddb8UqtjXW9kDNcR.jpg",
            "plot": "Eli confronts Nucky after Willie makes an unpopular decision. Margaret has a surprise encounter at her job on Wall Street. Joe Masseria orders Lucky Luciano to return to Tampa and deal with Vincenzo Petrucelli. Gillian goes cold turkey, with Roy Phillips’ help. Still seething over his brother’s death, Al Capone tries to get Johnny Torrio to turn on rival gangster Dean O’Banion. As Chalky White and Daughter Maitland’s relationship deepens, Valentin Narcisse exerts his control over Dunn Purnsley and the Northside.",
            "duration": 3420,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/lM2eSdEbKk8Ddb8UqtjXW9kDNcR.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 8,
          "name": "The Old Ship of Zion",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/9Uk1vBWvjL8oIGFloEuNWgTgYs2.jpg",
            "plot": "Nucky’s shipment from Florida arrives with some unexpected cargo. Eli is backed into a corner after Agent Knox uncovers some new dirt on the Thompsons. After talking things over with Nucky, Willie reconsiders his recent life choices. Chalky throws down the gauntlet toward Valentin Narcisse, upholding his leadership on the Northside.",
            "duration": 3480,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/9Uk1vBWvjL8oIGFloEuNWgTgYs2.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 9,
          "name": "Marriage and Hunting",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/AplYmSTWJ2lW5ovB7rBnxqvKk72.jpg",
            "plot": "Nucky refuses to back Chalky in a conflict; Gillian makes her custody case in court; Van Alden stands up to Capone and comes clean to O'Banion; Rothstein tries to make a trade.",
            "duration": 3420,
            "rating": "6.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/AplYmSTWJ2lW5ovB7rBnxqvKk72.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 10,
          "name": "White Horse Pike",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/A6QHbRFwihuX1pLonzIs38CHcyE.jpg",
            "plot": "Nucky enlists Eli and Agent Knox to check the cargo in the Florida shipments; Margaret considers making a deal with Rothstein; Capone grows suspicious of Torrio; Nucky faces a dilemma.",
            "duration": 3240,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/A6QHbRFwihuX1pLonzIs38CHcyE.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 11,
          "name": "Havre de Grace",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/vBuzb1H1snnTafJUhCvKKyGOfiP.jpg",
            "plot": "Nucky takes inventory after being warned of a skunk in his cellar. On the lam following a close call, Chalky and Daughter take refuge outside Wilmington with Oscar Boneau, his mentor from years ago. Gillian considers selling her mansion and starting a new life with Roy Phillips.",
            "duration": 3480,
            "rating": "6.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/vBuzb1H1snnTafJUhCvKKyGOfiP.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 12,
          "name": "Farewell Daddy Blues",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/xUM7xPfRzpfhphdvljGMMVczu7U.jpg",
            "plot": "Eli braces for the worst as Agent Knox launches his plan to bring Nucky down. Capone and Torrio reach an agreement in Cicero. Chalky looks to settle scores. Richard steps forward to save Tommy, at Gillian’s expense",
            "duration": 3420,
            "rating": "8.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/xUM7xPfRzpfhphdvljGMMVczu7U.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        }
      ]
    },
    {
      "season": 5,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/xzRZ6ghxLTNepZA9YUnSBals1nC.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "It's 1931 and in stark contrast with the Roaring '20s, the country is now in the throes of the Great Depression. With the end of Prohibition in sight, Nucky looks to legitimize himself by forging alliances with liquor producers.",
        "year": "2014",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Golden Days for Boys and Girls",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/89tvX3ME2d8nNbZDdwRkdTccbXW.jpg",
            "plot": "Nucky reminisces about catching the Commodore's eye; Nucky joins Sally Wheet in Cuba; Margaret finds herself in the hot seat; Chalky tries to extricate himself from a difficult situation; Lucky Luciano sets a bold plan in motion.",
            "duration": 3480,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/89tvX3ME2d8nNbZDdwRkdTccbXW.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 2,
          "name": "The Good Listener",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/nGEJq95wFjsMm9r2AVoATTOjMgA.jpg",
            "plot": "Nucky pays a visit to Johnny Torrio; Eli and Van Alden must recoup money lost during a federal raid by Eliot Ness; Willie has a job interview; in 1884, young Nucky deals with the death of his sister.",
            "duration": 3360,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/nGEJq95wFjsMm9r2AVoATTOjMgA.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 3,
          "name": "What Jesus Said",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/xqoN57lNbcVtzJeYwxLQvqgX48Y.jpg",
            "plot": "Chalky heads in a new direction; Margaret finds herself in a quandary; Nucky hosts a prospective partner from Boston; Luciano and Siegel meet with Narcisse in Harlem; in 1884, young Nucky flirts with a girl.",
            "duration": 3240,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/xqoN57lNbcVtzJeYwxLQvqgX48Y.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 4,
          "name": "Cuanto",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/aXRw7PLsOB6lRo1rJf01szWdyMr.jpg",
            "plot": "Nucky and Margaret find common ground in Atlantic City; Luciano encounters an old adversary; Sally Wheet makes a payment in Cuba; in 1884, young Nucky moves up the Commodore's ladder.",
            "duration": 3540,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/aXRw7PLsOB6lRo1rJf01szWdyMr.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 5,
          "name": "King of Norway",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/1BRX8TfXpMSMamvg7ZfX8h9lVS8.jpg",
            "plot": "Chalky returns to Atlantic City; Nucky arranges a meeting with Maranzano; Eli reunites with June.",
            "duration": 3240,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/1BRX8TfXpMSMamvg7ZfX8h9lVS8.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 6,
          "name": "Devil You Know",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/7moyPF7oIqM89RRnVrI9Uq4ZvN3.jpg",
            "plot": "Federal agents enlist the help of Eli and Van Alden to take down the Capone organization.",
            "duration": 3480,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/7moyPF7oIqM89RRnVrI9Uq4ZvN3.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 7,
          "name": "Friendless Child",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/7Q39lU0e5mO332D2oFr5MlZx4NC.jpg",
            "plot": "Nucky tries to hold onto his assets in Atlantic City; Willie and Eli become involved in Nucky's war.",
            "duration": 3420,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/7Q39lU0e5mO332D2oFr5MlZx4NC.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 8,
          "name": "Eldorado",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/mJ6Nd833UUdHe40hLqu02BsZtdF.jpg",
            "plot": "Nucky plans to relocate to Manhattan; Margaret impresses Nucky and a grain company stockholder.",
            "duration": 3600,
            "rating": "8.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/mJ6Nd833UUdHe40hLqu02BsZtdF.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        }
      ]
    }
  ]
}