{
  "name": "Da Ali G Show",
  "category": "🄳 Da Ali G Show",
  "info": {
    "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/lHexYsGWvodXXRn7PXy2ii1MV8z.jpg",
    "bg": "https://image.tmdb.org/t/p/w500_and_h282_face/tGfmKBz06tXC1cA9AUKWtL45m7g.jpg",
    "plot": "Da Ali G Show is a British satirical television series created by and starring English comedian Sacha Baron Cohen. In the series, Baron Cohen plays three unorthodox journalists: faux-streetwise poseur Ali G, Kazakh reporter Borat Sagdiyev, and gay Austrian fashion enthusiast Brüno Gehard. These characters conduct real interviews with unsuspecting people, many of whom are celebrities, high-ranking government officials, and other well-known figures, during which they are asked absurd and ridiculous questions.",
    "rating": "6.9",
    "genre": [
      "comedy",
      "talk"
    ],
    "cast": [
      "Sacha Baron Cohen",
      "Sacha Baron Cohen",
      "Sacha Baron Cohen",
      "Daniel DiCriscio"
    ]
  },
  "seasons": [
    {
      "season": 1,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/7hq8kj28NoyWNSPgKwRmB222CC0.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "Also known as \"Da UK Seereez\"",
        "year": "2000",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Neil Hamilton",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/eNJuMht7I6khHO0mk11POqGZWlK.jpg",
            "plot": "Ali travels to the Cannes Film Festival, to pitch his new movie 'Booka' - named after the noise a gun makes. There's a lively discussion on animal rights, Neil Hamilton joins Ali on the sofa and the first ever contestant plays 'Who Wants to Win an Ounce?'. Elsewhere, Borat learns about British etiquette.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/eNJuMht7I6khHO0mk11POqGZWlK.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 2,
          "name": "Mohamed Al Fayed",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/g1N0bI3x4lKC6b1woDgXWrzSqy9.jpg",
            "plot": "Ali gets the low-down on the FB, Aiiii. There's rapping from Mohammed Al Fayed, and Borat finds out what it takes to be a true British huntsman.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/g1N0bI3x4lKC6b1woDgXWrzSqy9.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 3,
          "name": "Gail Porter",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/5ZCs5TJe7xh8zYYUikX57r6MKla.jpg",
            "plot": "Ali learns how to save the environment - and use guns to kill people. Later, he serenades the lovely Gail Porter, and Borat joins Cambridge University's young intelligentsia for a game of cricket.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/5ZCs5TJe7xh8zYYUikX57r6MKla.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 4,
          "name": "Roy Hattersley",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/70U9lePdLMYnXtdG6LGOkCsPwJN.jpg",
            "plot": "It's up to Ali G to turn the tables in the Third World - with turntables. Ali goes behind the scenes of US TV, and Roy Hattersley and Chrissie Hynde join Ali on the show.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/70U9lePdLMYnXtdG6LGOkCsPwJN.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 5,
          "name": "John Humphrys",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/4VYhNxFHiUkBcdi3bKz4i2Nat2a.jpg",
            "plot": "Ali interviews John Humphrys, presents his home shopping channel, QVG, and helps Fran Healy from Travis give 'Why Does It Always Rain on Me?' an urban twist, while Borat learns about British comedy.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/4VYhNxFHiUkBcdi3bKz4i2Nat2a.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 6,
          "name": "Anita Roddick",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/esh1hHHPINI1dCf2m0DqETJnweY.jpg",
            "plot": "Anita Roddick joins Ali in the studio to discuss some interesting new products for Body Shop, Borat feels the passion of the Henley Regatta, Jarvis insists on helping the aged, and Ali saves the world from an evil gunman and meets Jah in the process.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/esh1hHHPINI1dCf2m0DqETJnweY.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        }
      ]
    },
    {
      "season": 2,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/dbilTxnCgUW9DA21xANWbx3vLzY.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "First season of the US airing of \"Da Ali G Show\"",
        "year": "2003",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Law",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/rcM4pBAzEw7RYCD1uFLj3mrmixL.jpg",
            "plot": "Ali G tries his skills as a recruit with the Philadelphia Police Department. Borat explores the do's and don't's of dating in the U.S. Bruno gets the inside story on New York's Fashion Week. Ali G interviews former U.S. Attorney General Dick Thornberg.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/rcM4pBAzEw7RYCD1uFLj3mrmixL.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 2,
          "name": "War",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/8ZMfeHLogMhZDc40ang6lQViW9u.jpg",
            "plot": "Ali G interviews former U.N. Secretary General Boutros Boutros-Ghali and tours the U.N. Ali G conducts a roundtable discussion of experts on religion. Borat gets a lesson in etiquette. Ali G talks to General Brent Scowcroft.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/8ZMfeHLogMhZDc40ang6lQViW9u.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 3,
          "name": "Politics",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/4HrPsxgD5F7v7ERvcHQCCwp2RVg.jpg",
            "plot": "Ali G interviews Newt Gingrich. Bruno reports from New York's Fashion Week. Borat covers American hobbies at a gun club and gym. Ali G talks in the studio with a Drug Enforcement Agent. Ali G tries to sell a new business idea to Donald Trump.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/4HrPsxgD5F7v7ERvcHQCCwp2RVg.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 4,
          "name": "Art",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/feNj305RanY9w8nFt7XAo0wkqy8.jpg",
            "plot": "Ali G presents his guide to art. Ali G interviews James Lipton of \"Inside the Actors Studio.\" Ali G conducts a studio discussion on the media. Bruno delivers a guide to LA fashion. Ali G interviews Buzz Aldrin.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/feNj305RanY9w8nFt7XAo0wkqy8.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 5,
          "name": "Science",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/a4AoreV7ie2KmmcPFfEnhKAAXHC.jpg",
            "plot": "Ali G conducts a roundtable discussion on science. Borat visits a minor-league baseball team. Ali G interviews Ralph Nader. Borat visits a Nevada test site and protests nuclear testing. Ali G interviews C. Everett Koop.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/a4AoreV7ie2KmmcPFfEnhKAAXHC.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 6,
          "name": "Belief",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/3GuGsn2DAAOrvUqrOSSZNhvhrzQ.jpg",
            "plot": "Ali G pitches ideas for TV shows to Hollywood executives. Borat presents his guide to the South, touring a Charleston plantation and visiting a rodeo. Ali G conducts a studio discussion on sex. Bruno attends a football game in Alabama. Ali G interviews James Baker. Ali G attends a political rally. Ali G interviews Marlin Fitzwater.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/3GuGsn2DAAOrvUqrOSSZNhvhrzQ.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        }
      ]
    },
    {
      "season": 3,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/bDQWK0JXRdhL0081Lra7efxIRWb.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "Second season of the US airing of \"Da Ali G Show\"",
        "year": "2004",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Respek",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/c0s0hzy4MkmnmhekHxi9U31AWr1.jpg",
            "plot": "Ali G talks with Sam Donaldson, \"boss man of ABC News,\" about Nixon's \"Waterworld\" crisis, journalist biases and TV ratings, among other critical issues. Borat over-imbibes with a pair of genial gents at a wine tasting in Mississippi. Ali G probes the legal travails of \"The Simpsons\" with former LAPD police chief Daryl Gates, then questions a pair of ATF dog trainers about bomb-sniffers and canine discrimination.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/c0s0hzy4MkmnmhekHxi9U31AWr1.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 2,
          "name": "Rekognize",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/2eP9FwfsFJCaxBRBABCPWgzlshW.jpg",
            "plot": "Ali G has a serious sit-down with conservative icon Pat Buchanan, pondering the prospect of presidential partnerships, \"him\"igration pros and cons, and Iraq's possession of \"BLTs.\" Borat hits the campaign trail in Mississippi with a congressional candidate, then delivers a speech to the City Council after getting tips from the state's Republican Party chairman. Ali G presides over a family roundtable discussion with Michael Easley (senior pastor, The Immanuel Bible Church), Karen Mulhauser (Veteran Feminists of America), Diane Knippers (president of the Institute of Religion and Democracy) and Roger Lancaster (professor of Anthropology and Cultural Studies), then visits a farm in search of the answer to a question on everybody's mind: Why are there are so many Vietnam veterinarians?",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/2eP9FwfsFJCaxBRBABCPWgzlshW.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 3,
          "name": "Peace",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/8KELdArEveTIy3TpWRCvul8cT6d.jpg",
            "plot": "In New York to sell book ideas to high-profile publishers and agents, Ali G pitches the following would-be bestsellers: \"A Kiss on the Lips,\" a vibrating book designed to stimulate the mind and more; \"The Lord of the Rings,\" an adaptation of the hit films; an Ali G \"autobiography\" of President Bush; and more. Bruno chats with fashion guru Leon Hall about which celebrities should be kept \"in the ghetto\" or sent on a \"train to Auschwitz\"; later, Bruno and \"fashion police\" James Campbell and Randy McLaughlin rate the attire of such Hollywood notables as Renee Zellweger, Peter Jackson and Paris Hilton. Ali G interviews U.S. Olympic president (and former swimming star) John Nabor about the upcoming games in Greece, pondering why there isn't an Olympic competition for world-record events like Tallest Man or Longest Moustache. Borat travels to Nashville and Tucson to \"learn to be country star.\" There, he demonstrates a Kazakhstan line dance to willing square dancers, gets songwriting inspiration from country-music legend Porter Wagoner, and tests out a liberating new tune at a local lounge.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/8KELdArEveTIy3TpWRCvul8cT6d.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 4,
          "name": "Realize",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/gRiWCGA0W7sJ6omP1dJdanXBvNl.jpg",
            "plot": "Ali G ponders issues of security - from airports to dogs to trains to green cards - with former Commissioner of the Immigration and Naturalization Service James Ziglar. On the road to sample some of America's favorite hobbies, Borat winds up wrestling with a self-defense expert, making music with a yoga teacher, and sniffing up members of a new-age dance class. Ali G chats with former EPA Administrator and New Jersey Governor Christie Whitman about solar energy and dirty water, then pays a visit on some earth-minded protestors perched in the redwoods. In Miami, Bruno discusses the future of clubbing with Nerve Lounge owner James Butler, and later plays bouncer at a South Beach hot spot. Finally, Ali G moderates a expert panel discussion on animal rights, focusing on kitchen experiments, fur coats, P. Diddy, horse sex and more.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/gRiWCGA0W7sJ6omP1dJdanXBvNl.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 5,
          "name": "Jah",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/eANEDydfed5l492bPCNOSgZwQNN.jpg",
            "plot": "Ali G muses about Moses and the U.S. Constitution with historian/author/\"hair stylist\" Gore Vidal, then pays a visit to Mt. Vernon, the home of Washington (alas, Denzel isn't at home). Borat goes house-shopping with a realtor, taking time to ask essential buyer's questions about integration, burial sites, padded cells and bathroom soundproofing. Ali G explores safe-sex issues via a genitalia model with sex educator Sally Epstein. Bruno falls hard for a barn dancer in Georgia, but is devastated to find his obsession ultimately unrequited. Ali G conducts a panel on medical ethics with several renowned experts, pressing his guests on issues of cloning (why not clone Carmen Electra?), euthanasia (vs. \"youth in Asia\") and plastic surgery.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/eANEDydfed5l492bPCNOSgZwQNN.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 6,
          "name": "Realness",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/jhpIEzZpn3f2W4LuUgNhjc5GyFx.jpg",
            "plot": "Ali G gets relationship advice from Men are From Mars, Women are From Venus author John Gray. Excited to discuss reproductive rights with a lesbian couple (after all, \"he's got loads of\" their videos), Ali G then goes to a pro-choice march in Washington, where he questions pro-lifers about their beliefs. Borat goes job-hunting, learning about American work ethics from various employment agencies. Ali G talks money with former presidential economics advisor Charles Schultze, who gives stock market advice (\"don't be high when you're buying and selling\"). Bruno gets wrestling lessons from a college team on spring break in Daytona Beach. And finally, Ali G gets some grammar tips from 60 Minutes pundit Andy Rooney.",
            "duration": 1800,
            "rating": "0.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/jhpIEzZpn3f2W4LuUgNhjc5GyFx.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        }
      ]
    }
  ]
}