{
  "name": "Mr. Bean",
  "category": "🄼 Mr. Bean",
  "info": {
    "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/pUNQV35kDaKuejnXGNiUeEBurNE.jpg",
    "bg": "https://image.tmdb.org/t/p/w500_and_h282_face/3ILUdTEetxZZ8RkPxf5e0H9pCcP.jpg",
    "plot": "Mr Bean turns simple everyday tasks into chaotic situations and will leave you in stitches as he creates havoc wherever he goes.",
    "rating": "7.949",
    "genre": [
      "comedy",
      "family",
      "drama"
    ],
    "cast": [
      "Rowan Atkinson"
    ]
  },
  "seasons": [
    {
      "season": 1,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/eqKz6ipwv9TYulzf5ARnFfAvaXT.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "",
        "year": "1990",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Mr. Bean",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/eCVpfYgIYO02bRPtemWa0yO5DFj.jpg",
            "plot": "Mr. Bean attends a mathematics exam, where he tries to copy from a student under the nose of the invigilator, when he realizes that he has studied the wrong maths equations. Afterwards, he surreptitiously changes into his swimming trunks so as not to be noticed by someone sitting nearby at a beach. And later struggles to stay awake during a church service and obnoxiously sings the refrain of the hymn \"All Creatures of Our God and King,\" much to the annoyance of the man sitting next to him, Mr. Sprout.",
            "duration": 1500,
            "rating": "8.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/eCVpfYgIYO02bRPtemWa0yO5DFj.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 2,
          "name": "The Return of Mr. Bean",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/5MalPqac0649f8UWhsAI34LSO09.jpg",
            "plot": "Mr. Bean goes to a department store and buys various items. Afterwards, he goes to a fancy restaurant where he tries to dispose his awful-tasting meal. And finally, Bean goes to a Royal greeting and gets into mischief.",
            "duration": 1500,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/5MalPqac0649f8UWhsAI34LSO09.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 3,
          "name": "The Curse of Mr. Bean",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/4sPKI5vqwdkIzOVX7vSBjrFMVjc.jpg",
            "plot": "Mr. Bean goes to a swimming pool, where he finds himself scared to death on the high diving board. When he's done, he tries several different ways to get his car out of the parking garage after he realizes he doesn't have enough money to do it the normal way. After that, he sits on a park bench and uses an unusual method of making himself a sandwich. Finally, he goes to a cinema and tries to survive a terrifying horror movie with his girlfriend.",
            "duration": 1500,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/4sPKI5vqwdkIzOVX7vSBjrFMVjc.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 4,
          "name": "Mr. Bean Goes to Town",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ujlR2qex7qn0EPdkyyxrm8tphth.jpg",
            "plot": "Mr. Bean purchases a new TV, only to experience a spot of reception trouble. He then takes a stroll in the park to try out his new camera, which is promptly stolen. This leads to an identity parade, where Bean does his best to discover the identity of the camera thief. Later, Bean's night on the town spells disaster for a stage magician. Lastly, Mr. Bean shows off his dancing skills at Club Phut.",
            "duration": 1440,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ujlR2qex7qn0EPdkyyxrm8tphth.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 5,
          "name": "The Trouble with Mr. Bean",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/2qQ8lDdhyreG1i8byYsqsU2SNdG.jpg",
            "plot": "Mr. Bean, late for his dental appointment, tries to get dressed and clean his teeth whilst on the way. After arriving just in time for the appointment, he ends up administering an anesthetic to the hapless dentist. After visiting the dentist, Bean has a picnic in the park, where he tangles with a pesky fly and a remote-control toy boat.",
            "duration": 1500,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/2qQ8lDdhyreG1i8byYsqsU2SNdG.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 6,
          "name": "Mr. Bean Rides Again",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/vPBelFdpzlYlsJm1QOKJoKcrrYJ.jpg",
            "plot": "At the bus stop, Mr. Bean tries his best to revive a heart attack victim before using an ambulance to jump-start his own mini-car. Later, when posting a letter, he loses his only stamp, but that doesn't stop him from sending his letter anyway. Whilst preparing for his holiday, Mr. Bean demonstrates a novel (if not entirely efficient) method of packing, then disposes of a bothersome train passenger, and tries to entertain an airsick boy during a plane flight.",
            "duration": 1440,
            "rating": "8.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/vPBelFdpzlYlsJm1QOKJoKcrrYJ.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 7,
          "name": "Merry Christmas Mr. Bean",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/nzi0jTE5RILEjFwXElQA5YlE7ti.jpg",
            "plot": "While Christmas shopping, Mr. Bean purchases a bulky string of tree lights before making a shambles of a department store toy section. He later manages to acquire a free turkey and Christmas tree, and attempts to conduct a Salvation Army band. Finally, during Christmas dinner, Bean has quite a surprise in store for his long-suffering girlfriend.",
            "duration": 1620,
            "rating": "8.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/nzi0jTE5RILEjFwXElQA5YlE7ti.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 8,
          "name": "Mr. Bean in Room 426",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/oYXH6Zq0g4Ec9DfoTCvjEEpQ6pR.jpg",
            "plot": "Mr. Bean goes to a hotel where he causes trouble and seeks competition in his hotel neighbor. After he eats some spoiled oysters, he wakes up at night from some loud noise and ends up being locked out of his room.",
            "duration": 1500,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/oYXH6Zq0g4Ec9DfoTCvjEEpQ6pR.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 9,
          "name": "Do-It-Yourself Mr. Bean",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/xDQBOFjmzyw9LchGGLNo0k58kl1.jpg",
            "plot": "On New Year's Eve, Bean hosts his very own party with his friends Rupert and Hubert, but it isn't long before his guests discover that there is more fun at the party next door and trick Bean into letting them go. The following morning on New Year's Day, Bean buys some new tools and a large recliner armchair at the January sales of a department store and has a unique way of driving home. He then tries painting his flat himself and starts off the new year with a bang.",
            "duration": 1500,
            "rating": "8.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/xDQBOFjmzyw9LchGGLNo0k58kl1.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 10,
          "name": "Mind the Baby, Mr. Bean",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/mJVQKV34kjzPnyJedYFiRqEGkZ9.jpg",
            "plot": "On his way to the Southsea funfair, Mr. Bean accidentally becomes lumbered with a baby boy with no idea of how or where he came from, forcing him to try having fun at the fair with the baby. Throughout the day, the baby manages to survive Bean's unique style of mishaps before eventually being reunited with his mother.",
            "duration": 1500,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/mJVQKV34kjzPnyJedYFiRqEGkZ9.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 11,
          "name": "Back to School Mr. Bean",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/zdtiPmF7faFj2DErmdZiXohfrZs.jpg",
            "plot": "Mr. Bean attends an open day of a local school, where he unleashes his usual brand of chaos in the various classes he visits. Afterwards, Bean's day soon takes a sombre turn when he finds that his Mini isn't parked where he left it and is crushed by an Army Tank during the demonstration.",
            "duration": 1500,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/zdtiPmF7faFj2DErmdZiXohfrZs.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 12,
          "name": "Tee Off, Mr. Bean",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/yeL9cnbV9Y1L8F7m4FfMRnzwx9C.jpg",
            "plot": "After causing chaos at the town launderette while having his laundry cleaned, Bean tries his hand at mini golf, but after being told by the course's owner that he can only touch the ball with the club and not with his hands, Bean's poor aim leads him on an elaborate tour around town before ultimately returning to the course several hours later with a final score of 3,427 strokes.",
            "duration": 1500,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/yeL9cnbV9Y1L8F7m4FfMRnzwx9C.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 13,
          "name": "Goodnight, Mr. Bean",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/rjClkEkaRGmISEyaOaCJpVAf0KV.jpg",
            "plot": "At a hospital waiting room, Bean uses various methods to skip ahead of the queue but his antics backfire. Later at a park, he decorates Queen's Guard, so that he can take a picture. And at the end of the day, Bean tries to cure his insomnia with some unusual methods at home.",
            "duration": 1440,
            "rating": "8.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/rjClkEkaRGmISEyaOaCJpVAf0KV.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        },
        {
          "episode": 14,
          "name": "Hair by Mr. Bean of London",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/kUxn2OpqlNxXnKDtZQlCbXiQplg.jpg",
            "plot": "At a barbershop, Mr. Bean inadvertently holds the fort for the barber when he is distracted by a phonecall, resulting in him giving several customers terrible haircuts. Later, Bean heads to a fête, where he cheats at all the games and enters Teddy into a children's pet show, where his inanimacy allows Bean to pass all the obedience tests with flying colours. And finally, after a train journey, Bean accidentally loses his ticket and unsuccessfully tries to sneak out past the station's guard inside a mail bag.",
            "duration": 1620,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/kUxn2OpqlNxXnKDtZQlCbXiQplg.jpg"
          },
          "video": "",
          "drm": "",
          "drmkey": ""
        }
      ]
    }
  ]
}