{
  "name": "Rome",
  "category": "🅁 Rome",
  "info": {
    "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/1A1BwgWO3Sw379VEhR0vkTuE3XW.jpg",
    "bg": "https://image.tmdb.org/t/p/w500_and_h282_face/b2fhZk0xB2TgMsDXT6goR28PoHX.jpg",
    "plot": "A down-to-earth account of the lives of both illustrious and ordinary Romans set in the last days of the Roman Republic.",
    "rating": "8.3",
    "genre": [
      "action & adventure",
      "drama"
    ],
    "cast": [
      "Kevin McKidd",
      "Ray Stevenson",
      "Ciarán Hinds",
      "James Purefoy",
      "Polly Walker"
    ]
  },
  "seasons": [
    {
      "season": 1,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/iGK1cbNM6gmBLoyWzrcmwG8qazR.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "Season one begins in 52 B.C. as Gaius Julius Caesar completes his quest of Gaul after eight years of war and prepares to return with his army to Rome. But while Caesar's self-interested niece Atia and long-lost paramour Servilia anxiously await his return, the ruling patricians despair that Caesar's homecoming will disrupt the status quo. As Caesar's legions move closer to Rome, allegiances are put to the test for both soldiers and civilians — and the escalating tensions climax with a full-scale conflict destined to change history.",
        "year": "2005",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "The Stolen Eagle",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/3rmGAjIxIT6xWXyhMIaSgUQ6bIj.jpg",
            "plot": "Eager to return to Rome after eight long years of war, Gaius Julius Caesar ends his campaign with a resounding triumph in Gaul, and news of a shattering personal loss at home. In Rome, Caesar's old friend Pompey is counselled by the Senate, who worry about Caesar's growing popularity. Two soldiers are enlisted to find the army's stolen gold standard. Atia is careful to play both sides of an escalating power struggle.",
            "duration": 3000,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/3rmGAjIxIT6xWXyhMIaSgUQ6bIj.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 2,
          "name": "How Titus Pullo Brought Down the Republic",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/xFxDaT7fWUo2PRkuuwlq82or0YN.jpg",
            "plot": "Anointed People's Tribune by Caesar, Mark Antony returns to Rome with Octavian's liberators, Vorenus and Pullo. After being feted by a grateful Atia, Vorenus heads home to his family, for the first time in eight years, while Pullo heads for the brothels. Pompey drafts an ultimatum stripping the general of his power.",
            "duration": 2880,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/xFxDaT7fWUo2PRkuuwlq82or0YN.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 3,
          "name": "An Owl in a Thornbush",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/w659vWwyFOJUI5ugs5bQm4jjrCC.jpg",
            "plot": "With Caesar quickly advancing toward Rome, Pompey begins ordering a retreat and forces his citizens to pick sides. Timon is forced to do Atia's dirty work and Vorenus cannot understand why no one is resisting while on a scouting mission.",
            "duration": 2520,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/w659vWwyFOJUI5ugs5bQm4jjrCC.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 4,
          "name": "Stealing From Saturn",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/oDCFP6XMBsT3mGvOXVjHyvvkesA.jpg",
            "plot": "As Pompey \"maneuvers\" outside the city, Caesar seeks to consolidate his hold on Rome. Atia throws a party to welcome Caesar home, while Vorenus throws one of his own to usher in his new life as a citizen businessman. Pullo's run of luck continues when he delivers Quintus Pompey to Caesar, who in turn returns Quintus to his father's camp, with an offer of truce he knows Pompey will never accept.",
            "duration": 3120,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/oDCFP6XMBsT3mGvOXVjHyvvkesA.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 5,
          "name": "The Ram Has Touched the Wall",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/2xzObOsh5OxC0yvMkdrdegAvvsi.jpg",
            "plot": "Caesar weighs Pompey's counteroffer against Antony's recommendation to chase down Pompey's vulnerable army. Vorenus is forced to reconsider his career choices after a series of business setbacks leave him with little income to support his family. A jealous Atia concocts a clever scheme to separate Caesar from Servilia. Pullo is recruited to tutor Octavian in the art of soldiering, but ends up learning a lesson or two from the boy.",
            "duration": 3120,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/2xzObOsh5OxC0yvMkdrdegAvvsi.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 6,
          "name": "Egeria",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/6mB3QV4Ltcdc17xvDqCnQ9HtEpq.jpg",
            "plot": "When Caeser finds himself outnumbered by Pompey's legions, he asks Antony to join the fight. Marc Antony is having fun in his new political life while he ponders a counter-offer from Pompey. Atia urges Octavian to take another step toward manhood. Vorenus and Niobe try to bring passion back to their marriage.",
            "duration": 3360,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/6mB3QV4Ltcdc17xvDqCnQ9HtEpq.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 7,
          "name": "Pharsalus",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/8OpUsF7Ue9w6gTuRycsLsd2WYUE.jpg",
            "plot": "Pompey attacks an outnumbered Caesar. Vorenus and Pullo are stranded at sea. Atia continues to seek out Servilla's friendship in order to ensure her protection, while Octavia and Servilla's bond grows.",
            "duration": 3360,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/8OpUsF7Ue9w6gTuRycsLsd2WYUE.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 8,
          "name": "Caesarion",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/vSlGn8TiTPQZsjMy6pvlxJI7Kqk.jpg",
            "plot": "Having pursued Pompey into Egypt, Caesar arrives in Alexandria and meets the boy king Ptolemy XIII, who offers the general a surprise gift. Vorenus and Pullo play liberators again, freeing Ptolemy's incarcerated sister, Cleopatra. Caesar seeks payment from Egypt for past debts, and ends up forging a strategic union to ensure his legacy.",
            "duration": 3180,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/vSlGn8TiTPQZsjMy6pvlxJI7Kqk.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 9,
          "name": "Utica",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ApzFVFoH04qzsqBsiPLatqjblP5.jpg",
            "plot": "With Scipio and Cato defeated, Caesar returns home to a hero's welcome. Vorenus and Pullo's showdown with local thug Erastes gets an unexpected reprieve from Caesar. Servilia's plan to use Octavia to unearth a secret about Caesar backfires.",
            "duration": 3240,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ApzFVFoH04qzsqBsiPLatqjblP5.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 10,
          "name": "Triumph",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/spn70J38AkEQuivJSCATlqhHOsH.jpg",
            "plot": "Unanimously proclaimed Dictator by the Senate, Caesar pronounces the war over, and prepares for five days of feasting and games honoring his \"triumph.\" No longer an enlisted soldier, Pullo eyes a pastoral future with Eirene, while Vorenus runs for municipal magistrate, with Posca's help. Meanwhile, Octavian retrieves Octavia from her self-imposed exile. And Servilia invites a revenge-minded Quintus Pompey into her home, to Brutus' dismay.",
            "duration": 3180,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/spn70J38AkEQuivJSCATlqhHOsH.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 11,
          "name": "The Spoils",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/cSLvQ5d5DlwpbgGvqWt9YSVUQH2.jpg",
            "plot": "Vorenus sees to it that veteran soldiers receives severance on behalf of Caesar, and is then invited along with Niobe to one of Atia's parties.",
            "duration": 2940,
            "rating": "8.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/cSLvQ5d5DlwpbgGvqWt9YSVUQH2.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 12,
          "name": "Kalends of February",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/gMjiv39dkj4nmPVMQTxD9742zKU.jpg",
            "plot": "Pullo and Vorenus are now heroes in the eyes of the Roman rank and file because of their arena feats. This causes Caesar to bestow rewards to those he might normally punish.",
            "duration": 2880,
            "rating": "8.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/gMjiv39dkj4nmPVMQTxD9742zKU.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        }
      ]
    },
    {
      "season": 2,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/vvwmV0ZdHNjiJy3bHOb62iv3jPD.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "Season two's storyline picks up right where season one left off: with the 44 B.C. assassination of Gaius Julius Caesar and the near-simultaneous death of Niobe, wife of Caesar's faithful bodyguard Lucius Vorenus. Diverted from his post after learning that Lucius, his assumed grandson, was in fact Niobe's illegitimate son, Vorenus now descends into near-madness over his failure to protect Caesar, his role in his spouse's death, and the rumored murder of his estranged daughters.",
        "year": "2007",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Passover",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/qzYsR5doNQePPyR5uRswoMPosVh.jpg",
            "plot": "Things pick up shortly after Caesar's murder. Octavian wants to keep his family from fleeing the city so he devises a plan. News of this makes Antony happy so he tells Brutus. Vorenus mourns Niobe's death but casts aspersions upon his children.",
            "duration": null,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/qzYsR5doNQePPyR5uRswoMPosVh.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 2,
          "name": "Son of Hades",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/3hVKW6anpBIsg1lk4WLjBU6XDHy.jpg",
            "plot": "Cleopatra arrives in Rome to pay her homage to Caesar, and to seek legitimization for Caesarion. Egypt's queen causes further complications between Anthony and Atia, who still struggles with Servilia. Timon's brother arrives from Jerusalem. The death of Erastes throws the underworld, and Rome's river commerce into chaos, and Pullo and Vorenus step into the gap. Octavian and Anthony begin a long and bitter rivalry with a dispute over Caesar's will and sharing of power.",
            "duration": null,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/3hVKW6anpBIsg1lk4WLjBU6XDHy.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 3,
          "name": "These Being the Words of Marcus Tullius Cicero",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/9HAFY3cAF4t6oOIbKqWCl9cs6QJ.jpg",
            "plot": "Brutus and Cassius struggle to raise foreign armies to oppose the Cesarean party. Mark Antony's plans to change his post-consul proconsular governorship from Macedonia to Gaul are derailed when Cicero delivers an in-absentia message to the Senate, and throws his support behind Octavian. Vorenus struggles to contain an all-out gang war in the Aventine Collegium, of his own making, that he blames on Pullo. In the house of the Julii, Octavia passes the hours in a drug induced daze, while a duplicitous youth named Duro, planted amongst the Julii by Servilia, looks for the chance to set a deadly plan in motion.",
            "duration": null,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/9HAFY3cAF4t6oOIbKqWCl9cs6QJ.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 4,
          "name": "Testudo et Lepus (The Tortoise and the Hare)",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/8BywtildxOeAovfdVtgy2xc5XO2.jpg",
            "plot": "Pullo races to find Vorenus with news of his family's fate. Servilia's plans to eliminate a rival exact a high price from her. Cicero is astonished when Octavian sends word that his victorious legions are coming home to Rome. In Rome, Timon finally grows weary of Atia's bidding.",
            "duration": null,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/8BywtildxOeAovfdVtgy2xc5XO2.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 5,
          "name": "Heroes of the Republic",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/g4RI5MnLEWr3smDH6P8qpKwvEDN.jpg",
            "plot": "Despite Pullo's advice, Vorenus and his family return to the Collegium with his family who is reunited, and cleansed of their ordeal. Octavian is denied a triumph and urges Cicero to endorse his bid to be made Consul in exchange for an agreement to allow Cicero to veto his actions. Octavian takes both Cicero and the Senate by surprise with his first Consular act. Vorenus attempts' to make peace with Memmio and Cotta create suspicions that he has gone soft.",
            "duration": null,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/g4RI5MnLEWr3smDH6P8qpKwvEDN.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 6,
          "name": "Philippi",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/obKsOySzhzDNWJMYr3i631IWNz2.jpg",
            "plot": "Vorenus receives orders to plunge Rome into a bloodbath the likes that have not been seen since the dictatorship of Sulla. Octavia reveals her secret to Atia, and the armies of the Liberators and the Caesarians clash for the last time, with the fate of Republic in the balance.",
            "duration": null,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/obKsOySzhzDNWJMYr3i631IWNz2.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 7,
          "name": "Death Mask",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/50G0zEtmAmSI1j7WEekBlVxbJ9c.jpg",
            "plot": "Antony's nature reasserts itself, and challenges his alliance with Octavian. Timon and Levi set themselves against Herod's plans. Servilia's public displays of grief leave Atia unsettled. Gaia uses Pullo's punishment as a weapon against him. His daughter's sudden interest in business matters arouses Vorenus' suspicions. Posca gets married.",
            "duration": 3300,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/50G0zEtmAmSI1j7WEekBlVxbJ9c.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 8,
          "name": "A Necessary Fiction",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/rIBNFo6x3SPaGhlMXZhhxY8LXIJ.jpg",
            "plot": "Octavian proclaims a new era of virtue in Rome, a program that his family and subordinates find impossible to obey. Vorenus is sent on a mission after a missing shipment of gold to discover who mysteriously hijacked it on its way to the Roman treasury. Pullo's loss and rage are channeled against Memmio, Omnipor and their henchmen. Octavian pursues Livia as an \"appropriate\" bride, and issues Mark Antony an ultimatum he knows he can't refuse.",
            "duration": null,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/rIBNFo6x3SPaGhlMXZhhxY8LXIJ.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 9,
          "name": "Deus Impeditio Esuritori Nullus (No God Can Stop a Hungry Man)",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/r0io4W1G0hAAvXeDrLT5vj3lRUL.jpg",
            "plot": "The people of Rome are starving. There have been many grain shortages over the past few months, but things have gotten particularly bad. In hopes of keeping the people from openly rebelling, Octavian sends Atia and Octavia to Alexandria in order to negotiate a deal with Mark Antony, though his real reasons for their trip is soon revealed. Meanwhile, Titus Pullo and Lucius Vorenus must try to keep the peace amongst many of the mercenaries who are in Rome.",
            "duration": null,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/r0io4W1G0hAAvXeDrLT5vj3lRUL.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 10,
          "name": "De Patre Vostro (About Your Father)",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/tot1oiUfuGtfK0E7MATrZeBFcx.jpg",
            "plot": "Following his naval defeat at Actium, Marc Antony returns to Egypt, where he and Cleopatra settle into a world of debauchery. Octavian tries to use Pullo as leverage to Vorenus to gain acess to the palace, but Vorenus stays loyal to Antony. Finally, it is Cleopatra who dupes Antony, saving her own life by sacrificing her honor. Ceasar Augustus triumphs in Rome.",
            "duration": null,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/tot1oiUfuGtfK0E7MATrZeBFcx.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        }
      ]
    }
  ]
}