{
  "name": "Supernatural",
  "category": "🅂 Supernatural",
  "info": {
    "poster": "https://media.themoviedb.org/t/p/w220_and_h330_face/KoYWXbnYuS3b0GyQPkbuexlVK9.jpg",
    "bg": "https://media.themoviedb.org/t/p/w500_and_h282_face/lirPqYLTtd6XZqGn4cS1wiesTq0.jpg",
    "plot": "When they were boys, Sam and Dean Winchester lost their mother to a mysterious and demonic supernatural force...",
    "rating": "8.3",
    "genre": [
      "drama",
      "mystery",
      "sci-fi & fantasy"
    ]
  },
  "seasons": [
    {
      "season": 1,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/fFn80y3PPmCcTbIIjQS5ft0jNFc.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "The Creepy. The Demented. The Unexplained. The Unearthly. Sam Winchester grew up hunting such terrifying things. But that’s all past. Law school beckons him. So does safety and normalcy. That is, until Sam’s estranged brother Dean appears with troubling news: their father has disappeared, a man who’s hunted evil for 22 years. So to find their father, the brothers must hunt what their father hunts…and Sam must return to the life he’d rather leave behind.",
        "cast": [],
        "year": "2005",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Pilot",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/iSeqdxMYlRhWoJpRcRTZknygVfl.jpg",
            "plot": "Two brothers, Sam and Dean Winchester,  witness their mother's paranormal death as children and grow up trained  to fight by a distraught father who wants nothing more then to hunt  down the thing that killed his wife. Sam escapes to college to start a  new, normal life, but gets pulled back in after Dean shows up on his  doorstep to tell him their father is missing.\n\nFollowing clues from an  eerie phone message from him, the boys travel to a small town and  encounter a vengeful spirit called the \"Woman in White\" who then starts  to haunt Sam.",
            "director": [],
            "duration": 2760,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/iSeqdxMYlRhWoJpRcRTZknygVfl.jpg"
          },
          "video": ""
        },
        {
          "episode": 2,
          "name": "Wendigo",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/9SsuC4koeryryoUNgnQYAwkKGAV.jpg",
            "plot": "Sam and Dean follow the coordinates  left in their father's journal and land in the middle of the woods where  they investigate the disappearance of several campers. The two brothers  soon learn they are dealing with a Wendigo, a creature made famous in  Native America legends. A Wendigo is a former human whose cannibalism  has transformed him into a creature with superhuman strength and speed  that feasts on human flesh.",
            "director": [],
            "duration": 2580,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/9SsuC4koeryryoUNgnQYAwkKGAV.jpg"
          },
          "video": ""
        },
        {
          "episode": 3,
          "name": "Dead in the Water",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/sNMPGr6wOY0K8ryzU78Z4YbHWgg.jpg",
            "plot": "Sam and Dean investigate a series of  mysterious drownings written off as suicides. They discover the spirit  is an angry little boy with the power to travel through water who is  taking revenge on certain town inhabitants for a dark secret buried long  ago. Dean forms a bond with a young boy who seems to have the power of  premonition.",
            "director": [],
            "duration": 2580,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/sNMPGr6wOY0K8ryzU78Z4YbHWgg.jpg"
          },
          "video": ""
        },
        {
          "episode": 4,
          "name": "Phantom Traveler",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/49dxvbn8V3f4g8aSBLxo6zQYxg9.jpg",
            "plot": "On TransNational flight 2485, a man possessed by the spirit of the  Phantom Traveler causes the plane to crash, leaving only five survivors  left alive. Sam and Dean must exorcise  the angry spirit before it attacks the survivors. The brothers realize  the only way to do that is to take the battle to the skies.",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/49dxvbn8V3f4g8aSBLxo6zQYxg9.jpg"
          },
          "video": ""
        },
        {
          "episode": 5,
          "name": "Bloody Mary",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/jUZ8ni4qGRV2cOcZpjLnlC4luyj.jpg",
            "plot": "In suburban Nebraska, a group of partying high school teens jokingly  dare their friend Charlie to look into  the mirror and repeat \"Bloody Mary, Bloody Mary, Bloody Mary,\" not  knowing this will unleash a series of mysterious murders. Sam and Dean realize that Bloody Mary has the  power to travel through all reflective surfaces when she is hunting a  victim. Worried that teens are accidentally summoning Bloody Mary, Sam  and Dean race to destroy the violent spirit before she can kill again.",
            "director": [],
            "duration": 2580,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/jUZ8ni4qGRV2cOcZpjLnlC4luyj.jpg"
          },
          "video": ""
        },
        {
          "episode": 6,
          "name": "Skin",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/fyCKr3B3nJejxnKsp2cOk5aOjZG.jpg",
            "plot": "Sam and Dean come to the aid of Sam's  old college buddy after he is accused of a murder he swears he didn't  commit. The brothers discover a shapeshifter is adopting the likenesses  of others and murdering people. The brothers' race to stop the  shapeshifter takes a terrifying turn when he shifts into the likeness of  Dean.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/fyCKr3B3nJejxnKsp2cOk5aOjZG.jpg"
          },
          "video": ""
        },
        {
          "episode": 7,
          "name": "Hook Man",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/iBMkAHb3PaMmTCaorSAKJVoIsio.jpg",
            "plot": "The infamous \"Hook Man,\" a vengeful spirit who kills his victims with a shiny hook that serves as his hand, terrorizes a small college town in Iowa. Sam and Dean learn that all the victims are connected to the daughter of a local minister and race to find and destroy the Hook Man's bones before he comes for them.",
            "director": [],
            "duration": 2400,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/iBMkAHb3PaMmTCaorSAKJVoIsio.jpg"
          },
          "video": ""
        },
        {
          "episode": 8,
          "name": "Bugs",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/2Li4EY0ccNPyCwKmPBQ4NavS8fe.jpg",
            "plot": "After a construction worker is killed by insects burrowing into his  brain, Sam and Dean investigate the  town's history and find that the new housing development is being built  on sacred Indian land. The Indians put a curse on the land after their  reservation had been ravished and destroyed. Sam and Dean must find a  way to survive and kill the deadly swarm of bees, locusts, spiders and  beetles.",
            "director": [],
            "duration": 2580,
            "rating": "6.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/2Li4EY0ccNPyCwKmPBQ4NavS8fe.jpg"
          },
          "video": ""
        },
        {
          "episode": 9,
          "name": "Home",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/jeOq4SZVtEK1wgwZvmGApvT76xC.jpg",
            "plot": "Sam is haunted by a vision of a woman trapped in his  childhood house and convinces a reluctant Dean that they  need to go home. Upon arrival, they meet the woman in Sam's premonition  and she reveals that the house is haunted. Looking into their personal  history, the brothers discover their father had visited a psychic after their mother's  death and they turn to the same woman for answers of their own.  Together they discover a malevolent poltergeist has inhabited the house  and set out to exorcise it, but are blindsided when another unseen  spirit steps in.",
            "director": [],
            "duration": 2580,
            "rating": "8.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/jeOq4SZVtEK1wgwZvmGApvT76xC.jpg"
          },
          "video": ""
        },
        {
          "episode": 10,
          "name": "Asylum",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/nKtUaiCz9K6kh0PQlb22VvfyrdH.jpg",
            "plot": "Sam and Dean investigate an abandoned  sanitarium and discover that when the hospital was open, the patients  held a revolt against the cruel and unusual punishments inflicted by the  head doctor. While the brothers search the premises for four lost  college students, the tortured spirits cause them to go insane, turning  Dean against Sam.",
            "director": [],
            "duration": 2580,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/nKtUaiCz9K6kh0PQlb22VvfyrdH.jpg"
          },
          "video": ""
        },
        {
          "episode": 11,
          "name": "Scarecrow",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/oolec0MS18b2PhBlT3BGiKsXCQs.jpg",
            "plot": "Sam and Dean finally make contact with their father,  but he tells them to stop looking for him and sends them on another  ghost-hunting job. Frustrated with their father's evasiveness, Sam sets  out alone to find him while Dean stays back to obey his father. Dean  investigates a small town in Indiana where couples have gone missing the  same day each year and discovers the farmers are sacrificing them to a  Pagan God who takes the form of a scarecrow.",
            "director": [],
            "duration": 2580,
            "rating": "8.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/oolec0MS18b2PhBlT3BGiKsXCQs.jpg"
          },
          "video": ""
        },
        {
          "episode": 12,
          "name": "Faith",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/FwKYN4eAgBdtNXw3gMANIlglL6.jpg",
            "plot": "While battling a demon, Dean is electrocuted, resulting  in permanent damage to his heart and leaving him with only a couple of  months to live. A despondent Sam searches desperately  for a way to save his brother and believes he may have found an answer  through a preacher who claims to heal the incurable. However, Dean and  Sam discover that the preacher is getting help from the Grim Reaper who  is trading one life for another he feels is less worthy.",
            "director": [],
            "duration": 2580,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/FwKYN4eAgBdtNXw3gMANIlglL6.jpg"
          },
          "video": ""
        },
        {
          "episode": 13,
          "name": "Route 666",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/nVP1dEu0xSw4fV5jwlizE0dCXTP.jpg",
            "plot": "Dean is contacted by his first love Cassie, an African-America girl, who asks him to come to  Mississippi to investigate a string of racially motivated murders. Each  murder is linked to a mysterious truck that seems to have no driver and  leave no tracks. Sam is stunned to see this new side  of his brother as Dean struggles to come to grips with the residual  feelings he has for Cassie.",
            "director": [],
            "duration": 2400,
            "rating": "6.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/nVP1dEu0xSw4fV5jwlizE0dCXTP.jpg"
          },
          "video": ""
        },
        {
          "episode": 14,
          "name": "Nightmare",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/8oh7cOoBqZDSVgJOH3K8euALHzj.jpg",
            "plot": "Sam has a premonition in which a man is killed, but  the murder is made to look like a suicide. Sam convinces Dean that they must investigate the case, but the two are puzzled  when they fail to find anything that indicates that the death was  supernatural in nature. That is, until they find out that Max, the reclusive son of the first victim, has been using his  recently acquired power of telekinesis to kill the family members that  once abused him. Sam also discovers Max's mother was killed by the same  fiery demon that took his own mom.",
            "director": [],
            "duration": 2580,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/8oh7cOoBqZDSVgJOH3K8euALHzj.jpg"
          },
          "video": ""
        },
        {
          "episode": 15,
          "name": "The Benders",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/fA9X8nyIxNFqMGfCRsHWv8de0wh.jpg",
            "plot": "Sam and Dean head to Minnesota where a  young boy witnesses a man vanish into thin  air. Upon searching for clues, Sam is abducted by what he assumes is a  supernatural being, and Dean is left to search frantically for his  brother. However, both are stunned when they realize the kidnappers are  human, and using the captives as human prey for a twisted hunting  expedition.",
            "director": [],
            "duration": 2580,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/fA9X8nyIxNFqMGfCRsHWv8de0wh.jpg"
          },
          "video": ""
        },
        {
          "episode": 16,
          "name": "Shadow",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/7bXHOxR6IRvUDiUJ4brZaugihMl.jpg",
            "plot": "Sam has a reunion with a girl he once met, Meg, but it turns out that she is using the brothers to lure their father John to his doom.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/7bXHOxR6IRvUDiUJ4brZaugihMl.jpg"
          },
          "video": ""
        },
        {
          "episode": 17,
          "name": "Hell House",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/5UDwyjNnus6MMCBEn5ZMCVKYMP6.jpg",
            "plot": "Sam and Dean investigate the case of a maniacal ghost inhabiting a long abandoned Texas farmhouse known as \"Hell House.\" They believe the ghost is the spirit of a deceased Depression-era farmer who killed his family, but they soon realize it is something far more powerful.",
            "director": [],
            "duration": 2460,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/5UDwyjNnus6MMCBEn5ZMCVKYMP6.jpg"
          },
          "video": ""
        },
        {
          "episode": 18,
          "name": "Something Wicked",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/hj8SJmZUFKKn0AHfeiy4BuidO2w.jpg",
            "plot": "Sam and Dean battle a Shtriga, a witch that sneaks into childrens' bedrooms and sucks the lives out of them. Dean must relive his childhood when he remembers that he encountered the Shtriga years ago.",
            "director": [],
            "duration": 2520,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/hj8SJmZUFKKn0AHfeiy4BuidO2w.jpg"
          },
          "video": ""
        },
        {
          "episode": 19,
          "name": "Provenance",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/1LLOdZUxTP47Vb9Ye2sqo31cRv9.jpg",
            "plot": "The Winchesters must deal with a dangerous spirit bound to an old family portrait that brings misfortune and death to anyone who buys it.",
            "director": [],
            "duration": 2580,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/1LLOdZUxTP47Vb9Ye2sqo31cRv9.jpg"
          },
          "video": ""
        },
        {
          "episode": 20,
          "name": "Dead Man's Blood",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/fm2weYzFs2PFYlMyldjo0hSAS6k.jpg",
            "plot": "To obtain a mystic gun capable of destroying the demon that killed their mother, Sam and Dean must team up with their father John and face off against vampires.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/fm2weYzFs2PFYlMyldjo0hSAS6k.jpg"
          },
          "video": ""
        },
        {
          "episode": 21,
          "name": "Salvation",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/x5XDZhKseFBfvOfJ7SL8C2td0yL.jpg",
            "plot": "John has realized where the demon will strike next and the Winchesters head there to stop the next killing. But Meg begins killing John's friends and demands the Colt or she'll keep going until everyone John knows is dead.",
            "director": [],
            "duration": 2460,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/x5XDZhKseFBfvOfJ7SL8C2td0yL.jpg"
          },
          "video": ""
        },
        {
          "episode": 22,
          "name": "Devil's Trap",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/zFTdWTX0D2orgTPkPz0ITymiZ8A.jpg",
            "plot": "When Meg boasts that John is her prisoner, the boys visit a friend of their father's to get information about demonic possessions and ways to trap a demon. It turns out Meg is not what she appears.",
            "director": [],
            "duration": 2580,
            "rating": "8.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/zFTdWTX0D2orgTPkPz0ITymiZ8A.jpg"
          },
          "video": ""
        }
      ]
    },
    {
      "season": 2,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/235GDaro5DuRJ9ogXmV7tOB6W5j.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "They're back the ghouls and vampires, the ghosts and spirits and even more terrifying entities. And wherever these evil beings are, you'll find brothers Sam and Dean Winchester, hunters on the trail of the demon who murdered their mother…and of any other unholy agent of the Supernatural. Join the brothers in their mind-bending, bone-chilling Season 2 road trip across America a journey deeper into the mystery of their own destinies.",
        "cast": [],
        "year": "2006",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "In My Time of Dying",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/5D3Y02IOyIgpXHoHAytCeFCUrDf.jpg",
            "plot": "In the aftermath of the car crash, the surviving Winchesters go to the hospital, where one is stalked by a Reaper while another must consider sacrificing himself to save the others.",
            "director": [],
            "duration": 2520,
            "rating": "8.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/5D3Y02IOyIgpXHoHAytCeFCUrDf.jpg"
          },
          "video": ""
        },
        {
          "episode": 2,
          "name": "Everybody Loves a Clown",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/48rq4jhuFIXd7WvFxQ9zZzsTuIr.jpg",
            "plot": "After the events at the hospital, the brothers have no idea where the demon that killed their mother is hiding. While biding their time trying to come up with an idea, they investigate murders committed by a killer clown.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/48rq4jhuFIXd7WvFxQ9zZzsTuIr.jpg"
          },
          "video": ""
        },
        {
          "episode": 3,
          "name": "Bloodlust",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/e7citrj6ZFHv6xXhCtKrrEkogeI.jpg",
            "plot": "Sam and Dean encounter a vampire hunter whose obsession may get them all killed.",
            "director": [],
            "duration": 2580,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/e7citrj6ZFHv6xXhCtKrrEkogeI.jpg"
          },
          "video": ""
        },
        {
          "episode": 4,
          "name": "Children Shouldn't Play With Dead Things",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/lQAGfQL81Oidq7oRuYLotdLRsHa.jpg",
            "plot": "Dean and Sam investigate the death of a young college student who died in a car accident, but whose grave is now surrounded by a circle of dead plants.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/lQAGfQL81Oidq7oRuYLotdLRsHa.jpg"
          },
          "video": ""
        },
        {
          "episode": 5,
          "name": "Simon Said",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/kOvCHuvW8KHf6WBEX8dAIYCi8sp.jpg",
            "plot": "Sam and Dean meet Andy Gallagher, a slacker with psychic powers of persuasion. Once the brothers learn that Andy’s family was visited by the Demon, Sam wonders if he could be one of the special children.",
            "director": [],
            "duration": 2400,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/kOvCHuvW8KHf6WBEX8dAIYCi8sp.jpg"
          },
          "video": ""
        },
        {
          "episode": 6,
          "name": "No Exit",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/xmPI86n8Ch6uT19u78V6fBNJv3A.jpg",
            "plot": "Sam and Dean investigate the slayings of blonde women and find that the ghost of the first known serial killer in US history is responsible. Jo disobeys Ellen's wishes and follows them along, and is captured by the ghost.",
            "director": [],
            "duration": 2460,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/xmPI86n8Ch6uT19u78V6fBNJv3A.jpg"
          },
          "video": ""
        },
        {
          "episode": 7,
          "name": "The Usual Suspects",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/FXjhHxBAUD32guOsldk98fBRVa.jpg",
            "plot": "Sam and Dean investigate the murder of a lawyer and his wife, who claimed to have seen a ghost before they were killed. However, local authorities arrest the Winchesters after looking into their past.",
            "director": [],
            "duration": 2520,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/FXjhHxBAUD32guOsldk98fBRVa.jpg"
          },
          "video": ""
        },
        {
          "episode": 8,
          "name": "Crossroad Blues",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/i5fLVXPjIOPiK0mzHQ6qeoHztgN.jpg",
            "plot": "Dean calls a demon to make a deal to save a man named Evan Hudson, in exchange for himself. While making the deal, the demon confronts Dean’s worst nightmare about their dad.",
            "director": [],
            "duration": 2520,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/i5fLVXPjIOPiK0mzHQ6qeoHztgN.jpg"
          },
          "video": ""
        },
        {
          "episode": 9,
          "name": "Croatoan",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/doyUNeP4ApJDm03g8OduOWAXDk5.jpg",
            "plot": "Sam has a vision of Dean shooting a defenseless man, and they go to the town of River Grove, where they find the townspeople have been possessed by a virus that makes them violent.",
            "director": [],
            "duration": 2460,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/doyUNeP4ApJDm03g8OduOWAXDk5.jpg"
          },
          "video": ""
        },
        {
          "episode": 10,
          "name": "Hunted",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/4YxF2DoLb1PQ6c03h2v8brsmFSq.jpg",
            "plot": "Sam meets a woman who shares his ability to have visions, and she warns him that she has seen the future... where he dies in an explosion.",
            "director": [],
            "duration": 2520,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/4YxF2DoLb1PQ6c03h2v8brsmFSq.jpg"
          },
          "video": ""
        },
        {
          "episode": 11,
          "name": "Playthings",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/eVvMgdpST9VgcjpvV7U0Z7lCZAW.jpg",
            "plot": "Sam and Dean investigate an Connecticut inn run by a single mother where mysterious deaths are taking place. They find evidence of Hoodoo, and try to figure out who is causing the chaos.",
            "director": [],
            "duration": 2340,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/eVvMgdpST9VgcjpvV7U0Z7lCZAW.jpg"
          },
          "video": ""
        },
        {
          "episode": 12,
          "name": "Nightshifter",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/t3YzNnMnVm1tprvZcbqetNkgvlQ.jpg",
            "plot": "The Winchesters investigate a series of crimes where robbers with no criminal past commit suicide after the hold-ups.",
            "director": [],
            "duration": 2460,
            "rating": "8.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/t3YzNnMnVm1tprvZcbqetNkgvlQ.jpg"
          },
          "video": ""
        },
        {
          "episode": 13,
          "name": "Houses of the Holy",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/2DVBbVZQEEtleV7rwutXhiv8n0O.jpg",
            "plot": "An angel causes people to cheerfully go out to murder, and when the Winchesters investigate one of them falls under its sway.",
            "director": [],
            "duration": 2460,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/2DVBbVZQEEtleV7rwutXhiv8n0O.jpg"
          },
          "video": ""
        },
        {
          "episode": 14,
          "name": "Born Under a Bad Sign",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/tf0rFhJdsIU3a26m4rJgTBB5qQO.jpg",
            "plot": "Sam contacts Dean after being missing for a week. When they reunite, Dean finds Sam covered in blood and with no recollection of what happened.",
            "director": [],
            "duration": 2580,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/tf0rFhJdsIU3a26m4rJgTBB5qQO.jpg"
          },
          "video": ""
        },
        {
          "episode": 15,
          "name": "Tall Tales",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/lCud2WAqclfTw2zGyHh665qDuWZ.jpg",
            "plot": "The Winchester brothers seek the help of their family friend Bobby while investigating a series of unexplained happenings on a local college campus.",
            "director": [],
            "duration": 2340,
            "rating": "8.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/lCud2WAqclfTw2zGyHh665qDuWZ.jpg"
          },
          "video": ""
        },
        {
          "episode": 16,
          "name": "Roadkill",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/lM7rteSY9hXUmlM4rPmCrJ8XVbT.jpg",
            "plot": "A fatal automobile accident from 1992 leaves an angry apparition haunting a remote stretch of highway, and Sam and Dean try to lay it to rest.",
            "director": [],
            "duration": 2400,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/lM7rteSY9hXUmlM4rPmCrJ8XVbT.jpg"
          },
          "video": ""
        },
        {
          "episode": 17,
          "name": "Heart",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/zWd7ia97zKyxeQNxzXL2FhEzrOJ.jpg",
            "plot": "Sam and Dean investigate a brutal death and discover that the killer is a lycanthrope: a werewolf.",
            "director": [],
            "duration": 2400,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/zWd7ia97zKyxeQNxzXL2FhEzrOJ.jpg"
          },
          "video": ""
        },
        {
          "episode": 18,
          "name": "Hollywood Babylon",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/AqzN3cLSs2cfLwYK5XoFD1jbXx0.jpg",
            "plot": "Sam and Dean discover that a group of ghosts are attempting to shut down production of a movie that they feel is mocking them.",
            "director": [],
            "duration": 2400,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/AqzN3cLSs2cfLwYK5XoFD1jbXx0.jpg"
          },
          "video": ""
        },
        {
          "episode": 19,
          "name": "Folsom Prison Blues",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/6krWeBzF4VnXyrlfv65CqYzEYuz.jpg",
            "plot": "Sam and Dean allow themselves to be arrested in order to investigate a series of murders inside a penitentiary. However things get complicated when FBI agent Henricksen shows up to take over their case.",
            "director": [],
            "duration": 2460,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/6krWeBzF4VnXyrlfv65CqYzEYuz.jpg"
          },
          "video": ""
        },
        {
          "episode": 20,
          "name": "What Is and What Should Never Be",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/bB3PZ6JwmyGTri6lLhJWyzK7XHK.jpg",
            "plot": "Dean is attacked by a Djinn... and finds himself in a new reality where his mother is still alive and a mysterious woman holds the key to everything.",
            "director": [],
            "duration": 2520,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/bB3PZ6JwmyGTri6lLhJWyzK7XHK.jpg"
          },
          "video": ""
        },
        {
          "episode": 21,
          "name": "All Hell Breaks Loose (1)",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/qf6LWrMZ819qZLSII6pDMCro5sH.jpg",
            "plot": "Sam and other \"special children\" are abducted by the Yellow-Eyed Demon and taken to a ghost town, where the ultimate battle must start.",
            "director": [],
            "duration": 2460,
            "rating": "8.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/qf6LWrMZ819qZLSII6pDMCro5sH.jpg"
          },
          "video": ""
        },
        {
          "episode": 22,
          "name": "All Hell Breaks Loose (2)",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/yO1ffOU0rxca1ZvcsGhAWuWkWou.jpg",
            "plot": "After the fight between Jake and Sam, Dean has to make the ultimate sacrifice for his brother. Meanwhile the Yellow-Eyed Demon has his new servant and plans to unleash the hordes of Hell.",
            "director": [],
            "duration": 2460,
            "rating": "8.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/yO1ffOU0rxca1ZvcsGhAWuWkWou.jpg"
          },
          "video": ""
        }
      ]
    },
    {
      "season": 3,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/vDIg3XI9JHfEORxTWstO2seUyCw.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "The yellow-eyed demon is vanquished, but at a terrible price. The battle that brought him down released hundreds of demons from Hell into an unsuspecting world. And it cost Sam his life. But a grief-stricken Dean made a deal with the Crossroad Demon: his soul for Sam's resurrection. Now Dean has just one year to live. One year to fight the unholy, the twisted, the ghoulish. One year to say farewell to Sam. And one year for Sam to search desperately for some way to save his brother. Mind-bending adventure awaits as the Winchester brothers continue their astonishing odyssey into the supernatural...and their personal odyssey into destiny.",
        "cast": [],
        "year": "2007",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "The Magnificent Seven",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/2SUb37U6g54dCBsspblgTM6YcR7.jpg",
            "plot": "Seven demons, based on the Seven Deadly Sins, are released into the world and the brothers must combat them with the aid of a married Hunter couple.",
            "director": [],
            "duration": 2400,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/2SUb37U6g54dCBsspblgTM6YcR7.jpg"
          },
          "video": ""
        },
        {
          "episode": 2,
          "name": "The Kids Are Alright",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/eC0suKIchk9ACQpAmP2eRAxfUNR.jpg",
            "plot": "Sam & Dean track down changelings that are pursuing mothers and their children. A boy they protect bears a strange resemblance to Dean, which at first makes Dean uncomfortable because he once had a one-night stand with the boy's mother Lisa.",
            "director": [],
            "duration": 2520,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/eC0suKIchk9ACQpAmP2eRAxfUNR.jpg"
          },
          "video": ""
        },
        {
          "episode": 3,
          "name": "Bad Day at Black Rock",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/EESdOeKac6FZa792fD41HIDLW9.jpg",
            "plot": "The Winchesters are called regarding a robbery of their father's storage unit, and track down the robbers to find the item stolen is a cursed rabbit's foot, which provides great luck until lost, and once lost the previous owner dies within a week.",
            "director": [],
            "duration": 2340,
            "rating": "8.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/EESdOeKac6FZa792fD41HIDLW9.jpg"
          },
          "video": ""
        },
        {
          "episode": 4,
          "name": "Sin City",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/2Ft0MNXtjLKvDlfJKZ64YeWTrGO.jpg",
            "plot": "The brothers investigate the death of a man who committed suicide in a church. However, Sam is forced to team up with an unexpected ally when Dean disappears with a female demon who is interested in him personally.",
            "director": [],
            "duration": 2460,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/2Ft0MNXtjLKvDlfJKZ64YeWTrGO.jpg"
          },
          "video": ""
        },
        {
          "episode": 5,
          "name": "Bedtime Stories",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/xv0Eb9OaL1CgT1mQN8HJUHQUVRF.jpg",
            "plot": "A young girl trapped in a coma by her wicked stepmother sets off a series of murders based on the fairy tales her father reads her. Meanwhile, Sam tries to get Dean out of his deal.",
            "director": [],
            "duration": 2400,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/xv0Eb9OaL1CgT1mQN8HJUHQUVRF.jpg"
          },
          "video": ""
        },
        {
          "episode": 6,
          "name": "Red Sky at Morning",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/wEamrhMwVZ66PVraDiz7IUnX1aN.jpg",
            "plot": "Bela gets in the way yet again as Sam and Dean are investigating multiple victims who drowned even though they were nowhere near water.  Sam and Dean make the creepy discovery that the victims all saw a ghost ship right before dying.  They tell Bela to stay away, but she's not so willing to leave, as someone's paying her a lot to solve the same case Sam and Dean are investigating.",
            "director": [],
            "duration": 2460,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/wEamrhMwVZ66PVraDiz7IUnX1aN.jpg"
          },
          "video": ""
        },
        {
          "episode": 7,
          "name": "Fresh Blood",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/t92hq7AK5egv1ZYVwv7o1NxUDZ0.jpg",
            "plot": "The brothers capture a female vampire named Lucy who has no idea how she became one, which leads them to Dixon, a male vampire who is a little too giving. Gordon returns with a vengeance leaving Sam in danger.",
            "director": [],
            "duration": 2400,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/t92hq7AK5egv1ZYVwv7o1NxUDZ0.jpg"
          },
          "video": ""
        },
        {
          "episode": 8,
          "name": "A Very Supernatural Christmas",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/bkXijc5t4FNaPu9tAuoY3t4FsOK.jpg",
            "plot": "In this Christmas-themed episode, Sam and Dean follow the trail of a creature that abducts its victims by using their chimneys. Dean would like to celebrate Christmas like they used to when they were children, but Sam isn't exactly feeling the Christmas spirit.",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/bkXijc5t4FNaPu9tAuoY3t4FsOK.jpg"
          },
          "video": ""
        },
        {
          "episode": 9,
          "name": "Malleus Maleficarum",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/sE5l8x1pnWKY5KTCaOuI7zJCX2Q.jpg",
            "plot": "The seemingly harmless practices of a group of neighborhood witches goes bad when one of them kills a woman. Ruby offers her assistance... but she has a few secrets of her own.",
            "director": [],
            "duration": 2400,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/sE5l8x1pnWKY5KTCaOuI7zJCX2Q.jpg"
          },
          "video": ""
        },
        {
          "episode": 10,
          "name": "Dream a Little Dream of Me",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/5187ehizxyyD5ZgFnPmeS7FMza0.jpg",
            "plot": "Dean interrogates a college student after the death of Dr. Greggs. Bobby, Sam and Dean all discover the truth behind the fatal death when they all get locked in a nightmare of their own.",
            "director": [],
            "duration": 2400,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/5187ehizxyyD5ZgFnPmeS7FMza0.jpg"
          },
          "video": ""
        },
        {
          "episode": 11,
          "name": "Mystery Spot",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/rn7s7Tc5tnlnOGB38Tafn1lF7qB.jpg",
            "plot": "Dean is killed after looking into a case about the disappearance of a man with Sam. The next morning, Sam is shocked to find Dean alive and is hit with the realization that he is reliving the day before.",
            "director": [],
            "duration": 2400,
            "rating": "8.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/rn7s7Tc5tnlnOGB38Tafn1lF7qB.jpg"
          },
          "video": ""
        },
        {
          "episode": 12,
          "name": "Jus in Bello",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/bNCl1Lfh1OulCfdiC1JvPNh3a8W.jpg",
            "plot": "FBI Agent Henricksen finally captures Sam and Dean, but is caught in the middle when a horde of demons descends on the small-town jail to eliminate the brothers.",
            "director": [],
            "duration": 2580,
            "rating": "8.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/bNCl1Lfh1OulCfdiC1JvPNh3a8W.jpg"
          },
          "video": ""
        },
        {
          "episode": 13,
          "name": "Ghostfacers!",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ilBZzbPRQAewweUuMYC8m40LXTy.jpg",
            "plot": "In a change of pace, Sam and Dean decide to star in a violent, profane reality show named Ghostfacers. The show takes them to the haunted Morton Mansion, and they soon realize they're in over their heads.",
            "director": [],
            "duration": 2520,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ilBZzbPRQAewweUuMYC8m40LXTy.jpg"
          },
          "video": ""
        },
        {
          "episode": 14,
          "name": "Long-Distance Call",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/pUG7nFN5SoNoNh4P5Aadny2ksU9.jpg",
            "plot": "Sam and Dean search for a Crocotta that uses the phone and computer as a means to communicate with people. Its goal is to get people to commit suicide and take their soul. Dean gets some news from an unlikely source about a demon holding the contract to his soul.",
            "director": [],
            "duration": 2400,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/pUG7nFN5SoNoNh4P5Aadny2ksU9.jpg"
          },
          "video": ""
        },
        {
          "episode": 15,
          "name": "Time is on My Side",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/mD3rsYMBvL5VRUqAiffHa7RUgi0.jpg",
            "plot": "Sam and Dean discover a doctor who, back in 1816, became obsessed with finding the secret of eternal life by taking people's vital organs. Meanwhile, Bobby finds Bela and Dean leaves Sam to confront her.",
            "director": [],
            "duration": 2580,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/mD3rsYMBvL5VRUqAiffHa7RUgi0.jpg"
          },
          "video": ""
        },
        {
          "episode": 16,
          "name": "No Rest for the Wicked",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/strQlXZst5hWpNSd6KmuUjdeHUQ.jpg",
            "plot": "Sam, Dean, and Bobby hunt down Lilith and fight her and her demons in a final effort to save Dean's life.",
            "director": [],
            "duration": 2340,
            "rating": "8.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/strQlXZst5hWpNSd6KmuUjdeHUQ.jpg"
          },
          "video": ""
        }
      ]
    },
    {
      "season": 4,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/uswpAvIhUX98ybJEJYJp6EUe3d6.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "Resurrection. After enduring unspeakable torture, Dean escapes from Hell, rescued by an all-powerful creature he's never seen before an Angel a warrior of God who recruits Sam and Dean in Heaven's battle against Hell. And there are whispers that a certain fallen angel will soon be freed from his prison deep in Hell: Lucifer. If Sam and Dean can't stop it if Lucifer walks free he'll bring on the Apocalypse. Meanwhile, the Winchester brothers reunite and hit the road, battling the supernatural wherever they go. They encounter demons, spirits, Dracula himself and even a drunk, heavily armed seven-foot-tall teddy bear. All the while, the ultimate war draws them into its horror. Caught between Heaven and Hell, between God and the Devil, the Winchester brothers must battle for the future of humankind.",
        "cast": [],
        "year": "2008",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Lazarus Rising",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/aRQe9Zcu1PUZwhUFb9zFuH8TbQ3.jpg",
            "plot": "Dean wakes up in his own coffin. How did he return from the dead? What caused the hand-shaped welt on his shoulder? And what happened in the four months he spent in Hell, time he can't remember?",
            "director": [],
            "duration": 2580,
            "rating": "8.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/aRQe9Zcu1PUZwhUFb9zFuH8TbQ3.jpg"
          },
          "video": ""
        },
        {
          "episode": 2,
          "name": "Are You There, God? It's Me, Dean Winchester",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/hJL9tnfa6nmYGilbEbqBxCGSds6.jpg",
            "plot": "After Dean's encounter with Castiel, Dean, Sam and Bobby brush up on their biblical lore when they're attacked by the vengeful spirits of people from the Winchesters' past. They're warned it's a sign that someone is trying to break seals which will bring on the apocalypse.",
            "director": [],
            "duration": 2460,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/hJL9tnfa6nmYGilbEbqBxCGSds6.jpg"
          },
          "video": ""
        },
        {
          "episode": 3,
          "name": "In the Beginning",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/y6j0ysz5FYjfJhl7l8IFBak2mBs.jpg",
            "plot": "Back to the future, Castiel sends Dean to 1973 Lawrence, Kansas, where he meets a nice young couple named John and Mary Winchester. Dean's parents. And Mary has a secret.",
            "director": [],
            "duration": 2580,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/y6j0ysz5FYjfJhl7l8IFBak2mBs.jpg"
          },
          "video": ""
        },
        {
          "episode": 4,
          "name": "Metamorphosis",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/lVhs82keFW6ijDErlSG6XD5n9f1.jpg",
            "plot": "Dark powers. Dean fears Sam is using his paranormal gifts in conflict with God's plan. And an ordinary guy in an ordinary town gets a major case of the munchies. It starts with steak - and moves to human flesh.",
            "director": [],
            "duration": 2460,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/lVhs82keFW6ijDErlSG6XD5n9f1.jpg"
          },
          "video": ""
        },
        {
          "episode": 5,
          "name": "Monster Movie",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/nQWwxx7O3g45f5Cqb6g3ZVNwofz.jpg",
            "plot": "In a black-and-white world reminiscent of classic horror flicks, the brothers tangle with a vampire, a werewolf and a mummy who are thinning the crowds at a quaint Oktoberfest.",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/nQWwxx7O3g45f5Cqb6g3ZVNwofz.jpg"
          },
          "video": ""
        },
        {
          "episode": 6,
          "name": "Yellow Fever",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/meJqu1QlTNOdc5zlFXyO88lEeaL.jpg",
            "plot": "Hell beckons again when Dean is stricken with a mysterious illness that frightens its sufferers to death. Sam and Dean scramble to find the cause of the disease in time to save Dean from sure death.",
            "director": [],
            "duration": 2580,
            "rating": "8.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/meJqu1QlTNOdc5zlFXyO88lEeaL.jpg"
          },
          "video": ""
        },
        {
          "episode": 7,
          "name": "It's the Great Pumpkin, Sam Winchester",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/iQpGVcgG2ooorTmks0fMPhQP6Nl.jpg",
            "plot": "Chomping candy, bobbing for apples. Halloween is such fun. Until gruesome deaths signify another seal is being broken. To stop it, Castiel and another angel plan a mass annihilation of the town.",
            "director": [],
            "duration": 2520,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/iQpGVcgG2ooorTmks0fMPhQP6Nl.jpg"
          },
          "video": ""
        },
        {
          "episode": 8,
          "name": "Wishful Thinking",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/e8xpnJZYkMDVmjIj7jVV0idb6vx.jpg",
            "plot": "Want to score a hot girlfriend, win the lottery or have your favorite teddy bear come to life? Then plunk a coin in a small town's wishing well and stand back. One problem: The wishes come true with a twist.",
            "director": [],
            "duration": 2520,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/e8xpnJZYkMDVmjIj7jVV0idb6vx.jpg"
          },
          "video": ""
        },
        {
          "episode": 9,
          "name": "I Know What You Did Last Summer",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/i7V5U8oWw71DLP7CMBQMwIactov.jpg",
            "plot": "What happened to Sam during the months Dean was dead? During the search for a girl named Anna Milton, who has a mysterious connection to angels, Sam reveals the astonishing events of the summer.",
            "director": [],
            "duration": 2520,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/i7V5U8oWw71DLP7CMBQMwIactov.jpg"
          },
          "video": ""
        },
        {
          "episode": 10,
          "name": "Heaven and Hell",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/pePXMvdasG5ATYTXHW0tIPGtbhA.jpg",
            "plot": "The angels want Anna dead, so Sam and Dean go on the run with the frightened girl, determined to discover the secret that has set the furies of Heaven on her.",
            "director": [],
            "duration": 2580,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/pePXMvdasG5ATYTXHW0tIPGtbhA.jpg"
          },
          "video": ""
        },
        {
          "episode": 11,
          "name": "Family Remains",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/hMDQqN7KIERCdgMV2wcy17FcMBe.jpg",
            "plot": "Dad, Mom, two kids and a dog. An all-American family doesn't stand a ghost of a chance against the bloodthirsty force that turns their new home-sweet-home into a haunted house.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/hMDQqN7KIERCdgMV2wcy17FcMBe.jpg"
          },
          "video": ""
        },
        {
          "episode": 12,
          "name": "Criss Angel Is a Douchebag",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/2dT1aBx9kJPd3Ekkmwu4QPRTOvt.jpg",
            "plot": "Aging magician The Incredible Jay performs the dangerous Table of Death trick and emerges unscathed. Jay cheated the Grim Reaper, but one of his rivals didn't. He checked out while Jay was doing his act.",
            "director": [],
            "duration": 2580,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/2dT1aBx9kJPd3Ekkmwu4QPRTOvt.jpg"
          },
          "video": ""
        },
        {
          "episode": 13,
          "name": "After School Special",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/w9p7z8B3mccqM6gOCqLiFBbRORF.jpg",
            "plot": "Fast times at Truman High. Murder brings Sam and Dean back to one of their old high schools, where they investigate possible demonic possession and take a few trips down memory lane.",
            "director": [],
            "duration": 2400,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/w9p7z8B3mccqM6gOCqLiFBbRORF.jpg"
          },
          "video": ""
        },
        {
          "episode": 14,
          "name": "Sex and Violence",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/kGNDO9wtCxFXvykL9ZttFo3IY8X.jpg",
            "plot": "In a small town in Iowa, three loving husbands kill their wives. Turns out these guys believe in spreading their love around: Each is spending plenty of the family income on strippers at a nearby nudie bar.",
            "director": [],
            "duration": 2520,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/kGNDO9wtCxFXvykL9ZttFo3IY8X.jpg"
          },
          "video": ""
        },
        {
          "episode": 15,
          "name": "Death Takes a Holiday",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/iyNE7NjyYftDrAZP03f5FgZI7N9.jpg",
            "plot": "Reapers take a break from work, and that means no one can die. But the escorts to the next world aren't off getting some R&R, unless you call being held hostage by a demon restful and relaxing.",
            "director": [],
            "duration": 2520,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/iyNE7NjyYftDrAZP03f5FgZI7N9.jpg"
          },
          "video": ""
        },
        {
          "episode": 16,
          "name": "On the Head of a Pin",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/r4DESZDYV372UJhwkKLdgVRVuXw.jpg",
            "plot": "Can torture be God's work? After seven angels are mysteriously murdered, Castiel and Uriel demand that Dean use the agony-inducing skills he learned in Hell to extract information from Alastair.",
            "director": [],
            "duration": 2580,
            "rating": "8.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/r4DESZDYV372UJhwkKLdgVRVuXw.jpg"
          },
          "video": ""
        },
        {
          "episode": 17,
          "name": "It's a Terrible Life",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/3Ur4sC3hnBQImxiyhI3uTjeoiG9.jpg",
            "plot": "At Sandover Bridge & Iron Inc., Dean is Dean Smith, the buttoned-down director of Sales & Marketing. Sam is Sam Wesson, a cubicle-dwelling tech support guy. What the heck is going on? Or is it what the Hell?",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/3Ur4sC3hnBQImxiyhI3uTjeoiG9.jpg"
          },
          "video": ""
        },
        {
          "episode": 18,
          "name": "The Monster at the End of this Book",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/rp3992eCMZlN8Ydv6lghXvK074X.jpg",
            "plot": "Familiar plot. Familiar characters. Sam and Dean come across a series of graphic novels called \"Supernatural\" featuring two demon-hunting brothers named Sam and Dean.",
            "director": [],
            "duration": 2520,
            "rating": "8.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/rp3992eCMZlN8Ydv6lghXvK074X.jpg"
          },
          "video": ""
        },
        {
          "episode": 19,
          "name": "Jump the Shark",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/e9cYV8mXhmHwX5tfxsOMDaVuexj.jpg",
            "plot": "Meet the Winchester boys: Dean, Sam and... Adam. The Winchesters discover they have a younger half-brother, whose mother vanishes just as a long-dormant grave robber renews his ghoulish career.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/e9cYV8mXhmHwX5tfxsOMDaVuexj.jpg"
          },
          "video": ""
        },
        {
          "episode": 20,
          "name": "The Rapture",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ae3zStFwcnLenyly2zyav8hrlZe.jpg",
            "plot": "The body Castiel walks around in isn't his. Instead, it belongs to a regular guy named Jimmy who wants his body - and his life - back. He gets the body. But the life may be a different story.",
            "director": [],
            "duration": 2340,
            "rating": "8.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ae3zStFwcnLenyly2zyav8hrlZe.jpg"
          },
          "video": ""
        },
        {
          "episode": 21,
          "name": "When the Levee Breaks",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/irwkKlgAUw03iGX98S3KSH8N4lh.jpg",
            "plot": "Dean and Bobby have something frightening locked in Bobby's panic room: Sam, who is corrupted by demon blood. With the apocalypse drawing nearer, Bobby wants to free Sam to fight on their side.",
            "director": [],
            "duration": 2580,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/irwkKlgAUw03iGX98S3KSH8N4lh.jpg"
          },
          "video": ""
        },
        {
          "episode": 22,
          "name": "Lucifer Rising",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/jM8JbXHdi2dZTZxOpKNC1gmkVk3.jpg",
            "plot": "The brothers prepare to fight the forces of the apocalypse in different camps. While Sam and Ruby hunt down Lilith, Dean joins Castiel and Zachariah to take on Lucifer.",
            "director": [],
            "duration": 2580,
            "rating": "8.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/jM8JbXHdi2dZTZxOpKNC1gmkVk3.jpg"
          },
          "video": ""
        }
      ]
    },
    {
      "season": 5,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/5BhXiXHjAq2LS7VyyiAA6egpZb8.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "Two brothers and one fallen angel - against all the might of Satan and his army! As the Apocalypse grows closer, threatening to turn Earth into a battlefield soaked with human blood, Sam, Dean and Castiel struggle against daunting odds. New foes arise, including the Four Horsemen of the Apocalypse. Old friends depart, consumed by the fearsome wrath of Hell. Through it all, the Winchesters are targeted by demons and angels alike, who warn that each brother has a special and terrible role to play in the coming devastation. Season Five follows Sam and Dean on their most terrifying journey yet, one that may lead them to the only ally strong enough to defeat the Devil: God.",
        "cast": [],
        "year": "2009",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Sympathy for the Devil",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/z3NlH5V5mHJq64DEUv6HgCs8Q3L.jpg",
            "plot": "Sam, Dean, and Bobby must deal with the aftermath of the Devil's escape from Hell, and receive startling news from the Prophet Chuck.",
            "director": [],
            "duration": 2520,
            "rating": "8.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/z3NlH5V5mHJq64DEUv6HgCs8Q3L.jpg"
          },
          "video": ""
        },
        {
          "episode": 2,
          "name": "Good God, Y'All!",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/zbg59Zmvi4Xq9C9LHlQB0ycXqY4.jpg",
            "plot": "Hunter Rufus Turner calls in Bobby, Sam, and Dean to deal with a demon infestation in his town, but they soon discover the truth is much more horrifying. Meanwhile, Castiel goes to seek the only entity that can defeat Lucifer.",
            "director": [],
            "duration": 2520,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/zbg59Zmvi4Xq9C9LHlQB0ycXqY4.jpg"
          },
          "video": ""
        },
        {
          "episode": 3,
          "name": "Free to Be You and Me",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/wdHktf8ZJzfD90GzgxfYgVQaVYi.jpg",
            "plot": "Sam decides to stop hunting but has a hard time after he receives a surprise visit. Dean and Castiel try to find the Archangel Raphael in their bid to stop the Apocalypse.",
            "director": [],
            "duration": 2460,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/wdHktf8ZJzfD90GzgxfYgVQaVYi.jpg"
          },
          "video": ""
        },
        {
          "episode": 4,
          "name": "The End",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/qxeXaPFRbKekNwCQ9EEQRkJVjGV.jpg",
            "plot": "Dean refuses Sam's efforts to help him battle the Devil, and then wakes up to find himself five years in the future, in a wasteland where Lucifer has begun his endgame by unleashing a virus that transforms humans into zombies.",
            "director": [],
            "duration": 2520,
            "rating": "8.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/qxeXaPFRbKekNwCQ9EEQRkJVjGV.jpg"
          },
          "video": ""
        },
        {
          "episode": 5,
          "name": "Fallen Idols",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/xuXTS1duu6SoMDT9aOCiwyb5z0l.jpg",
            "plot": "Sam and Dean head to a small town where people are murdered by famous dead icons. However the brothers come to a dead end when two teenagers reveal they saw Paris Hilton kidnap their friend.",
            "director": [],
            "duration": 2400,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/xuXTS1duu6SoMDT9aOCiwyb5z0l.jpg"
          },
          "video": ""
        },
        {
          "episode": 6,
          "name": "I Believe the Children Are Our Future",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/urp4CiPRizT5J9Te9LebqygYBf2.jpg",
            "plot": "Sam and Dean investigate a series of odd murders that strangely resemble fairytales and urban legends. The brothers track down an 11-year-old boy named Jesse and realize that whatever Jesse believes is coming true. Castiel tells Sam and Dean that Jesse is a serious threat and needs to be eliminated.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/urp4CiPRizT5J9Te9LebqygYBf2.jpg"
          },
          "video": ""
        },
        {
          "episode": 7,
          "name": "The Curious Case of Dean Winchester",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/bFdS6TBqWiqMfWQV2yCaAlhVXGs.jpg",
            "plot": "Sam and Dean discover a witch is running a high-stakes poker game where the currency is life years vs. money. Bobby sees the game as a chance to get out of the wheelchair and bets 25 years, but loses. As Bobby begins to age rapidly, Dean steps in to save him but also ends up turning into an old man, leaving Sam holding the bag for their survival.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/bFdS6TBqWiqMfWQV2yCaAlhVXGs.jpg"
          },
          "video": ""
        },
        {
          "episode": 8,
          "name": "Changing Channels",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/usvIzJkllJnXiXVYwo7FrjeYpkH.jpg",
            "plot": "When Sam and Dean find themselves living their lives on what appear to be TV shows, it makes for a whole new style of reality television and they wonder if the Trickster is to blame. From a sitcom to a soapy hospital drama to a Japanese game show to a crime procedural, each new experience they encounter is more bizarre than the next and they want out. But is the Trickster really the mastermind behind the madness?",
            "director": [],
            "duration": 2460,
            "rating": "8.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/usvIzJkllJnXiXVYwo7FrjeYpkH.jpg"
          },
          "video": ""
        },
        {
          "episode": 9,
          "name": "The Real Ghostbusters",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/m355bMYt9xXYZ1E6iYqiBZG5S03.jpg",
            "plot": "Super fan Becky uses Chuck’s phone to trick Sam and Dean into attending a Supernatural fan convention, complete with fans dressed up as Sam and Dean. One of the activities is a live action role playing game, but things quickly turn sour after a real ghost appears on the scene.",
            "director": [],
            "duration": 2400,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/m355bMYt9xXYZ1E6iYqiBZG5S03.jpg"
          },
          "video": ""
        },
        {
          "episode": 10,
          "name": "Abandon All Hope...",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/6KIZ9k2GpgsNLW9DNZmSg1FZ8Ue.jpg",
            "plot": "Sam, Dean and Castiel track down the Colt and head off to find Lucifer to send him back to Hell. It’s a hunters’ reunion when the crew joins forces with Bobby, Ellen and Jo for what could be their last night on Earth.",
            "director": [],
            "duration": 2520,
            "rating": "8.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/6KIZ9k2GpgsNLW9DNZmSg1FZ8Ue.jpg"
          },
          "video": ""
        },
        {
          "episode": 11,
          "name": "Sam, Interrupted",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/wi4fRvxKGLV0xQk7GlPNMRy9td0.jpg",
            "plot": "A former hunter named Martin, who is currently institutionalized, calls Sam and Dean for help investigating a case in the mental hospital. The brothers get themselves admitted as patients to check out the mysterious monster that is attacking the patients, but their incarceration pushes both to the breaking point as they unleash their inner demons against each other.",
            "director": [],
            "duration": 2460,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/wi4fRvxKGLV0xQk7GlPNMRy9td0.jpg"
          },
          "video": ""
        },
        {
          "episode": 12,
          "name": "Swap Meat",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/nF4jsjW2IgWhzCY8rypCJM2oymB.jpg",
            "plot": "Gary, a teenage nerd, conjures up a body-switching spell and changes bodies with Sam. Thrilled by his new handsome and built body, Gary (now Sam) investigates a case with Dean and takes advantage of his good looks and age by hitting on women and getting drunk.  Meanwhile, Sam is stuck in Gary's teenage body, dealing with intrusive parents and high school.",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/nF4jsjW2IgWhzCY8rypCJM2oymB.jpg"
          },
          "video": ""
        },
        {
          "episode": 13,
          "name": "The Song Remains the Same",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/e1I0PY0ohOio8jwnsHmK8yOoZ7P.jpg",
            "plot": "The angels send Anna back in time to kill John and Mary Winchester before they can conceive Sam knowing that if Sam was never born then Lucifer won't be able to use him as his vessel.  Castiel sends Sam and Dean back to 1978 so they can stop Anna, and the two brothers are reunited with their parents.  Mary recognizes Dean as a hunter since he visited her in the past once before but tries to keep the truth from John.",
            "director": [],
            "duration": 2460,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/e1I0PY0ohOio8jwnsHmK8yOoZ7P.jpg"
          },
          "video": ""
        },
        {
          "episode": 14,
          "name": "My Bloody Valentine",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/grQZ5hbyUfmIpFHfau5UOPkqaM8.jpg",
            "plot": "Castiel helps Sam and Dean hunt down Cupid on Valentine's Day after townspeople start to kill each other for love. However, after Cupid tells them he's innocent, they discover Famine, one of the Four Horsemen of the Apocalypse, has arrived in town.",
            "director": [],
            "duration": 2460,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/grQZ5hbyUfmIpFHfau5UOPkqaM8.jpg"
          },
          "video": ""
        },
        {
          "episode": 15,
          "name": "Dead Men Don't Wear Plaid",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/agfAeeU0v8vOmpS5ah0twWPX5hG.jpg",
            "plot": "Sam and Dean investigate Bobby's home town where the dead are rising from the grave but instead of attacking humans, they are happily reuniting with their families. The brothers turn to Bobby for help but he tells them not to worry about it and to leave town. Suspicious, Dean investigates and comes face to face with Bobby's dead wife, who has no memory of what happened to her. Once the zombies start turning evil, the boys tell Bobby he has to kill his wife but he refuses.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/agfAeeU0v8vOmpS5ah0twWPX5hG.jpg"
          },
          "video": ""
        },
        {
          "episode": 16,
          "name": "Dark Side of the Moon",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/fkyumgRMt9eXkE5j6Xmn92gyJRc.jpg",
            "plot": "Ambushed by angry hunters, Sam and Dean are shot and killed. When they wake up in heaven, Castiel tells them that they need to find an angel named Joshua, who talks directly with God. But he also has a warning, Zachariah is searching for them.",
            "director": [],
            "duration": 2460,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/fkyumgRMt9eXkE5j6Xmn92gyJRc.jpg"
          },
          "video": ""
        },
        {
          "episode": 17,
          "name": "99 Problems",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/y4vuqoeu26fSUC3lO7B08UxDdZM.jpg",
            "plot": "Sam and Dean are outnumbered by demons, but are saved at the last minute by Rob and his townspeople, who are aware of the Apocalypse, and have been training to fight and kill demons. The small town is very religious and Sam and Dean meet Pastor Gideon, who introduces them to his daughter Leah, whom he claims is a prophet. Leah tells the townspeople they must obey her orders if they want a spot in Heaven but when she starts turning the townspeople against each other in the name of the Lord, the brothers realize they must kill her.",
            "director": [],
            "duration": 2460,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/y4vuqoeu26fSUC3lO7B08UxDdZM.jpg"
          },
          "video": ""
        },
        {
          "episode": 18,
          "name": "Point of No Return",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/6DjJfadh9oYWdNl3kxEAvB3nWV2.jpg",
            "plot": "Dean begins to think the only way to stop Lucifer is to say yes to Michael, but the angels decide they don't need him anymore. Dean, Sam, and Castiel are horrified at the angels' new game plan and take on Zachariah to prevent an all out war on Earth. Meanwhile, a familiar face returns.",
            "director": [],
            "duration": 2520,
            "rating": "8.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/6DjJfadh9oYWdNl3kxEAvB3nWV2.jpg"
          },
          "video": ""
        },
        {
          "episode": 19,
          "name": "Hammer of the Gods",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/xFOUg92GOUKvL5ZO8XONCVQo01K.jpg",
            "plot": "Sam and Dean are kidnapped by a group of gods, including Kali, Ganesh, and Baldur and held hostage in a small hotel. The gods want to use Sam and Dean as bargaining chips to stop the Apocalypse, but Gabriel shows up and warns them that if Lucifer finds them he will kill them all. Unfortunately, one of the gods turns on the rest and Lucifer appears.",
            "director": [],
            "duration": 2400,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/xFOUg92GOUKvL5ZO8XONCVQo01K.jpg"
          },
          "video": ""
        },
        {
          "episode": 20,
          "name": "The Devil You Know",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/8PGSyQUTF6yPfNza2WyW28mZ8sf.jpg",
            "plot": "The demon Crowley tells Sam and Dean he can help them find the remaining Horsemen rings so they can trap Lucifer. The brothers are doubtful until Crowley leads them to Brady, the Handler for Pestilence and Death. However, Brady refuses to give up their locations and sets Pestilence after the Winchesters.",
            "director": [],
            "duration": 2520,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/8PGSyQUTF6yPfNza2WyW28mZ8sf.jpg"
          },
          "video": ""
        },
        {
          "episode": 21,
          "name": "Two Minutes to Midnight",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/yqw0x6CftJt480u9HSXhIgVAn7k.jpg",
            "plot": "Crowley tells Bobby he will give him the location of Death, the fourth horseman, in exchange for his soul. Knowing Sam and Dean need that fourth ring to stop the Apocalypse, Bobby reluctantly agrees. Sam and Dean confront Pestilence, but he unleashes a deadly virus upon them, so Castiel must intervene on their behalf. Dean has a meeting with Death to discuss Lucifer, and an unholy alliance is formed at a very high price for Dean.",
            "director": [],
            "duration": 2520,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/yqw0x6CftJt480u9HSXhIgVAn7k.jpg"
          },
          "video": ""
        },
        {
          "episode": 22,
          "name": "Swan Song",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/tUbTbLw8kjYT8qTARN1z7C294id.jpg",
            "plot": "The showdown between good and evil is at hand.  With the Apocalypse looming, Sam and Dean realize they are out of options and make heart-breaking decisions that will change their lives forever.  A beloved character faces death.",
            "director": [],
            "duration": 2520,
            "rating": "9.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/tUbTbLw8kjYT8qTARN1z7C294id.jpg"
          },
          "video": ""
        }
      ]
    },
    {
      "season": 6,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/hGInmwwUlG3yvrvSH9CYcL6Ba1j.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": " The prize: ending the Apocalypse. The price: Sam's life. Season 5's horrific finale left Dean alone, as Sam descended into Hell. Now a different man, Dean vows to stop hunting and devote himself to building a family with Lisa and her son Ben. Then, mysteriously, Sam reappears, drawing Dean back into the old life. But Sam's a different man too. He's returned without his soul. How the Winchesters confront this greatest challenge yet to their powerful bond is the troubled heart - and soul - of the profound and thrilling 22-Episode Season 6. As the brothers struggle to reunite, they must also battle deadly supernatural forces. Demons. Angels. Vampires. Shapeshifters. And a terrifying new foe called the Mother of All.",
        "cast": [],
        "year": "2010",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Exile on Main St.",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/42XjNVTdladJWBtSn5peAR4GGcl.jpg",
            "plot": "Sam is mysteriously released from Hell and seeks out his brother, trying to have a normal life. Together the brothers must join forces with their maternal grandfather, Samuel, and begin the fight anew.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/42XjNVTdladJWBtSn5peAR4GGcl.jpg"
          },
          "video": ""
        },
        {
          "episode": 2,
          "name": "Two and a Half Men",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/8gGq8Kd7Mu75UTq6lETyJpC2F4o.jpg",
            "plot": "Sam investigates a case about missing babies whose parents are being murdered. At one of the crime scenes, he discovers a baby that was left behind and calls Dean for help. Reluctant to leave Lisa and Ben, Dean finally agrees to meet Sam and surprises his brother with how parental he has become. The brothers take the baby to Samuel, who decides to raise it as a hunter, which infuriates Dean. However, before they can decide the baby's future, a shape-shifter breaks in and attempts to kidnap the baby.",
            "director": [],
            "duration": 2460,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/8gGq8Kd7Mu75UTq6lETyJpC2F4o.jpg"
          },
          "video": ""
        },
        {
          "episode": 3,
          "name": "The Third Man",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/oGdAmTevp2g7iEo4wszKYgSfm6K.jpg",
            "plot": "Sam and Dean call Castiel for help when they investigate a case about several dead police officers who seem to have been killed by the plagues of Egypt. Castiel confirms the staff of Moses was used to kill the cops and tells Sam and Dean that Heaven is in a state of chaos and God's weapons have been stolen. The three head off to find the thief and come face to face with an old enemy.",
            "director": [],
            "duration": 2460,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/oGdAmTevp2g7iEo4wszKYgSfm6K.jpg"
          },
          "video": ""
        },
        {
          "episode": 4,
          "name": "Weekend at Bobby's",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/aMSYhwdADlrr7s3Ei39Bux5CB3M.jpg",
            "plot": "After Bobby discovers Crowley has no intentions of returning Bobby's soul, the hunter takes matters into his own hands. He calls on Sam and Dean for help after he unearths one of Crowley's deepest secrets. Meanwhile, Sam and Dean learn what Bobby does all day when they are not around.",
            "director": [],
            "duration": 2460,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/aMSYhwdADlrr7s3Ei39Bux5CB3M.jpg"
          },
          "video": ""
        },
        {
          "episode": 5,
          "name": "Live Free or Twihard",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/7GrOA9i8ReonksgNZB5EuCBPH9s.jpg",
            "plot": "After a group of young girls go missing Sam and Dean realize that a group of vampires have taken up residence in the small town. After a fight with two of the blood-suckers, Dean is bitten and turns into a vampire. Samuel  tells Dean he can change him back but he’d have to get the blood of the vampire who turned him. Dean infiltrates the nest and runs into the Alpha...",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/7GrOA9i8ReonksgNZB5EuCBPH9s.jpg"
          },
          "video": ""
        },
        {
          "episode": 6,
          "name": "You Can't Handle the Truth",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/2g2Ew4iZktsiq5N8eVLkClQR46A.jpg",
            "plot": "Sam and Dean investigate a series of suicides and discover the victims were being told brutal truths that drove them crazy. They find out someone is invoking the Goddess of Truth, Veritas, forcing people to be cruelly honest against their will and Dean is the next victim. Dean is forced to tell Sam the truth about how he feels about his return from Hell.",
            "director": [],
            "duration": 2460,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/2g2Ew4iZktsiq5N8eVLkClQR46A.jpg"
          },
          "video": ""
        },
        {
          "episode": 7,
          "name": "Family Matters",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/Aph8STLFBFSBkba6yaLtq24dPLB.jpg",
            "plot": "Dean becomes suspicious of Samuel's motives, but Sam isn't sold on the idea that their grandfather is doing anything wrong. The brothers go along on a hunt with Samuel and the other Campbells, but things go terribly awry.",
            "director": [],
            "duration": 2460,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/Aph8STLFBFSBkba6yaLtq24dPLB.jpg"
          },
          "video": ""
        },
        {
          "episode": 8,
          "name": "All Dogs Go to Heaven",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/7Yb6CFruX7jL3fuCbzys0bT11i2.jpg",
            "plot": "Dean and Sam investigate what seems to be a werewolf killing but turns out to be a skinwalker posing as a family dog who is taking revenge on his owner’s enemies.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/7Yb6CFruX7jL3fuCbzys0bT11i2.jpg"
          },
          "video": ""
        },
        {
          "episode": 9,
          "name": "Clap Your Hands If You Believe...",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/vIQ5M527YAPaLOm4QdyIPcaQlPI.jpg",
            "plot": "While Sam and Dean are investigating a UFO sighting, Dean is abducted from a crop circle. However, when he awakens, he discovers he isn't dealing with aliens, but fairies! Unfortunately, only Dean can see the fairy that keeps attacking him which makes tracing and stopping them difficult. The brothers become even more perplexed when Sam's investigation leads them to a world full of elves, gnomes and a leprechaun.",
            "director": [],
            "duration": 2520,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/vIQ5M527YAPaLOm4QdyIPcaQlPI.jpg"
          },
          "video": ""
        },
        {
          "episode": 10,
          "name": "Caged Heat",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/wx83fxcEeH9MGsLZSEuqJrPfYyV.jpg",
            "plot": "Meg kidnaps Sam and Dean and tries to force them to tell her where Crowley is hiding. Sam makes her a deal - they will help her find Crowley if she promises to torture him for information about how to get Sam's soul back. Castiel joins the fight but finds it difficult to work with Meg.",
            "director": [],
            "duration": 2520,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/wx83fxcEeH9MGsLZSEuqJrPfYyV.jpg"
          },
          "video": ""
        },
        {
          "episode": 11,
          "name": "Appointment in Samarra",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/oT8x1r5S5QYGGUNqaZ9IIBS81s2.jpg",
            "plot": "Dean seeks out Death to help get Sam's soul back. Death tells Dean he will help Sam if Dean will agree to act as Death for 24 hours. Meanwhile, Sam decides he doesn't want his soul back and asks Balthazar for a protective spell to keep his soul out of his body. Balthazar tells Sam he needs the blood of his father for the spell to work and since John Winchester is dead, Sam decides Bobby is the next best thing.",
            "director": [],
            "duration": 2520,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/oT8x1r5S5QYGGUNqaZ9IIBS81s2.jpg"
          },
          "video": ""
        },
        {
          "episode": 12,
          "name": "Like a Virgin",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/8BWXD92id32hAQpqSg2Z8MGiBls.jpg",
            "plot": "Dean and Bobby anxiously wait for Sam to wake up to see if Death was able to restore his soul without causing Sam to lose his mind. Meanwhile, Dean and Bobby investigate a disappearance of virgins and discover dragons are behind the kidnappings. Bobby sends Dean to a doctor who owns the only weapon in the world that can slay a dragon, but Dean must prove himself worthy enough to take it",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/8BWXD92id32hAQpqSg2Z8MGiBls.jpg"
          },
          "video": ""
        },
        {
          "episode": 13,
          "name": "Unforgiven",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/5Z5Yoidc29qWi55vI46HuHHEjom.jpg",
            "plot": "Sam starts to have flashbacks to a case he worked on with Samuel before he reconnected with Dean. Sam receives a mysterious text with coordinates to a small town, so the brothers decide to investigate. Dean is surprised when the townspeople start telling him some of the things Sam did while he lived there.",
            "director": [],
            "duration": 2460,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/5Z5Yoidc29qWi55vI46HuHHEjom.jpg"
          },
          "video": ""
        },
        {
          "episode": 14,
          "name": "Mannequin 3: The Reckoning",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/uf5N4VK9OJFPR0XF4OshdI9hTTx.jpg",
            "plot": "Ben calls Dean and tells him Lisa is in trouble. Dean leaves Sam to investigate a case alone and rushes home to rescue Lisa, however, he’s not prepared for what meets him at the door. Meanwhile, Sam discovers the men that were murdered were all a part of a cruel practical joke played on a female co-worker who went missing.",
            "director": [],
            "duration": 2400,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/uf5N4VK9OJFPR0XF4OshdI9hTTx.jpg"
          },
          "video": ""
        },
        {
          "episode": 15,
          "name": "The French Mistake",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/gyUCL26zwN6pluHPw8Cf3wvnLUr.jpg",
            "plot": "Dean and Sam find themselves in an alternate reality where everyone believes they are two actors named Jensen Ackles and Jared Padalecki, who star in a TV show called Supernatural about two brothers who hunt monsters.",
            "director": [],
            "duration": 2520,
            "rating": "8.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/gyUCL26zwN6pluHPw8Cf3wvnLUr.jpg"
          },
          "video": ""
        },
        {
          "episode": 16,
          "name": "...And Then There Were None",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/wnP5KNnzhLojzuDYT9vGHkWHnP2.jpg",
            "plot": "Eve, the Mother of All, unleashes a new monster upon the world: a black worm-slug that can enter the brain and force people to kill. Sam and Dean join forces with Bobby and Rufus and track it to a cannery, only to discover that Gwen and Samuel are also there looking for the monster... and none of them know who the monster is inside.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/wnP5KNnzhLojzuDYT9vGHkWHnP2.jpg"
          },
          "video": ""
        },
        {
          "episode": 17,
          "name": "My Heart Will Go On",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/r2hMzLmEWMe7xcAPedtXbg1DF5.jpg",
            "plot": "After Balthazar changes history and keeps the Titanic from sinking, Fate intervenes and begins killing those that would have died on the ship. Castiel tells Sam and Dean that Fate is very upset with the two of them and the only way they can stay alive is to kill her.",
            "director": [],
            "duration": 2520,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/r2hMzLmEWMe7xcAPedtXbg1DF5.jpg"
          },
          "video": ""
        },
        {
          "episode": 18,
          "name": "Frontierland",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/sU1Ns6LP2s6VO3FW9D7K5GAOhdj.jpg",
            "plot": "While searching for a way to defeat Eve, Dean stumbles upon Samuel Colt’s journal in the Campbell library. Realizing Samuel might have the answer to their problems, Sam and Dean ask Castiel to send them back in time so they can meet the man himself. While Sam is a bit reluctant to time travel, Dean is beside himself with excitement to return to the Wild, Wild West.",
            "director": [],
            "duration": 2460,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/sU1Ns6LP2s6VO3FW9D7K5GAOhdj.jpg"
          },
          "video": ""
        },
        {
          "episode": 19,
          "name": "Mommy Dearest",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ems2oXgwo9xpbyjCV0D5guuKt0Q.jpg",
            "plot": "Sam, Dean, Bobby and Castiel track Eve to a small town in Oregon. The guys discover the townspeople have been converted to demons, but surprisingly, they all appear to be dying. When they finally do meet Eve, she decides to torture the brothers by bringing back their mother.",
            "director": [],
            "duration": 2520,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ems2oXgwo9xpbyjCV0D5guuKt0Q.jpg"
          },
          "video": ""
        },
        {
          "episode": 20,
          "name": "The Man Who Would Be King",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/zkOiHHIQ3WyzItcoIKW3h2xVScq.jpg",
            "plot": "Castiel tells Sam, Dean and Bobby about the war in Heaven and how he and Raphael became enemies. Bobby believes Castiel is hiding something, but Dean refuses to believe it.",
            "director": [],
            "duration": 2520,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/zkOiHHIQ3WyzItcoIKW3h2xVScq.jpg"
          },
          "video": ""
        },
        {
          "episode": 21,
          "name": "Let It Bleed",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/bcLUjpLb9lA54VGazRrqbMQTbL0.jpg",
            "plot": "A demon kidnaps Ben and Lisa to get to Dean. Sam and Dean are forced to join with an unlikely ally to free them.",
            "director": [],
            "duration": 2520,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/bcLUjpLb9lA54VGazRrqbMQTbL0.jpg"
          },
          "video": ""
        },
        {
          "episode": 22,
          "name": "The Man Who Knew Too Much",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/pfoif31k4RGXLtoN5HuZb8Ctl0r.jpg",
            "plot": "The wall comes down in Sam’s head and all hell breaks loose. Dean and Bobby are, for once, at a total loss on how to help him and are forced to stand by and do nothing while Sam breaks. The battle for heaven comes to a head.",
            "director": [],
            "duration": 2520,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/pfoif31k4RGXLtoN5HuZb8Ctl0r.jpg"
          },
          "video": ""
        }
      ]
    },
    {
      "season": 7,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/qiuf2qxR2Zd5sInYytZzSIXbUuL.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": " In Season 7, Sam and Dean fight demons. Real demons, like Lucifer, who tortures Sam with visions of Hell. Private demons, as the brothers face a traumatic personal loss when Bobby is cut down by alien forces. And as Sam and Dean travel the back roads of America, hunting monsters who wreak havoc on the innocent, a new and more terrible foe hunts them: Leviathans, freed from Purgatory and immune to the brothers' arsenal of weapons and cunning. With Bobby gone, all Sam and Dean can rely on is each other. But will that be enough?",
        "cast": [],
        "year": "2011",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Meet the New Boss",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/k96IfYNrybKIMN4rHOD0awVVpbZ.jpg",
            "plot": "Castiel doesn't kill Sam, Dean and Bobby but warns them not to interfere in his business. Assuming his new role as God, Castiel sets out to right some of the wrongs in the world. Dean decides they should bind Death and order him to stop Castiel, but the former angel is one step ahead of them, leaving Dean to face a very angry Death. Meanwhile Sam struggles to deal with the broken wall in his head.",
            "director": [],
            "duration": 2520,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/k96IfYNrybKIMN4rHOD0awVVpbZ.jpg"
          },
          "video": ""
        },
        {
          "episode": 2,
          "name": "Hello, Cruel World",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/mcEnoyH1aLuRr36NiujPcNeW1WY.jpg",
            "plot": "The broken wall in Sam's head causes him to have hallucinations, and he has difficulty discerning what's real and what's not. Bobby worries that Dean is beginning to stumble under the weight of fighting and keeping an eye on Sam.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/mcEnoyH1aLuRr36NiujPcNeW1WY.jpg"
          },
          "video": ""
        },
        {
          "episode": 3,
          "name": "The Girl Next Door",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/9awtgqgk1BGIbU0zurOgsZq6GPk.jpg",
            "plot": "Dean is furious after Sam disappears to follow a lead on a case with clues that are identical to a case Sam solved as a kid. The demon turns out to be Amy, who has been killing low-life thugs and taking their brains for dinner - the same demon Sam found as a kid.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/9awtgqgk1BGIbU0zurOgsZq6GPk.jpg"
          },
          "video": ""
        },
        {
          "episode": 4,
          "name": "Defending Your Life",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/3RIHs3MfHS2b9jx69nL7gfKpEmB.jpg",
            "plot": "Sam and Dean investigate a string of gruesome murders and discover the Egyptian god Osiris is behind the deaths. The vengeful god is putting people on trial for their past mistakes and killing them if found guilty. Osiris hones in on Dean’s guilt and decides he’s the next to stand trial. Sam steps in as Dean’s lawyer, but both brothers are unprepared when Osiris calls an unexpected witness Jo.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/3RIHs3MfHS2b9jx69nL7gfKpEmB.jpg"
          },
          "video": ""
        },
        {
          "episode": 5,
          "name": "Shut Up, Dr. Phil",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/yV7HWIhPg2pzNKOAwQ1Kfe1mS45.jpg",
            "plot": "Sam and Dean meet Maggie Stark, a witch who has unleashed her wrath on a small town, resulting in numerous deaths. Sam and Dean track down her husband, Donald, to see if he can help. Donald tells the brothers that Maggie is mad at him for having an affair and is taking it out on the townspeople.",
            "director": [],
            "duration": 2520,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/yV7HWIhPg2pzNKOAwQ1Kfe1mS45.jpg"
          },
          "video": ""
        },
        {
          "episode": 6,
          "name": "Slash Fiction",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/vVv1BUxRYreI9NKRmgGu8frgjqt.jpg",
            "plot": "Sam and Dean are once again on the FBI’s “Most Wanted” list when two Leviathans clone the brothers and go on a killing spree. The subject of a nationwide manhunt, Sam and Dean need to drop off the grid so Bobby sends them to Frank Deveraux, a quirky surveillance expert, for help. Meanwhile, Bobby continues to search for a way to kill the Levianthans, or at least slow them down, so the real Winchesters can stop their evil doppelgangers.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/vVv1BUxRYreI9NKRmgGu8frgjqt.jpg"
          },
          "video": ""
        },
        {
          "episode": 7,
          "name": "The Mentalists",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/oohqDDMe3fW2TAJKQExz8FM1RRq.jpg",
            "plot": "Sam and Dean investigate the gruesome murders of resident mediums in Lily Dale, the most “psychic” town in America. They discover that an angry spirit is killing off the psychics one by one, but in a town full of people who claim to be summoning spirits, they have a little trouble identifying the medium controlling the ghost.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/oohqDDMe3fW2TAJKQExz8FM1RRq.jpg"
          },
          "video": ""
        },
        {
          "episode": 8,
          "name": "Season Seven, Time for a Wedding!",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/AwpwvHyYyP2ABBVhxRfwkZbtxc4.jpg",
            "plot": "While on a hunt, Sam runs into someone from his past and a confrontation ensues. Meanwhile, Dean reluctantly teams up with a quirky, laid-back hunter named Garth, when he finds himself in a situation that he just cannot explain.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/AwpwvHyYyP2ABBVhxRfwkZbtxc4.jpg"
          },
          "video": ""
        },
        {
          "episode": 9,
          "name": "How to Win Friends and Influence Monsters",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/27EAXsUzckMPM7fyOyN41oUjTGC.jpg",
            "plot": "Sam, Dean, and Bobby become actual hunters, in the true sense of the word, when they set up camp in a New Jersey state park to track a creature that has been attacking people in the woods. The townsfolk claim it is the real Jersey Devil. Meanwhile, Dean is beyond thrilled to find a Biggerson’s restaurant in town, but is devastated when he discovers the restaurant’s special sandwich seems to be making people crazy.",
            "director": [],
            "duration": 2400,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/27EAXsUzckMPM7fyOyN41oUjTGC.jpg"
          },
          "video": ""
        },
        {
          "episode": 10,
          "name": "Death's Door",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/fsQ7GeSnbtO9M4m5HT1hS3yAHLO.jpg",
            "plot": "As Sam and Dean race the clock on a high-stakes mission, Bobby seeks the help of an unlikely old friend to solve one of the most personal cases of his life.",
            "director": [],
            "duration": 2520,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/fsQ7GeSnbtO9M4m5HT1hS3yAHLO.jpg"
          },
          "video": ""
        },
        {
          "episode": 11,
          "name": "Adventures in Babysitting",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/u8KFsM0A5cEadGoma30AKHtNmVy.jpg",
            "plot": "Still reeling after what happened to Bobby, Dean becomes dangerously obsessed over finding a way to take down Dick Roman. Meanwhile, Sam decides to help a teenage girl look for her father, a hunter who has gone missing. Sam traces his last steps to a truck stop where the help  turns out not to be so friendly.",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/u8KFsM0A5cEadGoma30AKHtNmVy.jpg"
          },
          "video": ""
        },
        {
          "episode": 12,
          "name": "Time After Time",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/xMGZcJHRAkHmN1R66yigSZjQcG4.jpg",
            "plot": "Sam and Dean tangle with the God of Time, who sends Dean back to 1944, where he is immediately arrested by none other than the one and only Eliot Ness. While trying to figure out how to retrieve his brother, Sam is surprised by the reappearance of an old friend.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/xMGZcJHRAkHmN1R66yigSZjQcG4.jpg"
          },
          "video": ""
        },
        {
          "episode": 13,
          "name": "The Slice Girls",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/5NXjengE4L4wtihPqygTPEss7yz.jpg",
            "plot": "Sam and Dean investigate a case where the victims' hands and feet have been severed and each have been branded with a strange symbol. While Sam does some research at a local university, Dean heads to one of his favorite places to investigate - the town bar. Dean strikes up a conversation with a local named Lydia, and the two go back to her place. Sam discovers the symbol on the bodies is a sign of Amazon warriors.",
            "director": [],
            "duration": 2460,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/5NXjengE4L4wtihPqygTPEss7yz.jpg"
          },
          "video": ""
        },
        {
          "episode": 14,
          "name": "Plucky Pennywhistle's Magical Menagerie",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/7mZb4muB5x3orDjIDIBaGokKDrO.jpg",
            "plot": "Sam and Dean investigate strange happenings in a town where childhood fears are coming to life. To Sam's horror his childhood fear of clowns manifests in a very violent and traumatic way which in turn leads to Dean's childhood fear, losing his brother.",
            "director": [],
            "duration": 2460,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/7mZb4muB5x3orDjIDIBaGokKDrO.jpg"
          },
          "video": ""
        },
        {
          "episode": 15,
          "name": "Repo Man",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/zXnR90o7GtyLQjJXwv393i1y7x0.jpg",
            "plot": "Four years ago, Sam and Dean helped a woman named Nora exorcise a demon that was systematically killing women in a small town. They managed to save a postal worker, Jeffrey, while vanquishing the demon, but now it seems the black-eyed monster has reared his ugly head and returned for a second helping. The brothers visit Jeffrey, who has been locked in a psych ward since the incident, to see if he can remember any of the demon’s plans while he was possessed.",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/zXnR90o7GtyLQjJXwv393i1y7x0.jpg"
          },
          "video": ""
        },
        {
          "episode": 16,
          "name": "Out With the Old",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/sIyDmOc51yraPCEGO4OFJEkir4e.jpg",
            "plot": "After a ballerina is found dead from dancing herself to death, Sam and Dean look into the case and discover the ballet slippers she wore were cursed. When Dean accidentally touches the shoes the power of the curse starts to take hold of him.",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/sIyDmOc51yraPCEGO4OFJEkir4e.jpg"
          },
          "video": ""
        },
        {
          "episode": 17,
          "name": "The Born-Again Identity",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/h8Mf2KafoYqwfAcO0GTA0T2rMc1.jpg",
            "plot": "Lucifer drives Sam to the breaking point and Sam ends up in a mental hospital. Desperate to save his brother, Dean calls every hunter he knows for help. One of the hunters gives him the name of a healer who turns out to have a very familiar face.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/h8Mf2KafoYqwfAcO0GTA0T2rMc1.jpg"
          },
          "video": ""
        },
        {
          "episode": 18,
          "name": "Party On, Garth",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/3HN3KungWkletGjrZZocOvOm12M.jpg",
            "plot": "Dean is surprised when he gets a call from Garth asking for the brothers’ help on a case. Sam and Dean discover they are battling a Shojo, a Japanese creature sent to seek revenge on enemies. The worst part about fighting a Shojo? You can only see it when you’re drunk.",
            "director": [],
            "duration": 2520,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/3HN3KungWkletGjrZZocOvOm12M.jpg"
          },
          "video": ""
        },
        {
          "episode": 19,
          "name": "Of Grave Importance",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/gtzgxM1IHbWubhZ8PbYvUWRI5z6.jpg",
            "plot": "Sam and Dean get a call from Annie Hawkins, an old hunter friend, asking for help on a case. When they arrive in town, they find out Annie has disappeared. They trace her last whereabouts to an old abandoned house that is haunted by a powerful ghost.",
            "director": [],
            "duration": 2460,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/gtzgxM1IHbWubhZ8PbYvUWRI5z6.jpg"
          },
          "video": ""
        },
        {
          "episode": 20,
          "name": "The Girl with the Dungeons and Dragons Tattoo",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/dJhKD6pPTW5VII5v2v5CQuvbb05.jpg",
            "plot": "Dick Roman acquires Frank's hard drive that contains sensitive information about the Winchesters and gives it to an unsuspecting brilliant hacker named Charlie telling her she has 3 days to crack the encryptionl or she is fired. Sam and Dean are tipped off that Dick has the hard drive and race to get to Charlie before she breaks the code. Meanwhile, Bobby tries to help the brothers, but his rage towards Dick for killing him starts to get in the way.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/dJhKD6pPTW5VII5v2v5CQuvbb05.jpg"
          },
          "video": ""
        },
        {
          "episode": 21,
          "name": "Reading is Fundamental",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/4pK1YTFq1F3TqK5kuC4HD3glgt1.jpg",
            "plot": "Meg calls Dean and Sam and tells them Castiel is awake and talking. Meanwhile, a teenager named Kevin gets hit by a bolt of lightning and is turned into a reluctant prophet. Sam and Dean believe Kevin holds the key to defeating the Leviathans but must fight off two Archangels who want him for their own purposes.",
            "director": [],
            "duration": 2520,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/4pK1YTFq1F3TqK5kuC4HD3glgt1.jpg"
          },
          "video": ""
        },
        {
          "episode": 22,
          "name": "There Will Be Blood",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/mKpQ3E5lzXzKpBCKRLDMSgjAATQ.jpg",
            "plot": "In order to defeat Dick Roman and the Leviathans, Sam and Dean must locate three key items. Castiel gets one of them but for the other two, the Winchesters must face two of their strongest opponents.",
            "director": [],
            "duration": 2580,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/mKpQ3E5lzXzKpBCKRLDMSgjAATQ.jpg"
          },
          "video": ""
        },
        {
          "episode": 23,
          "name": "Survival of the Fittest",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/6buPcBOZolekwRnFbwiMsF0NPoy.jpg",
            "plot": "Dean and Sam prepare for battle with Dick Roman, who is in the final phase of his plan. The Winchesters must team up with Castiel, Bobby, Meg, and Kevin in order to stop him.",
            "director": [],
            "duration": 2520,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/6buPcBOZolekwRnFbwiMsF0NPoy.jpg"
          },
          "video": ""
        }
      ]
    },
    {
      "season": 8,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/pmzX28gvLj52HtN5qeyb1Qw4q5l.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "After a year apart, Sam and Dean are reunited in the Eighth Season premiere. After escaping from Purgatory with the help of a vampire named Benny, Dean heads straight for Sam, but the reunion isn't exactly everything he imagined it would be. Although Sam drops everything to join his brother, leaving the life he had grown accustomed to enjoy turns out to be harder than he imagined. In the meantime, Benny’s help turns out to be more than what Dean bargained for. As the brothers struggle with their unexpected reunion, they make a shocking discovery that could lead them on a deeply personal mission to settle old scores. If only they could agree – is this a “family business” or isn’t it?",
        "cast": [],
        "year": "2012",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "We Need to Talk About Kevin",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/sm3cYFZiimCspfwScThtxDSJLA.jpg",
            "plot": "One Year Later, and Dean’s escaped from Purgatory, though Castiel is nowhere to be found. However, Dean isn’t alone. He’s returned with a mysterious comrade-in-arms whose reason for escape is perhaps more than Dean bargained for. Meanwhile, Sam finds himself reconciling the life he discovered while Dean was gone with Dean’s sudden reappearance.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/sm3cYFZiimCspfwScThtxDSJLA.jpg"
          },
          "video": ""
        },
        {
          "episode": 2,
          "name": "What's Up, Tiger Mommy?",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/hQgdJ8VBsyZkWigCJWC4xnz7PoT.jpg",
            "plot": "Kevin talks Sam and Dean into checking in on his mother. When they arrive, they see that Crowley has surrounded her with demons so they rescue her and take her along on their quest to find the tablet. However, they soon discover Kevin wasn’t kidding when he said his mother was a strong-willed woman after she tries to take on Crowley.",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/hQgdJ8VBsyZkWigCJWC4xnz7PoT.jpg"
          },
          "video": ""
        },
        {
          "episode": 3,
          "name": "Heartache",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/jXXlCIgYVmgb7RsYSbsSL0P5RUh.jpg",
            "plot": "Sam and Dean investigate a string of unusual murders where the victims were all recipients of organs from the same donor. The killer is captured, but things become even more complicated when the brothers find their killer in a trance mumbling an ancient prayer.",
            "director": [],
            "duration": 2460,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/jXXlCIgYVmgb7RsYSbsSL0P5RUh.jpg"
          },
          "video": ""
        },
        {
          "episode": 4,
          "name": "Bitten",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/g6Ux0sdNQYzDN5fLacomvc6vL4S.jpg",
            "plot": "Sam and Dean investigate a bizarre murder in a college town. Close on the tail of their suspect, they bust into an apartment to find two dead bodies and a laptop cued up to some disturbing video footage.",
            "director": [],
            "duration": 2520,
            "rating": "6.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/g6Ux0sdNQYzDN5fLacomvc6vL4S.jpg"
          },
          "video": ""
        },
        {
          "episode": 5,
          "name": "Blood Brother",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/km81KqRKLNR0PJf19z7iHNkYShJ.jpg",
            "plot": "After Benny gets brutally beat up by vampires, he calls Dean for help who abruptly packs up and tells a confused Sam that he’s taking a personal day. Meanwhile, Sam uses his solo time to reflect on the life he left behind with Amelia.",
            "director": [],
            "duration": 2520,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/km81KqRKLNR0PJf19z7iHNkYShJ.jpg"
          },
          "video": ""
        },
        {
          "episode": 6,
          "name": "Southern Comfort",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/gpwtxPAQDKTLhbKkDLdaQOiFLKc.jpg",
            "plot": "Sam and Dean investigate a murder and find Garth is already on the case. Dean is not happy to learn that Garth has assumed Bobby’s duties, but someone had to pick up the slack.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/gpwtxPAQDKTLhbKkDLdaQOiFLKc.jpg"
          },
          "video": ""
        },
        {
          "episode": 7,
          "name": "A Little Slice of Kevin",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/5pyjyfQjEay7BPAsNGDPvbARv54.jpg",
            "plot": "Sam and Dean are stunned when Castiel suddenly appears back on Earth with no memory of how he escaped from Purgatory. Meanwhile, Mrs. Tran enlists a witch to concoct a demon bomb.",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/5pyjyfQjEay7BPAsNGDPvbARv54.jpg"
          },
          "video": ""
        },
        {
          "episode": 8,
          "name": "Hunteri Heroici",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/gauAXS0bJXiFDaaCmXYQIv3exMC.jpg",
            "plot": "Castiel tells Sam and Dean that he’s decided to become a hunter like them. Sam and Dean aren’t sold on the idea but agree to investigate a case Cas found where a man’s heart literally burst through his chest. The guys discover that all the deaths resemble cartoon deaths.",
            "director": [],
            "duration": 2520,
            "rating": "8.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/gauAXS0bJXiFDaaCmXYQIv3exMC.jpg"
          },
          "video": ""
        },
        {
          "episode": 9,
          "name": "Citizen Fang",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/oIS17PZObrUzz2pKxWyoXcG4BVb.jpg",
            "plot": "Sam asks a hunter named Martin to keep an eye on Benny without telling Dean. However, when Martin tells Sam and Dean there was a vampire kill and that Benny is responsible, Dean defends his friend.",
            "director": [],
            "duration": 2520,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/oIS17PZObrUzz2pKxWyoXcG4BVb.jpg"
          },
          "video": ""
        },
        {
          "episode": 10,
          "name": "Torn and Frayed",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/m2QcJJhz2LwYPMaBhizFph8CUAa.jpg",
            "plot": "After Naomi orders Castiel to rescue an angel being held captive by Crowley, he turns to Dean for help. Meanwhile, Sam meets with Amelia who asks him to make a choice: stay with her or leave and never contact her again.",
            "director": [],
            "duration": 2580,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/m2QcJJhz2LwYPMaBhizFph8CUAa.jpg"
          },
          "video": ""
        },
        {
          "episode": 11,
          "name": "LARP and the Real Girl",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/5JDXxZaIJLOfu16MUv5heAfoQuf.jpg",
            "plot": "Sam and Dean investigate the mysterious deaths of two LARPers who were playing a game titled Moondoor. The guys are thrilled to discover that the Queen of Moondoor is none other than Charlie.",
            "director": [],
            "duration": 2580,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/5JDXxZaIJLOfu16MUv5heAfoQuf.jpg"
          },
          "video": ""
        },
        {
          "episode": 12,
          "name": "As Time Goes By",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/4B6D36FV80GNWBgAvwJJfcIEOqb.jpg",
            "plot": "Sam and Dean are stunned when a man who claims to be Henry Winchester, their grandfather, suddenly appears in their hotel room demanding to know where he can find John Winchester, their father.",
            "director": [],
            "duration": 2520,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/4B6D36FV80GNWBgAvwJJfcIEOqb.jpg"
          },
          "video": ""
        },
        {
          "episode": 13,
          "name": "Everybody Hates Hitler",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/1MkALJ8n3Z1isgMggwnKJtkMeS.jpg",
            "plot": "Sam and Dean investigate the death of Rabbi Bass, who appears to have spontaneously combusted. The case becomes even more confusing when they learn that the Rabbi was researching Nazi Necromancers.",
            "director": [],
            "duration": 2580,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/1MkALJ8n3Z1isgMggwnKJtkMeS.jpg"
          },
          "video": ""
        },
        {
          "episode": 14,
          "name": "Trial and Error",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/d3RLsrBGr59fQazbmxZYj1YooTT.jpg",
            "plot": "Kevin deciphers the demon tablet and figures out how to close the gates of Hell. He tells Sam and Dean that according to the tablet one person must face a series of three trials, and the first one is to kill a hellhound.",
            "director": [],
            "duration": 2580,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/d3RLsrBGr59fQazbmxZYj1YooTT.jpg"
          },
          "video": ""
        },
        {
          "episode": 15,
          "name": "Man's Best Friend with Benefits",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/3xg3uc1t5S78QcS6nrSwMT1k1sR.jpg",
            "plot": "A police officer named James, who turned to witchcraft after working a case with Sam and Dean, is plagued by nightmares in which he murders innocent people.",
            "director": [],
            "duration": 2520,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/3xg3uc1t5S78QcS6nrSwMT1k1sR.jpg"
          },
          "video": ""
        },
        {
          "episode": 16,
          "name": "Remember the Titans",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/sk1JiXEEWraWPrzrLUvojdwJfY2.jpg",
            "plot": "Sam and Dean are stumped when they investigate a possible zombie case where an amnesiac man dies and then revives himself every day. After the man is attacked by the goddess Artemis, Sam and Dean realize he’s not a zombie.",
            "director": [],
            "duration": 2520,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/sk1JiXEEWraWPrzrLUvojdwJfY2.jpg"
          },
          "video": ""
        },
        {
          "episode": 17,
          "name": "Goodbye, Stranger",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/A6I7cm05s0IDaW1mohp8MUsPkFs.jpg",
            "plot": "Castiel reappears in Sam and Dean’s life and tells them Crowley has unleashed several demons into a small town in order to find Lucifer’s Crypt, which holds a valuable relicts. While interrogating a demon, the three discover Crowley has been torturing Meg, who knows the location of the crypt.",
            "director": [],
            "duration": 2520,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/A6I7cm05s0IDaW1mohp8MUsPkFs.jpg"
          },
          "video": ""
        },
        {
          "episode": 18,
          "name": "Freaks and Geeks",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/bvDziRPBewfYYPL1vclrRcvidSy.jpg",
            "plot": "Sam and Dean investigate some recent vampire kills and are surprised to learn Krissy Chambers is involved. They find Krissy and learn her father was killed and she’s been taken in by a man named Victor, who has taken in a group of orphan kids to teach them how to hunt.",
            "director": [],
            "duration": 2520,
            "rating": "6.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/bvDziRPBewfYYPL1vclrRcvidSy.jpg"
          },
          "video": ""
        },
        {
          "episode": 19,
          "name": "Taxi Driver",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/vxOmu58HLlIuTB81AEXOzP0DtMU.jpg",
            "plot": "Kevin is terrified. He has started hearing Crowley's voice in his head and calls Sam and Dean for help. After hearing Kevin's news, Sam and Dean team up with a reaper named Ajay, who helps them with the second trial from the demon tablet.",
            "director": [],
            "duration": 2520,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/vxOmu58HLlIuTB81AEXOzP0DtMU.jpg"
          },
          "video": ""
        },
        {
          "episode": 20,
          "name": "Pac-Man Fever",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/t0aVl4D3DtODJjCAq8APALJwLDC.jpg",
            "plot": "Concerned about the physical toll the second trial took on Sam, Dean benches his brother from hunting until he heals up. So, when geektastic hacker Charlie Bradbury stumbles upon a case, Dean decides it's time to teach Charlie how to be a hunter-in-training.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/t0aVl4D3DtODJjCAq8APALJwLDC.jpg"
          },
          "video": ""
        },
        {
          "episode": 21,
          "name": "The Great Escapist",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/pyKWFDN6RymTMD1fsYC5JiFALEc.jpg",
            "plot": "When Sam and Dean receive a distressing video message from Kevin Tran, they set out trying to uncover the third trial. The boys make a discovery that sends them to a casino in Colorado where they find a mysterious recluse who may be able to fill in the holes in Kevin’s research. Meanwhile, Castiel tries to elude Naomi and the angels hunting him.",
            "director": [],
            "duration": 2520,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/pyKWFDN6RymTMD1fsYC5JiFALEc.jpg"
          },
          "video": ""
        },
        {
          "episode": 22,
          "name": "Clip Show",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/hAQcwUP8HeX5gNWwV07w9WWsK29.jpg",
            "plot": "Sam and Dean are reunited with Castiel as they are digging through the Men of Letters' files. They stumble upon an film which could be the key to completing the third trial. Metatron enlists Cass to mull over problems at home.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/hAQcwUP8HeX5gNWwV07w9WWsK29.jpg"
          },
          "video": ""
        },
        {
          "episode": 23,
          "name": "Sacrifice",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/f9YUVfe5guUUv9EvTZXt3hDf743.jpg",
            "plot": "With Crowley poised to undo all the good they’ve ever done as hunters, Sam and Dean find themselves cornered. But with Kevin's help, the Winchesters ready themselves for one last play against the King of Hell. Metatron initiates a plan with Castiel to take on Naomi and the bureaucracy of Heaven.",
            "director": [],
            "duration": 2520,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/f9YUVfe5guUUv9EvTZXt3hDf743.jpg"
          },
          "video": ""
        }
      ]
    },
    {
      "season": 9,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/gzxekP92imqSSq6FhagISMTr3dg.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": " After defeating the Leviathan, Sam and Dean set off on an epic quest to seal the Gates of Hell last season. Facing a series of trials, the Winchesters soon found themselves in the middle of an age-old power struggle between the King of Hell and legions of warrior angels. But with the angels cast out of heaven and walking the earth, things just got very unpredictable.",
        "cast": [],
        "year": "2013",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "I Think I'm Gonna Like It Here",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/reLKD5eh5O4fbipDVwcJPvEkvdW.jpg",
            "plot": "With Sam's life on the knife-edge, Dean appeals to the fallen angels for help. Unfortunately, most of them only see Dean as a means to get to Castiel and exact vengeance on the one who caused them to Fall.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/reLKD5eh5O4fbipDVwcJPvEkvdW.jpg"
          },
          "video": ""
        },
        {
          "episode": 2,
          "name": "Devil May Care",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/bEzDP2L6o8RTUD1alZYnqFLDfjW.jpg",
            "plot": "Dean and Sam take a captive Crowley to the Men of Letters base in the hopes that he will give up the names of the people possessed by his minion demons. But before they can get any information they are called away to investigate the disappearance of three soldiers.",
            "director": [],
            "duration": 2460,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/bEzDP2L6o8RTUD1alZYnqFLDfjW.jpg"
          },
          "video": ""
        },
        {
          "episode": 3,
          "name": "I'm No Angel",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/zIFT1uSKYkoBILI722X55q49MQI.jpg",
            "plot": "Castiel makes his way to the Winchesters but discovers a band of angels are hunting him, intent on exacting vengeance for what they believe is his role in their fall from Heaven. Meanwhile, Ezekiel continues to repair Sam, but informs Dean that there is a price to be paid.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/zIFT1uSKYkoBILI722X55q49MQI.jpg"
          },
          "video": ""
        },
        {
          "episode": 4,
          "name": "Slumber Party",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/5wWRxfhP3ltDL6yrni4wl4Uge3n.jpg",
            "plot": "With the help from Charlie, Sam and Dean inadvertently release two individuals contained inside of the Men of Letters bunker who where both imprisoned in 1935. They soon discover that one of the individuals is Dorothy of Oz, and she is hot on the trail of the Wicked Witch of the West.",
            "director": [],
            "duration": 2520,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/5wWRxfhP3ltDL6yrni4wl4Uge3n.jpg"
          },
          "video": ""
        },
        {
          "episode": 5,
          "name": "Dog Dean Afternoon",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/qpkFWE7CkiSwc01l0zpHU7rHDvl.jpg",
            "plot": "To track down a killer, Dean uses a spell which allows him to speak with the only witness, a German Sheppard. However, he soon discovers that everything is going to the dogs when the spell starts making him act like a canine as well.",
            "director": [],
            "duration": 2460,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/qpkFWE7CkiSwc01l0zpHU7rHDvl.jpg"
          },
          "video": ""
        },
        {
          "episode": 6,
          "name": "Heaven Can't Wait",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/eElfGjjgGDkIU3rViaeU8Ib19qO.jpg",
            "plot": "Castiel is working as a convenience store clerk and learns of a series of local disappearances. He call the Winchesters, but Dean insists on Sam staying with Kevin to research the demon tablet while he help Cass.",
            "director": [],
            "duration": 2580,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/eElfGjjgGDkIU3rViaeU8Ib19qO.jpg"
          },
          "video": ""
        },
        {
          "episode": 7,
          "name": "Bad Boys",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/bMdR1StV7FOYOS6EXORaPQUsAZn.jpg",
            "plot": "Sonny, a man who runs a boy's home, calls Dean for help after a mysterious death. When Sam wonders how his brother knows Sonny, Dean explains that he spent two months at the boy's home when he was 16, after being arrested for theft.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/bMdR1StV7FOYOS6EXORaPQUsAZn.jpg"
          },
          "video": ""
        },
        {
          "episode": 8,
          "name": "Rock and a Hard Place",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/2OCivrX3cXuJrYWT69M59neBuxN.jpg",
            "plot": "When members of a virgin chastity group are abducted, Sheriff Jody Mills asks Sam and Dean for help. The Winchesters go undercover to track down the missing members, but when Dean disappears, Sam and Jody end up having to track him down.",
            "director": [],
            "duration": 2520,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/2OCivrX3cXuJrYWT69M59neBuxN.jpg"
          },
          "video": ""
        },
        {
          "episode": 9,
          "name": "Holy Terror",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/aV6u3vliPBR3OXBy6eC8GDq2N27.jpg",
            "plot": "The angels are embroiled in a bloody civil war, and Castiel is swept up in the conflict. Meanwhile, Dean realizes that Ezekiel is not who he claims to be and tries to warn Sam with dire results.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/aV6u3vliPBR3OXBy6eC8GDq2N27.jpg"
          },
          "video": ""
        },
        {
          "episode": 10,
          "name": "Road Trip",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/jc00f9ujVgojMD63GzC2wz1jeA0.jpg",
            "plot": "Dean and Castiel make a deal with Crowley in order to contact Sam's consciousness so he can expel the angel Gadreel from his body. However, Abaddon is hot on their trail and Crowley has plans of his own.",
            "director": [],
            "duration": 2580,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/jc00f9ujVgojMD63GzC2wz1jeA0.jpg"
          },
          "video": ""
        },
        {
          "episode": 11,
          "name": "First Born",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ldKmxvcMvYnii3JJV8yH5bWmGg0.jpg",
            "plot": "Crowley turns to Dean for help to locate the First Blade, the only weapon that can kill Abaddon. However, the trail leads them to the biblical Cain. Meanwhile, Sam asks Castiel for help when they need to extract the remaining angel grace from Sam's body to track Gadreel.",
            "director": [],
            "duration": 2520,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ldKmxvcMvYnii3JJV8yH5bWmGg0.jpg"
          },
          "video": ""
        },
        {
          "episode": 12,
          "name": "Sharp Teeth",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/bG3J8PvtvQotjRNpAOyO6RygUaJ.jpg",
            "plot": "Six months after his disappearance, Garth turns up injured in a hospital. Sam and Dean arrive separately to investigate and soon discover that their friend has undergone a startling transformation.",
            "director": [],
            "duration": 2460,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/bG3J8PvtvQotjRNpAOyO6RygUaJ.jpg"
          },
          "video": ""
        },
        {
          "episode": 13,
          "name": "The Purge",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/gy7q5eMaQ6nhZ6NwBn64YtY968u.jpg",
            "plot": "Two dead victims show up with all the fat having being stolen from their bodies. Sam and Dean go undercover in order to investigate a local spa, and discover that a monster is preying on the overweight.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/gy7q5eMaQ6nhZ6NwBn64YtY968u.jpg"
          },
          "video": ""
        },
        {
          "episode": 14,
          "name": "Captives",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/30435oZsIhRdgpIE2o72szAW5kj.jpg",
            "plot": "While Sam and Dean try to track down Kevin's mother, Castiel is captured by an old battle-comrade and learns more about the factions of angels.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/30435oZsIhRdgpIE2o72szAW5kj.jpg"
          },
          "video": ""
        },
        {
          "episode": 15,
          "name": "#THINMAN",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/bGaN7wqd3T1CgXlmg5UGqarjHWz.jpg",
            "plot": "The Winchester brothers investigate a murder that was apparently caused by a ghost. Sam and Dean discover that the Ghostfacers, Ed and Harry, are already on the case.",
            "director": [],
            "duration": 2520,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/bGaN7wqd3T1CgXlmg5UGqarjHWz.jpg"
          },
          "video": ""
        },
        {
          "episode": 16,
          "name": "Blade Runners",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/yWyLgjF8bq9l0uENb7GutJflNfQ.jpg",
            "plot": "Sam and Dean are searching for the First Blade and end up having to track down the missing Crowley and discover that he's now thoroughly addicted to human blood. The Winchesters decide that going cold turkey is the only way.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/yWyLgjF8bq9l0uENb7GutJflNfQ.jpg"
          },
          "video": ""
        },
        {
          "episode": 17,
          "name": "Mother's Little Helper",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ltt0EDsI1wA4AZk5MPWOOX0nNeD.jpg",
            "plot": "When Dean chooses to stay in the bunker and try and locate Abaddon, Sam goes to a small Illinois town to investigate a string of vicious murders committed by seemingly harmless individuals.",
            "director": [],
            "duration": 2520,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ltt0EDsI1wA4AZk5MPWOOX0nNeD.jpg"
          },
          "video": ""
        },
        {
          "episode": 18,
          "name": "Meta Fiction",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ijnzYR5meOFtbZW9vtEHWh7Apkj.jpg",
            "plot": "Castiel investigates the mass slaughter of angels and finds a lone survivor and an old friend. Meanwhile, Sam and Dean capture Gadreel, and Metatron begins the ending of his story.",
            "director": [],
            "duration": 2520,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ijnzYR5meOFtbZW9vtEHWh7Apkj.jpg"
          },
          "video": ""
        },
        {
          "episode": 19,
          "name": "Alex Annie Alexis Ann",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/9gpoKobvuUizxqBpQSKjQYgl1sP.jpg",
            "plot": "Sheriff Jody Mills befriends a young girl on the run from vampires. When she's forced to kill one of the monsters, Jody calls in Sam and Dean for help. However, they discover that everything isn't at it seems.",
            "director": [],
            "duration": 2580,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/9gpoKobvuUizxqBpQSKjQYgl1sP.jpg"
          },
          "video": ""
        },
        {
          "episode": 20,
          "name": "Bloodlines",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/wPfhsvZFi2MimQYLsA1nIXnJNTP.jpg",
            "plot": "Sam and Dean learn about a monster killing in Chicago and head there to investigate. What they find is a young cop whose girlfriend was killed by the same creature, and who is caught between five powerful clans of monsters who jointly control the city.",
            "director": [],
            "duration": 2520,
            "rating": "5.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/wPfhsvZFi2MimQYLsA1nIXnJNTP.jpg"
          },
          "video": ""
        },
        {
          "episode": 21,
          "name": "King of the Damned",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/4b1WptG12AOpojexhg9783lWsgN.jpg",
            "plot": "Abaddon finally gets something that she can use as leverage against Crowley to force him to lure the Winchesters into a trap. Meanwhile, Castiel rallies his forces and asks Sam and Dean to come in and help him interrogate a captive angel with ties to Metatron.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/4b1WptG12AOpojexhg9783lWsgN.jpg"
          },
          "video": ""
        },
        {
          "episode": 22,
          "name": "Stairway to Heaven",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/iSfohnhNh0lnddmFXc8LFEdPyjm.jpg",
            "plot": "After an angel carries out a suicide attack on an ice cream shop to kill one angel from another faction. Sam and Dean investigate and discover that the target was one of Metatron's angels and that Castiel may be responsible.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/iSfohnhNh0lnddmFXc8LFEdPyjm.jpg"
          },
          "video": ""
        },
        {
          "episode": 23,
          "name": "Do You Believe in Miracles?",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/9vlbX0RUxQuBLB32KSV4dVmivum.jpg",
            "plot": "After attacking Gadreel, Dean leaves with Crowley to track down Metatron and kill him. Meanwhile, Gadreel takes Castiel into Heaven to try and break Metatron's connection to the angel tablet.",
            "director": [],
            "duration": 2520,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/9vlbX0RUxQuBLB32KSV4dVmivum.jpg"
          },
          "video": ""
        }
      ]
    },
    {
      "season": 10,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/60iYy9SYG74duc91JLKpsEQG3AS.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "Season 10 begins with Sam’s frantic search for his missing brother, who is gone without a trace. The road to recovering the wayward Dean takes Sam down dark paths, with consequences that will shake the boys to their core. Meanwhile, Castiel has to pick up the pieces in the aftermath of Metatron’s campaign. With his grace failing and rogue angels still on the loose, Cas will face the ticking clock of his own mortality as all-new threats emerge to once again push all of our heroes to their limits.",
        "cast": [],
        "year": "2014",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Black",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/kjrtS0Vc72EoGqvTQj3aUXGW3Mf.jpg",
            "plot": "Dean is a demon and running amuck with Crowley while Sam tries to figure out what happened to his brother. Meanwhile, Castiel is dealing with his fading grace.",
            "director": [],
            "duration": 2520,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/kjrtS0Vc72EoGqvTQj3aUXGW3Mf.jpg"
          },
          "video": ""
        },
        {
          "episode": 2,
          "name": "Reichenbach",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/sGAePN7qjJDP9rIfJMBue3Ak2KJ.jpg",
            "plot": "Crowley is worried that Dean, driven by the mark, is getting out of control. Sam struggles to escape from Cole. Hannah tries to convince Metatron to give Castiel his grace back.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/sGAePN7qjJDP9rIfJMBue3Ak2KJ.jpg"
          },
          "video": ""
        },
        {
          "episode": 3,
          "name": "Soul Survivor",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/xRLMbEXO1xffas5sQZHPEnDMmN0.jpg",
            "plot": "Sam continues to try to save Dean from the Mark of Cain. Realizing that Dean's antics are causing problems for him in hell, Crowley seeks help from a reluctant Castiel.",
            "director": [],
            "duration": 2520,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/xRLMbEXO1xffas5sQZHPEnDMmN0.jpg"
          },
          "video": ""
        },
        {
          "episode": 4,
          "name": "Paper Moon",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/31i2c67z2SajeiSQM490EznUl4X.jpg",
            "plot": "Sam and Dean investigate a series of werewolf attacks.",
            "director": [],
            "duration": 2460,
            "rating": "6.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/31i2c67z2SajeiSQM490EznUl4X.jpg"
          },
          "video": ""
        },
        {
          "episode": 5,
          "name": "Fan Fiction",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/vFQ3C48Sj7PFHkgCnPOBR3CcBf9.jpg",
            "plot": "Sam and Dean investigate a haunting at a theatre.",
            "director": [],
            "duration": 2520,
            "rating": "8.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/vFQ3C48Sj7PFHkgCnPOBR3CcBf9.jpg"
          },
          "video": ""
        },
        {
          "episode": 6,
          "name": "Ask Jeeves",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ydhahWtCx3f75400nmVLblZAkim.jpg",
            "plot": "After Dean hears a surprising message on Bobby's phone, he and Sam head out to investigate.",
            "director": [],
            "duration": 2520,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ydhahWtCx3f75400nmVLblZAkim.jpg"
          },
          "video": ""
        },
        {
          "episode": 7,
          "name": "Girls, Girls, Girls",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/m0pQslopygerfdD4e7DGa7kOo43.jpg",
            "plot": "Sam and Dean discover a group of witches on a gone wild trip and attempt to stop them.",
            "director": [],
            "duration": 2520,
            "rating": "6.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/m0pQslopygerfdD4e7DGa7kOo43.jpg"
          },
          "video": ""
        },
        {
          "episode": 8,
          "name": "Hibbing 911",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/y3Nk4fAxJnTstODKEVTI85kUAiK.jpg",
            "plot": "Sheriff Jody Mills is matched with an overeager partner during a mandatory sheriff's retreat and when a gruesome corpse is discovered, Jody calls Sam and Dean to help investigate.",
            "director": [],
            "duration": 2520,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/y3Nk4fAxJnTstODKEVTI85kUAiK.jpg"
          },
          "video": ""
        },
        {
          "episode": 9,
          "name": "The Things We Left Behind",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/qDVYqCL1s4o6ZwRbIUMu1AUMxSZ.jpg",
            "plot": "Castiel finds Jimmy’s daughter Claire in a group home and she convinces him to break her out. After she runs away from him, Castiel calls Sam and Dean to help find her before she gets in trouble.",
            "director": [],
            "duration": 2520,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/qDVYqCL1s4o6ZwRbIUMu1AUMxSZ.jpg"
          },
          "video": ""
        },
        {
          "episode": 10,
          "name": "The Hunter Games",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ieprkWMGGlQHlSeqhAMwxpGeJNo.jpg",
            "plot": "After the massacre at the ranch, Dean, Sam, and Castiel double their efforts to find a cure for the Mark of Cain. Desperate, Castiel comes up with an idea that Sam deems the single worst idea he's ever heard. Meanwhile, Rowena continues to plot against Crowley.",
            "director": [],
            "duration": 2580,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ieprkWMGGlQHlSeqhAMwxpGeJNo.jpg"
          },
          "video": ""
        },
        {
          "episode": 11,
          "name": "There's No Place Like Home",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/gdybjLeUHGZF0hxB0fOJtIFJ1xX.jpg",
            "plot": "Sam is scanning the internet for suspicious paranormal activity and comes across a video of Charlie beating up a district attorney. Dean suspects she’s back from Oz and hunting on her own, assuming the district attorney must have been a demon.",
            "director": [],
            "duration": 2580,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/gdybjLeUHGZF0hxB0fOJtIFJ1xX.jpg"
          },
          "video": ""
        },
        {
          "episode": 12,
          "name": "About a Boy",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/s9hQJO1UlFxO6PKn3RaM50hRAXF.jpg",
            "plot": "Looking to get Dean out of the bunker, Sam finds a case for him and Dean to investigate – people are disappearing into thin air with only their clothes left behind.",
            "director": [],
            "duration": 2460,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/s9hQJO1UlFxO6PKn3RaM50hRAXF.jpg"
          },
          "video": ""
        },
        {
          "episode": 13,
          "name": "Halt & Catch Fire",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/3vOeCup6NCjiYux2m8L9CyFIb38.jpg",
            "plot": "A ghost starts killing people through various electronic devices. Sam and Dean discover who was killed and why this ghost is seeking revenge on a group of college students but what they can't figure out is how he’s doing it.  With three dead, the brothers must stop the ghost before he claims his next victim.",
            "director": [],
            "duration": 2520,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/3vOeCup6NCjiYux2m8L9CyFIb38.jpg"
          },
          "video": ""
        },
        {
          "episode": 14,
          "name": "The Executioner's Song",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/bInyjYWNo3ovguO6JKEoAEVhCLL.jpg",
            "plot": "Dean, Sam and Castiel deal with Cain’s return.  Crowley and Rowena continue to grow closer but when Crowley bails on plans with his mother to help the Winchesters, Rowena lets him have it.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/bInyjYWNo3ovguO6JKEoAEVhCLL.jpg"
          },
          "video": ""
        },
        {
          "episode": 15,
          "name": "The Things They Carried",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/pkxIrqg9IYylL9fRckjRadVTvfa.jpg",
            "plot": "Despite Dean's directive to forget about looking for a cure for the Mark of Cain, Sam continues to do research. Dean suspects Sam is hiding something but decides to focus on a new murder case where they run into Cole. The three team up and learn a Khan worm is infecting men and turning them into murderers. Unfortunately, the worm makes its way into Cole.",
            "director": [],
            "duration": 2520,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/pkxIrqg9IYylL9fRckjRadVTvfa.jpg"
          },
          "video": ""
        },
        {
          "episode": 16,
          "name": "Paint It Black",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/sm1cksE1sTlrEgkhVxpept7fqIU.jpg",
            "plot": "Sam and Dean investigate a string of suicides committed by people with little in common other than the identical, grisly method of death – slow, self-administered disembowlment. All of the victims were members of a Catholic church and had recently given confession, leading the brothers to suspect the priest is somehow involved. Meanwhile, when Crowley captures Olivette, the leader of the Grand Coven, Rowena pleads her case to be allowed to practice magic freely again. ",
            "director": [],
            "duration": 2520,
            "rating": "6.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/sm1cksE1sTlrEgkhVxpept7fqIU.jpg"
          },
          "video": ""
        },
        {
          "episode": 17,
          "name": "Inside Man",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/jWyEhBgSXi261GnjLDnzNLH4niy.jpg",
            "plot": "Sam and Castiel follow up on a lead about the Mark of Cain. Dean and Rowena meet. ",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/jWyEhBgSXi261GnjLDnzNLH4niy.jpg"
          },
          "video": ""
        },
        {
          "episode": 18,
          "name": "Book of the Damned",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/iYvCxIm2a4dcVtvRXRpd5Og47FS.jpg",
            "plot": "Charlie calls Sam and Dean to tell them she found the Book of the Dead which could help remove the Mark of Cain. The Winchesters race to her after she tells them she’s been shot by a man named Jacob Styne who says the book belongs to his family and he won’t rest until he gets it back. Castiel and Metatron take a road trip to find Castiel’s grace but they hit a couple road bumps along the way.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/iYvCxIm2a4dcVtvRXRpd5Og47FS.jpg"
          },
          "video": ""
        },
        {
          "episode": 19,
          "name": "The Werther Project",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/xabLZiDXLQ2wKZdbPhdjhXmaQyr.jpg",
            "plot": "Sam learns that former Men of Letters, Magnus, once built a magical box and Sam sets out to find it in the hopes it can cure Dean of the Mark of Cain.  However, what he’s not prepared for is the deadly alarm system Magnus set up on the box.  When Sam opens the box, he puts both his and Dean’s life in danger. ",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/xabLZiDXLQ2wKZdbPhdjhXmaQyr.jpg"
          },
          "video": ""
        },
        {
          "episode": 20,
          "name": "Angel Heart",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/yFiINFox0HISkDuHa9A0ftiu9CE.jpg",
            "plot": "When Claire Novak gets a lead on her mother, Amelia, who has been missing for years, Castiel asks Sam and Dean to help her. However, when they find out what took Amelia, they realize there is a chance Claire may not get her happy ending.",
            "director": [],
            "duration": 2520,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/yFiINFox0HISkDuHa9A0ftiu9CE.jpg"
          },
          "video": ""
        },
        {
          "episode": 21,
          "name": "Dark Dynasty",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/vxIrCejWpuPqE1ZKvDpKc9iPCd8.jpg",
            "plot": "Dean and Sam investigate a bizarre murder and realize the killer bears the same tattoo as those from the Styne family. Meanwhile, Castiel acts as referee when Charlie and Rowena are forced to work together on the Book of the Damned. When Crowley discovers that his mother is missing, he turns to an old enemy for help.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/vxIrCejWpuPqE1ZKvDpKc9iPCd8.jpg"
          },
          "video": ""
        },
        {
          "episode": 22,
          "name": "The Prisoner",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/aiHs8O6jVvfGk6j7R85pRXvQ2HQ.jpg",
            "plot": "When it comes to the Stynes, Dean decides to take matters into his own hands. Sam tries to come to terms with his decision.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/aiHs8O6jVvfGk6j7R85pRXvQ2HQ.jpg"
          },
          "video": ""
        },
        {
          "episode": 23,
          "name": "Brother's Keeper",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/1rNqxT80PTUDa024jsZS00jITey.jpg",
            "plot": "Dean makes a shocking decision regarding the Mark of Cain that would change not only his life, but Sam’s too. Meanwhile, Crowley and Rowena face off and Castiel gets caught in the middle. ",
            "director": [],
            "duration": 2580,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/1rNqxT80PTUDa024jsZS00jITey.jpg"
          },
          "video": ""
        }
      ]
    },
    {
      "season": 11,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/2RlcVP4LsRzr1g8oIU3hNq0BEwm.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "Following the release of the Darkness, this season follows the Winchesters and their allies as they find themselves fighting the most powerful supernatural entity they've ever faced.",
        "cast": [],
        "year": "2015",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Out of the Darkness, Into the Fire",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/et4wg0U4ZcXdCTVTJH1KLinjOzN.jpg",
            "plot": "Picking up where the finale left off, Sam and Dean must deal with the Darkness that has been unleashed. Castiel deals with the effects of Rowena’s spell and recalls his brutal battle with Crowley.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/et4wg0U4ZcXdCTVTJH1KLinjOzN.jpg"
          },
          "video": ""
        },
        {
          "episode": 2,
          "name": "Form and Void",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/5E2iqdvFEmQSWggXym0rj4bs9M.jpg",
            "plot": "Dean helps Jenna, the deputy he met after the Darkness fell, get back home safely and then sets off to help Sam deal with a town infected by a mysterious and deadly gas. However, when Jenna falls into dangerous hands, she calls Dean for help and Sam tells him to go back to her. Unfortunately for Sam, he isn't able to handle the townspeople turned monsters as easily as he thought.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/5E2iqdvFEmQSWggXym0rj4bs9M.jpg"
          },
          "video": ""
        },
        {
          "episode": 3,
          "name": "The Bad Seed",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/6tjGWIxQDLmTj99asNWkApCz65g.jpg",
            "plot": "While Rowena tries to consolidate her power to protect herself from the Winchesters, Sam and Dean search for a missing baby connected to the Darkness. Meanwhile, Castiel struggles to heal and Crowley tries to find a way to use the Darkness for his own personal gain.",
            "director": [],
            "duration": 2520,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/6tjGWIxQDLmTj99asNWkApCz65g.jpg"
          },
          "video": ""
        },
        {
          "episode": 4,
          "name": "Baby",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/6MxSNJ5UA8AVlCfmLhltsqBbWLV.jpg",
            "plot": "Seen entirely from the point of view of the Impala, Sam and Dean go on a road trip to fight monsters and demons.",
            "director": [],
            "duration": 2520,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/6MxSNJ5UA8AVlCfmLhltsqBbWLV.jpg"
          },
          "video": ""
        },
        {
          "episode": 5,
          "name": "Thin Lizzie",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/mwkHyNrfZzEixxdhvuACkUspcws.jpg",
            "plot": "Sam and Dean investigate a series of murders at a local B&B that also happens to be Lizzie Borden’s old home. When a local man, Len, tells them he saw a little girl around the B&B around the time of the murders, the brothers realize Amara may be responsible.",
            "director": [],
            "duration": 2520,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/mwkHyNrfZzEixxdhvuACkUspcws.jpg"
          },
          "video": ""
        },
        {
          "episode": 6,
          "name": "Our Little World",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/gZPedFKFg29AK2VLIzDw1z68zXb.jpg",
            "plot": "Castiel seeks out Metatron’s help to stop the Darkness. However, Metatron is pretty happy with his new life as a freelance videographer for the local news and isn’t inclined to help the Winchesters or Castiel. Meanwhile, Crowley is losing his hold on Amara.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/gZPedFKFg29AK2VLIzDw1z68zXb.jpg"
          },
          "video": ""
        },
        {
          "episode": 7,
          "name": "Plush",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/n9rzWIWj8vn0dQL0nQK7niEIu6v.jpg",
            "plot": "Sheriff Donna calls Sam and Dean for help after a horrific murder with supernatural elements happens in her town. Sam continues to have visions and asks God for help, which frustrates Dean.",
            "director": [],
            "duration": 2460,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/n9rzWIWj8vn0dQL0nQK7niEIu6v.jpg"
          },
          "video": ""
        },
        {
          "episode": 8,
          "name": "Just My Imagination",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/dBvmYEJ1qbWLjyPEBmhrN0xu1bN.jpg",
            "plot": "Sam is shocked when his childhood imaginary friend Sully makes an unexpected appearance. Sam can’t understand why he’d see Sully now but what’s even more surprising is that Dean can see him, too. Flashbacks reveal young Sam’s friendship with Sully and why he needed him.",
            "director": [],
            "duration": 2520,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/dBvmYEJ1qbWLjyPEBmhrN0xu1bN.jpg"
          },
          "video": ""
        },
        {
          "episode": 9,
          "name": "O Brother Where Art Thou?",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/mtpfPDXAnWh4pnUQAMsp14MtSMX.jpg",
            "plot": "Amara unleashes her power on the local townspeople as she issues a shocking challenge. Dean tries to better understand the hold Amara has on him, while Sam and Crowley come up with a plan that could have disastrous consequences.",
            "director": [],
            "duration": 2520,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/mtpfPDXAnWh4pnUQAMsp14MtSMX.jpg"
          },
          "video": ""
        },
        {
          "episode": 10,
          "name": "The Devil in the Details",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/mxPmR3WCsIonsMRHgPsuKMxmyW3.jpg",
            "plot": "Now that he has Sam in the cage with him, Lucifer offers Sam a way out but it comes with a steep price. Dean and Castiel look into the angel smiting that could have killed Amara.",
            "director": [],
            "duration": 2520,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/mxPmR3WCsIonsMRHgPsuKMxmyW3.jpg"
          },
          "video": ""
        },
        {
          "episode": 11,
          "name": "Into the Mystic",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/v6IjY4UObxlQ4QdaxAqgdGhJTyE.jpg",
            "plot": "Sam and Dean investigate a case where people are suffering violent deaths after hearing a mysterious song.",
            "director": [],
            "duration": 2520,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/v6IjY4UObxlQ4QdaxAqgdGhJTyE.jpg"
          },
          "video": ""
        },
        {
          "episode": 12,
          "name": "Don't You Forget About Me",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/sLkl16kyH6G8TJzZdGdR1VCQpse.jpg",
            "plot": "Sam and Dean drop in on Jody Mills, Claire and Alex after receiving a panicked phone call from Claire. She believes the recent murders in town are supernatural and wants the boys’ help. However, Sheriff Mills tells Sam and Dean that Claire has been getting into trouble lately as she’s been attacking normal people and accusing them of being monsters.",
            "director": [],
            "duration": 2520,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/sLkl16kyH6G8TJzZdGdR1VCQpse.jpg"
          },
          "video": ""
        },
        {
          "episode": 13,
          "name": "Love Hurts",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/rnlLUoPUpg24bHlEraBCRfvdxdM.jpg",
            "plot": "Sam and Dean investigate a set of murders on Valentine’s Day and discover they are dealing with an ancient curse. Once kissed by the curse, the person is marked to die.",
            "director": [],
            "duration": 2520,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/rnlLUoPUpg24bHlEraBCRfvdxdM.jpg"
          },
          "video": ""
        },
        {
          "episode": 14,
          "name": "The Vessel",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/qKNptqO13AylyapOmbSkaA0yftM.jpg",
            "plot": "Hoping to find a weapon powerful enough to defeat Amara, Dean convinces Castiel, who is still possessed by Lucifer, to send him back in time to 1944 to the fated submarine mission that sunk the Hand of God.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/qKNptqO13AylyapOmbSkaA0yftM.jpg"
          },
          "video": ""
        },
        {
          "episode": 15,
          "name": "Beyond The Mat",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/dtGY55mqofeLWOULzOI06UCjeDQ.jpg",
            "plot": "Sam and Dean attend a wrestling match to relive one of their fondest memories but when a wrestler turns up dead they suspect foul play.",
            "director": [],
            "duration": 2520,
            "rating": "6.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/dtGY55mqofeLWOULzOI06UCjeDQ.jpg"
          },
          "video": ""
        },
        {
          "episode": 16,
          "name": "Safe House",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/kVZDBsDYWuXy9yQlUwOeZk6kOPP.jpg",
            "plot": "A dangerous creature is accidentally released into an old house, attacking a mother and her child and leaving them both in a coma. Sam and Dean learn that Bobby and Rufus once tracked the same creature, so the Winchesters look to the past to come up with a plan to catch the monster.",
            "director": [],
            "duration": 2520,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/kVZDBsDYWuXy9yQlUwOeZk6kOPP.jpg"
          },
          "video": ""
        },
        {
          "episode": 17,
          "name": "Red Meat",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/cn10gcZW0PRnkgx7HkEYlRr6Js1.jpg",
            "plot": "Sam and Dean battle a pair of werewolves who have captured two victims. Just as the brothers are about to win, one of the werewolves shoots Sam. Dean gets his brother and the victims out of the house but learns that a pack of werewolves are hot on their tail.",
            "director": [],
            "duration": 2460,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/cn10gcZW0PRnkgx7HkEYlRr6Js1.jpg"
          },
          "video": ""
        },
        {
          "episode": 18,
          "name": "Hell's Angel",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/iazKVzJUbnRLbubB7LdZN9G1MQZ.jpg",
            "plot": "Lucifer takes a trip home and tries to assert himself into Heaven. Crowley tells Sam and Dean he has a way to take down Amara.",
            "director": [],
            "duration": 2520,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/iazKVzJUbnRLbubB7LdZN9G1MQZ.jpg"
          },
          "video": ""
        },
        {
          "episode": 19,
          "name": "The Chitters",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/zFOEfOJ7E9J99kX8XC6doXtBVRr.jpg",
            "plot": "In a small town in Colorado, mysterious disappearances happen every 27 years. Sam and Dean head to the town to investigate and meet two hunters who have a personal vendetta against these once-in-a-generation monsters.",
            "director": [],
            "duration": 2520,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/zFOEfOJ7E9J99kX8XC6doXtBVRr.jpg"
          },
          "video": ""
        },
        {
          "episode": 20,
          "name": "Don't Call Me Shurley",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/7y7YnAQoE2COuYPCwKAbclhA6cO.jpg",
            "plot": "Amara unleashes a dark fog on a small town, causing everyone to go mad. Dean and Sam realize this is a stronger version of the original black vein virus Amara previously unleashed. They team up with the sheriff to protect the town but their old remedy no longer works. Meanwhile, Chuck returns with an interesting proposal.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/7y7YnAQoE2COuYPCwKAbclhA6cO.jpg"
          },
          "video": ""
        },
        {
          "episode": 21,
          "name": "All in the Family",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/j3zzzre0zHqcsSogECSJEUbVUJ4.jpg",
            "plot": "Amara shows Dean how she’s torturing Lucifer. Worried for Castiel, Dean and Sam come up with a plan to rescue him from Amara’s clutches.",
            "director": [],
            "duration": 2520,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/j3zzzre0zHqcsSogECSJEUbVUJ4.jpg"
          },
          "video": ""
        },
        {
          "episode": 22,
          "name": "We Happy Few",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/g12CYzsU4YTgpfONU7NnVd6jLvO.jpg",
            "plot": "Sam and Dean face their biggest challenge yet. Rowena makes her move.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/g12CYzsU4YTgpfONU7NnVd6jLvO.jpg"
          },
          "video": ""
        },
        {
          "episode": 23,
          "name": "Alpha and Omega",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/z56RwqT5AUS6nfqNVlrhffRl5wa.jpg",
            "plot": "God comes to a decision about Amara that has direct repercussions for Sam and Dean.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/z56RwqT5AUS6nfqNVlrhffRl5wa.jpg"
          },
          "video": ""
        }
      ]
    },
    {
      "season": 12,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/gkNzVg2k8dF6mXsMnjhaMX1NpUy.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "In the show's eleventh season, the Winchesters found themselves battling an apocalyptic force: the Darkness. Now, rallying help from their allies - both human and supernatural - Sam and Dean are about to go toe-to-toe with the most destructive enemy they've ever seen. The question is, will they win? And at what price?",
        "cast": [],
        "year": "2016",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Keep Calm and Carry On",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/kkC090DloV9Gt1UL5e9VAoT20hG.jpg",
            "plot": "Dean is overwhelmed as he comes face to face with his mom, Mary Winchester. Meanwhile, Sam is fighting for his life after Toni, from the Woman of Letters, shot him.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/kkC090DloV9Gt1UL5e9VAoT20hG.jpg"
          },
          "video": ""
        },
        {
          "episode": 2,
          "name": "Mamma Mia",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/avtITe1ibWR5V0o5tCM1SO1ymVe.jpg",
            "plot": "Dean, Castiel and Mary have a lead on Sam and set out to rescue him. Dean is uncomfortable with putting Mary in danger but she insists on going along. Meanwhile, Crowley is tipped off that Lucifer has taken over the body of rock star Vince Vicente.",
            "director": [],
            "duration": 2520,
            "rating": "6.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/avtITe1ibWR5V0o5tCM1SO1ymVe.jpg"
          },
          "video": ""
        },
        {
          "episode": 3,
          "name": "The Foundry",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/pVBD4ptxZjnS0d4g4JO3NVMZarL.jpg",
            "plot": "When a crying baby leads to death in a mysterious abandoned house, Mary, Sam and Dean decide to investigate. Meanwhile, Castiel’s hunt for Lucifer leads him, begrudgingly, to partner up with Crowley.",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/pVBD4ptxZjnS0d4g4JO3NVMZarL.jpg"
          },
          "video": ""
        },
        {
          "episode": 4,
          "name": "American Nightmare",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/b3yzp8TKrSWnZv4IWmJTXQXFFpY.jpg",
            "plot": "Sam and Dean investigate a case that leads them to a devout religious family that lives off the grid. The brothers realize that the parents are hiding a huge secret that could destroy them all. Meanwhile, Dean struggles to accept Mary’s latest decision.",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/b3yzp8TKrSWnZv4IWmJTXQXFFpY.jpg"
          },
          "video": ""
        },
        {
          "episode": 5,
          "name": "The One You've Been Waiting For",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/4n1aCD9MeOl6mxp24glAFhubMDt.jpg",
            "plot": "After learning that the soul of Adolf Hitler has been trapped in a 1930’s gold pocket watch, Sam and Dean must act quickly to prevent a group of Nazi necromancers from resurrecting the Führer.",
            "director": [],
            "duration": 2460,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/4n1aCD9MeOl6mxp24glAFhubMDt.jpg"
          },
          "video": ""
        },
        {
          "episode": 6,
          "name": "Celebrating the Life of Asa Fox",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/c8LhfYudv1zgr04ziFz3rX3PM8W.jpg",
            "plot": "When hunters gather together to celebrate the life and tragic death of one of their own, Sam, Dean, and Mary must take action when a demon starts picking off hunters one by one.",
            "director": [],
            "duration": 2520,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/c8LhfYudv1zgr04ziFz3rX3PM8W.jpg"
          },
          "video": ""
        },
        {
          "episode": 7,
          "name": "Rock Never Dies",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/20VAXuvcwKMgRxhNYohAHpupyXf.jpg",
            "plot": "Lucifer realizes that as rock star Vince Vincente, he can get his fans to do whatever he wants. Thrilled with this power, Lucifer arranges to play a secret VIP concert in order to kill all of them. Sam, Dean and Castiel enter the underbelly of the music industry to try to stop him.",
            "director": [],
            "duration": 2520,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/20VAXuvcwKMgRxhNYohAHpupyXf.jpg"
          },
          "video": ""
        },
        {
          "episode": 8,
          "name": "LOTUS",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/nMaVXiiGoNOgjIGfKrkzoKfIiXZ.jpg",
            "plot": "Lucifer’s search for power and influence in a vessel lands him in the White House. The President of The United States unknowingly makes a deal with the devil, leading Sam, Dean, Castiel, Crowley and Rowena to band together to fight the Dark Lord.",
            "director": [],
            "duration": 2520,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/nMaVXiiGoNOgjIGfKrkzoKfIiXZ.jpg"
          },
          "video": ""
        },
        {
          "episode": 9,
          "name": "First Blood",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/9Qc4xpudV5Q9c976GfFYXknKBD0.jpg",
            "plot": "After being arrested for the attempted assassination of the President of The United States, Sam and Dean must find a way out of an underground, government-run, detention facility in the middle of nowhere. Determined to find her sons, Mary and Castiel seek assistance from an unlikely source.",
            "director": [],
            "duration": 2520,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/9Qc4xpudV5Q9c976GfFYXknKBD0.jpg"
          },
          "video": ""
        },
        {
          "episode": 10,
          "name": "Lily Sunder Has Some Regrets",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/6FX6ejptbTyxGpfK1GWI1vhj2WS.jpg",
            "plot": "Lily Sunder steeps herself in black magic, honing her powers for over a century, waiting to exact revenge on a band of angels that murdered her family. Sam and Dean must work quickly to stop Castiel from becoming her next victim.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/6FX6ejptbTyxGpfK1GWI1vhj2WS.jpg"
          },
          "video": ""
        },
        {
          "episode": 11,
          "name": "Regarding Dean",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/mb9y3B7rNs9BJZ6sE4NcG2XO8Gn.jpg",
            "plot": "Sam enlists Rowena’s help to track down an old world, powerful family of witches after Dean gets hit by a spell that is rapidly erasing his memory.",
            "director": [],
            "duration": 2520,
            "rating": "8.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/mb9y3B7rNs9BJZ6sE4NcG2XO8Gn.jpg"
          },
          "video": ""
        },
        {
          "episode": 12,
          "name": "Stuck in the Middle (With You)",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/gnrPC2RNDvopoOwQClkwA8KvTtm.jpg",
            "plot": "Mary asks Sam, Dean and Castiel for help on a case she’s working but neglects to mention the British Men of Letters are involved. When Mary is double crossed, everything is revealed.",
            "director": [],
            "duration": 2520,
            "rating": "8.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/gnrPC2RNDvopoOwQClkwA8KvTtm.jpg"
          },
          "video": ""
        },
        {
          "episode": 13,
          "name": "Family Feud",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/iad32u3l7D3OLXUg5XzwVJpUL9s.jpg",
            "plot": "When Sam and Dean look into a murder at a museum, they learn a ghost from a merchant ship that sunk in 1723 may be at the heart of the mystery. After realizing “The Star” was the same ship that Crowley’s son Gavin McLeod should have been aboard, they enlist help from Rowena to track Gavin down. Kelly Kline, still pregnant with Lucifer’s child, takes refuge with a demon after an angel attempts to kill her.",
            "director": [],
            "duration": 2520,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/iad32u3l7D3OLXUg5XzwVJpUL9s.jpg"
          },
          "video": ""
        },
        {
          "episode": 14,
          "name": "The Raid",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ympOe0aTXssXY1CxZHveEF1f7SK.jpg",
            "plot": "A chance to take out a nest of vampires backfires when the alpha-vamp shows up and turns the tables on Mary and the British Men of Letters, who are doing their best to recruit Sam and Dean.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ympOe0aTXssXY1CxZHveEF1f7SK.jpg"
          },
          "video": ""
        },
        {
          "episode": 15,
          "name": "Somewhere Between Heaven and Hell",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/8hyHbg3PAtuzkv5DpO6EMoQlnV0.jpg",
            "plot": "An attack by an invisible hellhound at a campsite leads Sam  and Dean  to investigate the mysterious circumstances. Meanwhile, two of Crowley’s own personal demons uncover what he has been hiding. Castiel gets a lead on Kelly Kline.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/8hyHbg3PAtuzkv5DpO6EMoQlnV0.jpg"
          },
          "video": ""
        },
        {
          "episode": 16,
          "name": "Ladies Drink Free",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/u9oGI4uldjvJVtnPhqu0Kt2FNJu.jpg",
            "plot": "Sam and Dean let Mick Davies tag along on a case as they search for a werewolf. The three men run into Claire Novak, also working the hunt. However, the reunion is short lived after Claire is bitten and the brothers race to find a way to help her before she turns.",
            "director": [],
            "duration": 2520,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/u9oGI4uldjvJVtnPhqu0Kt2FNJu.jpg"
          },
          "video": ""
        },
        {
          "episode": 17,
          "name": "The British Invasion",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/adf1CAcUnvo2gikRtswORgivIQh.jpg",
            "plot": "Sam and Dean get a lead on Kelly Kline’s whereabouts. Mick drops by the bunker unexpectedly and decides to join the hunt.",
            "director": [],
            "duration": 2520,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/adf1CAcUnvo2gikRtswORgivIQh.jpg"
          },
          "video": ""
        },
        {
          "episode": 18,
          "name": "The Memory Remains",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/5dP7g38SwQRKqHATLmXIYH0RVue.jpg",
            "plot": "Sam and Dean investigate a missing person’s case in a small town. The lead witness tells the Winchesters the attacker was a man with the head of a goat. Sam and Dean aren’t sure what to believe but when the witness goes missing they realize the town is hiding a dark secret.",
            "director": [],
            "duration": 2520,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/5dP7g38SwQRKqHATLmXIYH0RVue.jpg"
          },
          "video": ""
        },
        {
          "episode": 19,
          "name": "The Future",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/hzPCbrmtklGRbVIBn584cCJlZuy.jpg",
            "plot": "Sam comes up with a way to stop Lucifer’s baby but Castiel has something else in mind for Kelly. Dean is furious when he finds out someone stole the colt. Kelly makes a bold choice about the baby’s future.",
            "director": [],
            "duration": 2520,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/hzPCbrmtklGRbVIBn584cCJlZuy.jpg"
          },
          "video": ""
        },
        {
          "episode": 20,
          "name": "Twigs and Twine and Tasha Banes",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/28MfSp7aJs1PsesJKY7u3Yz9qY6.jpg",
            "plot": "Alicia Banes calls Mary for help after her mother, Tasha, goes missing. Sam answers Mary’s phone and he and Dean head out to help Alicia and her twin brother, Max, find their mother who was hunting a powerful witch. Meanwhile, Mary starts to have some doubts about the British Men of Letters.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/28MfSp7aJs1PsesJKY7u3Yz9qY6.jpg"
          },
          "video": ""
        },
        {
          "episode": 21,
          "name": "There's Something About Mary",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/cSRKU8VGm5qXw5cUHHmSt7y1f5u.jpg",
            "plot": "Sam and Dean are alarmed when they learn hunters are being killed by suspicious “accidents” all over the country. They decide it is best to find Mary and make sure she’s safe. Meanwhile, Toni is back in the states and she and Mary face off.",
            "director": [],
            "duration": 2520,
            "rating": "6.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/cSRKU8VGm5qXw5cUHHmSt7y1f5u.jpg"
          },
          "video": ""
        },
        {
          "episode": 22,
          "name": "Who We Are",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/10KczbZQDLVcYBulIKHKIuZHsw8.jpg",
            "plot": "Caught in a dangerous situation, Sam and Dean only have each other to rely on. Meanwhile, the fight between the American Hunters and the British Hunters comes to a head.",
            "director": [],
            "duration": 2520,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/10KczbZQDLVcYBulIKHKIuZHsw8.jpg"
          },
          "video": ""
        },
        {
          "episode": 23,
          "name": "All Along the Watchtower",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/uxmhXLFOo1LfSo9UIk0tmp7dPlw.jpg",
            "plot": "Lucifer battles Sam, Dean and Castiel for control of his unborn child.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/uxmhXLFOo1LfSo9UIk0tmp7dPlw.jpg"
          },
          "video": ""
        }
      ]
    },
    {
      "season": 13,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/xBJ7Ts2nDUbUWu4Ef9v086dbBrQ.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "Season 13 begins exactly where we left off, with Sam and Dean left to pick up the pieces after the loss of their mother, the demise of Crowley and the heartbreaking death of Castiel. The birth of Jack leaves the Winchester brothers with differing opinions on how to deal with a Nephilim. After being dragged into the breach, Mary must learn to survive Lucifer and an apocalyptic world.",
        "cast": [],
        "year": "2017",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Lost and Found",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/tg6KW03bMd4pbG2xKtDXoig6eoe.jpg",
            "plot": "Sam and Dean are left to pick up the pieces after the loss of their mother, the demise of Crowley and the heartbreaking death of Castiel. The birth of Jack leaves the Winchester brothers with differing opinions on how to deal with a Nephilim. After being dragged into the breach, Mary must learn to survive Lucifer and an apocalyptic world.",
            "director": [],
            "duration": 2520,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/tg6KW03bMd4pbG2xKtDXoig6eoe.jpg"
          },
          "video": ""
        },
        {
          "episode": 2,
          "name": "The Rising Son",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/rXYi5BuU8CeYcN3cABJupUnFI8h.jpg",
            "plot": "Sam and Dean begin to explore what Jack is capable of doing with his powers. An unexpected visit from Donatello alerts the boys to the fact that Jack will need more protection than the Winchesters can provide. There is a new Prince of Hell in town, Asmodeus, and with Lucifer out of the picture, he sets his sights set on Jack.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/rXYi5BuU8CeYcN3cABJupUnFI8h.jpg"
          },
          "video": ""
        },
        {
          "episode": 3,
          "name": "Patience",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/p2dtmuhfPKL0Most3hDKPNYTOTx.jpg",
            "plot": "When her friend is murdered by a wraith with a taste for psychics, Missouri enlists the help of Dean and Jody to protect her granddaughter, Patience, who has no idea she shares her grandmother’s trait and could be next on the wraith’s hit list. Meanwhile, Sam continues to work with Jack on learning how to control his powers.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/p2dtmuhfPKL0Most3hDKPNYTOTx.jpg"
          },
          "video": ""
        },
        {
          "episode": 4,
          "name": "The Big Empty",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/l4Cbi7sQNzA9uWyTVpY1gPJxESt.jpg",
            "plot": "When multiple patients of grief counselor Mia Vallens turn up dead, Dean, Sam and Jack investigate the mystery surrounding the murders and, each inadvertently, are forced to deal with unresolved grief of their own.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/l4Cbi7sQNzA9uWyTVpY1gPJxESt.jpg"
          },
          "video": ""
        },
        {
          "episode": 5,
          "name": "Advanced Thanatology",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/iA4IsmX6sThD82893as6bDnlHZA.jpg",
            "plot": "While working on a case involving the ghost of a demented doctor, Sam and Dean get assistance from an unexpected source. Castiel finds his way back to the Winchesters.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/iA4IsmX6sThD82893as6bDnlHZA.jpg"
          },
          "video": ""
        },
        {
          "episode": 6,
          "name": "Tombstone",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/atYbcuhfAv9sYpsFXJXlkb2u3Wz.jpg",
            "plot": "Castiel is reunited with Jack and together with Sam and Dean, they head to a sleepy old western town to investigate a murder. Dean gets to live out his boyhood fantasy when he comes face to face with a famous, gun-slinging outlaw.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/atYbcuhfAv9sYpsFXJXlkb2u3Wz.jpg"
          },
          "video": ""
        },
        {
          "episode": 7,
          "name": "War of the Worlds",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/NG2i00MWSlri2d2ZMSze6rV4Ec.jpg",
            "plot": "As Sam and Dean continue their search for Jack, with Asmodeus hot on their trail, they stumble across a familiar foe. Meanwhile, Lucifer manages to escape Michael’s grasp and finds himself an unlikely and mostly unwilling ally.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/NG2i00MWSlri2d2ZMSze6rV4Ec.jpg"
          },
          "video": ""
        },
        {
          "episode": 8,
          "name": "The Scorpion and the Frog",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/7T2uQmUMnKCZ3BTcehRNr6JlWah.jpg",
            "plot": "Sam and Dean join the crew of a heist on behalf of a Crossroads Demon who has offered them a spell that can track Nephilim.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/7T2uQmUMnKCZ3BTcehRNr6JlWah.jpg"
          },
          "video": ""
        },
        {
          "episode": 9,
          "name": "The Bad Place",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/yxQ2wZrzkiqdaHvNMHwItrrvVdo.jpg",
            "plot": "Jack, desperate to prove to Sam and Dean that he is good and that he can control his powers, enlists the help of a dreamcatcher named Kaia to help him find Mary Winchester and save her from the alternate universe. However, when plans go awry, the Winchester brothers are the ones who need saving.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/yxQ2wZrzkiqdaHvNMHwItrrvVdo.jpg"
          },
          "video": ""
        },
        {
          "episode": 10,
          "name": "Wayward Sisters",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/uvwsgMxFdeP9KTOnhMMujf9daK3.jpg",
            "plot": "When Sam and Dean go missing, Jody Mills calls Claire Novak, the rebellious rogue hunter, and tells her it is time to come home – they need to find the Winchesters. Claire returns and reunites with Alex Jones, who has stayed behind with Jody and tries to balance a “normal” life with being a part time hunter. While Jody is happy to have Claire home again, she’s plagued by Patience’s disturbing vision involving her adopted daughter. Claire and Alex search for Kaia Nieves, the dreamcatcher responsible for opening the rift that Sam and Dean went through, as she holds the key to their whereabouts. Jody calls her friend, Donna Hanscum, to round out the team and the women head off on the most important hunt of their lives.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/uvwsgMxFdeP9KTOnhMMujf9daK3.jpg"
          },
          "video": ""
        },
        {
          "episode": 11,
          "name": "Breakdown",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/a48yKCJXcqECP1JermfFMZTwnH7.jpg",
            "plot": "Donna calls Sam and Dean for help after her niece, Wendy, goes missing. The three hunters discover Wendy was kidnapped by a man who sells human parts to monsters in a grotesque online auction and race to save her before it is too late.",
            "director": [],
            "duration": 2520,
            "rating": "6.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/a48yKCJXcqECP1JermfFMZTwnH7.jpg"
          },
          "video": ""
        },
        {
          "episode": 12,
          "name": "Various & Sundry Villains",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/cvKnyPE0nOdvmsfoocmijknvaRV.jpg",
            "plot": "Dean falls victim to a couple of witches, sisters Jamie and Jennie Plum, who manage to steal a powerful book of spells from the Winchester brothers. When Sam and Dean go after the book, they get help from a powerful and surprising ally when Rowena, back from the dead, intervenes to assist them.",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/cvKnyPE0nOdvmsfoocmijknvaRV.jpg"
          },
          "video": ""
        },
        {
          "episode": 13,
          "name": "Devil's Bargain",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/oTlyAcBl3TLgXdwbSbElcPIlTdm.jpg",
            "plot": "Sam, Dean and Castiel search for Lucifer who, meanwhile, strikes an unlikely deal with a local faith healer named Sister Jo. Asmodeus inches closer to finding Jack.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/oTlyAcBl3TLgXdwbSbElcPIlTdm.jpg"
          },
          "video": ""
        },
        {
          "episode": 14,
          "name": "Good Intentions",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/kCnrpmpB7oVNEquGmkkksLxuvT7.jpg",
            "plot": "Jack and Mary manage to escape Michael’s clutches and end up finding an ally in “apocalyptic world” Bobby Singer. Meanwhile, Sam, Dean and Castiel continue to search for a way to open a breach, not realizing that one of their own may be working against them and costing them precious time.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/kCnrpmpB7oVNEquGmkkksLxuvT7.jpg"
          },
          "video": ""
        },
        {
          "episode": 15,
          "name": "A Most Holy Man",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/e7Rf351ZWiRqcBjAe47txA6jkLM.jpg",
            "plot": "Sam and Dean are close to collecting everything they need to open a rift into the Apocalyptic World and possibly rescuing Mary and Jack. The one missing ingredient leads the Winchesters to a black market for religious relics where everything is not always as it seems.",
            "director": [],
            "duration": 2520,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/e7Rf351ZWiRqcBjAe47txA6jkLM.jpg"
          },
          "video": ""
        },
        {
          "episode": 16,
          "name": "ScoobyNatural",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/tw9NRq3ZB0lLhCgo5DvInTb7UWK.jpg",
            "plot": "Sam, Dean and Castiel are transported into the animated world of Scooby Doo where they join forces with the Scooby gang to solve a ghostly mystery.",
            "director": [],
            "duration": 2520,
            "rating": "8.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/tw9NRq3ZB0lLhCgo5DvInTb7UWK.jpg"
          },
          "video": ""
        },
        {
          "episode": 17,
          "name": "The Thing",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/3AKhafdiKPZCg7QvlaVjMT0KpvU.jpg",
            "plot": "Sam and Dean continue to collect the pieces necessary to open a rift to the other world in order to save their family. Their latest quest leads them to a Men of Letters bunker from the 1920s and a hungry God from another dimension. Meanwhile, Ketch makes a shocking decision about Gabriel after an unruly encounter with Asmodeus.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/3AKhafdiKPZCg7QvlaVjMT0KpvU.jpg"
          },
          "video": ""
        },
        {
          "episode": 18,
          "name": "Bring 'em Back Alive",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/iWrHjid38fV1ebrXdQK8j4L2xOY.jpg",
            "plot": "Lucifer rules over heaven but things aren’t going exactly as planned, exasperating his first lady, Jo. Sam and Castiel are perplexed by the return of Gabriel. Meanwhile, Dean gets one step closer to finding Mary and Jack.",
            "director": [],
            "duration": 2520,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/iWrHjid38fV1ebrXdQK8j4L2xOY.jpg"
          },
          "video": ""
        },
        {
          "episode": 19,
          "name": "Funeralia",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/13eoBfvtTpu2a0mvkhMxdXaBMzD.jpg",
            "plot": "Sam and Dean must stop Rowena, who is on a deadly mission. Meanwhile, Castiel looks to heaven to recruit angels for an impending invasion but is shocked by not only what he finds, but who.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/13eoBfvtTpu2a0mvkhMxdXaBMzD.jpg"
          },
          "video": ""
        },
        {
          "episode": 20,
          "name": "Unfinished Business",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/AfkiTPNFYZgsnENUpRIIvFLmuPS.jpg",
            "plot": "Gabriel is back and drags Sam and Dean into his plot for revenge on the demigods who sold him to Asmodeus. Meanwhile, Jack's inflating confidence leads to reckless decisions that could put others in harm's way.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/AfkiTPNFYZgsnENUpRIIvFLmuPS.jpg"
          },
          "video": ""
        },
        {
          "episode": 21,
          "name": "Beat the Devil",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/9ASsAXVIFtFJ9Rjk03kuViVkI7N.jpg",
            "plot": "Sam, Dean, Castiel and Gabriel must work together if they have any hope of bringing Mary and Jack home. Meanwhile, Rowena’s encounter with Lucifer may alter the outcome of the journey for one of our heroes.",
            "director": [],
            "duration": 2520,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/9ASsAXVIFtFJ9Rjk03kuViVkI7N.jpg"
          },
          "video": ""
        },
        {
          "episode": 22,
          "name": "Exodus",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/dm4L93LmaZn544sFRP0bv5KTmdX.jpg",
            "plot": "Sam and Dean devise a plan that will save innocent lives. Meanwhile, Jack continues to wrestle with the consequences of his decisions.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/dm4L93LmaZn544sFRP0bv5KTmdX.jpg"
          },
          "video": ""
        },
        {
          "episode": 23,
          "name": "Let the Good Times Roll",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/jBQaHEIXeGqJB7STG1arnrhRoFx.jpg",
            "plot": "Our heroes, Sam and Dean Winchester, continue to be tested in the battle between good and evil, but one impulsive decision could alter the lives of one the brothers forever.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/jBQaHEIXeGqJB7STG1arnrhRoFx.jpg"
          },
          "video": ""
        }
      ]
    },
    {
      "season": 14,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/bbzLtfh7VwfoaeQkkNJ2EMv6lKS.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "The season follows Sam and Dean who, along with Jack and Castiel, try to take down the archangel Michael from another world, and learn something bigger is at hand.",
        "cast": [],
        "year": "2018",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Stranger in a Strange Land",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/yvaNg9xftwoSeIbYgLCHpS5zMkO.jpg",
            "plot": "Sam enlists everyone’s help in trying to track down Dean, who can literally be anywhere. Meanwhile, Castiel may be in over his head after meeting up with an unreliable source. After being drained of his grace, Jack is adjusting to life as a human, learning new skills and figuring out how he fits in to this world of hunters.",
            "director": [],
            "duration": 2520,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/yvaNg9xftwoSeIbYgLCHpS5zMkO.jpg"
          },
          "video": ""
        },
        {
          "episode": 2,
          "name": "Gods and Monsters",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/luJZctaTqSmcFAO4rn44X5cGkmL.jpg",
            "plot": "Sam finds a clue to Dean’s whereabouts, so he, Mary and Bobby set out to investigate. Castiel imparts some sage advice on Jack, who, still desperate to belong, seeks out a familial connection.",
            "director": [],
            "duration": 2460,
            "rating": "6.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/luJZctaTqSmcFAO4rn44X5cGkmL.jpg"
          },
          "video": ""
        },
        {
          "episode": 3,
          "name": "The Scar",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/6c9xhU2rrUcpq1UAzPghSt5BU7E.jpg",
            "plot": "Still trying to solve the mystery of what happened to Dean, Sam enlists the help of Sheriff Jody Mills who may unknowingly already be on the case. Castiel continues to be a father figure to Jack, who surprises even himself, when a life is on the line.",
            "director": [],
            "duration": 2520,
            "rating": "6.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/6c9xhU2rrUcpq1UAzPghSt5BU7E.jpg"
          },
          "video": ""
        },
        {
          "episode": 4,
          "name": "Mint Condition",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/21KM2qFdjK3f06TKhbtZHZdwCnV.jpg",
            "plot": "Dean continues to struggle. Meanwhile, Sam must think fast when action figures come to life, and our heroes find themselves living in a real-life horror movie.",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/21KM2qFdjK3f06TKhbtZHZdwCnV.jpg"
          },
          "video": ""
        },
        {
          "episode": 5,
          "name": "Nightmare Logic",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/v2k2tG7UxfC6YVJchnV1yzDwiUa.jpg",
            "plot": "After a hunt gone wrong leaves Maggie’s whereabouts unknown, Sam, Dean, Mary and Bobby race to find her, but what they find are their own worst nightmares.",
            "director": [],
            "duration": 2520,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/v2k2tG7UxfC6YVJchnV1yzDwiUa.jpg"
          },
          "video": ""
        },
        {
          "episode": 6,
          "name": "Optimism",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/8UmHVrMYMECcR3KkxfjyvGoFnr7.jpg",
            "plot": "Sam and Charlie team up to get to the bottom of a string of random disappearances. Meanwhile, Jack believes that he has found a case and convinces Dean to partner-up with him on the hunt.",
            "director": [],
            "duration": 2520,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/8UmHVrMYMECcR3KkxfjyvGoFnr7.jpg"
          },
          "video": ""
        },
        {
          "episode": 7,
          "name": "Unhuman Nature",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/8uqoHeWFl2tLGg7xTsyPvD1BUnQ.jpg",
            "plot": "Sam and Castiel track down a Shaman, who may be able to help a friend. Nick continues to spiral down a dark path as he looks for answers surrounding the deaths of his wife and son. Jack turns to Dean for help enjoying the human experience.",
            "director": [],
            "duration": 2520,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/8uqoHeWFl2tLGg7xTsyPvD1BUnQ.jpg"
          },
          "video": ""
        },
        {
          "episode": 8,
          "name": "Byzantium",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/kqFjHrEMk9bd0EUM18WhMDxCyCY.jpg",
            "plot": "When Sam and Dean join forces with an unexpected ally, the outcome will alter the course of two lives. Meanwhile, Heaven faces an attack from a dark force, driving Castiel to make an enormous sacrifice to make things right.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/kqFjHrEMk9bd0EUM18WhMDxCyCY.jpg"
          },
          "video": ""
        },
        {
          "episode": 9,
          "name": "The Spear",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/xTN6TgJRprjzkF1z9eoDmpPqAZd.jpg",
            "plot": "Sam and Dean enlist the help of their pal Garth to gain inside information on what Michael may be planning. The brothers split up to each go after weapons that can aid in their fight against the Archangel, but this may be a fight our heroes cannot win.",
            "director": [],
            "duration": 2460,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/xTN6TgJRprjzkF1z9eoDmpPqAZd.jpg"
          },
          "video": ""
        },
        {
          "episode": 10,
          "name": "Nihilism",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/eyiuWNSpHFhk5f3sq4Lb9Kalzvm.jpg",
            "plot": "Michael has re-taken control of Dean as his army of monsters continues to move in on our heroes. Sam devises a plan to try and reach Dean and stop Michael before anyone else has to die.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/eyiuWNSpHFhk5f3sq4Lb9Kalzvm.jpg"
          },
          "video": ""
        },
        {
          "episode": 11,
          "name": "Damaged Goods",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/k0rKwKuz0boMVjRkQPmtT4fgYah.jpg",
            "plot": "Dean spends some bonding time with Mary and Donna. Nick finally finds the answer he has been searching for. Sam is left to make an unimaginable choice.",
            "director": [],
            "duration": 2520,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/k0rKwKuz0boMVjRkQPmtT4fgYah.jpg"
          },
          "video": ""
        },
        {
          "episode": 12,
          "name": "Prophet and Loss",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/9jEB0ZLDpQAi8CxSm227WR6Vgyh.jpg",
            "plot": "Sam and Dean must figure out how to stop the bloodshed when Donatello, who, in his current condition, is inadvertently scrambling the order of future prophets. Nick comes face to face with his past.",
            "director": [],
            "duration": 2520,
            "rating": "6.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/9jEB0ZLDpQAi8CxSm227WR6Vgyh.jpg"
          },
          "video": ""
        },
        {
          "episode": 13,
          "name": "Lebanon",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/bFEYwpF3ErAYu3fbol9b1Oekawm.jpg",
            "plot": "Sam and Dean look to occult lore for a solution to their latest problem, but instead of a resolution, they find much more than either of them had anticipated.",
            "director": [],
            "duration": 2520,
            "rating": "8.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/bFEYwpF3ErAYu3fbol9b1Oekawm.jpg"
          },
          "video": ""
        },
        {
          "episode": 14,
          "name": "Ouroboros",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/fP3fai8vEfCnHtyZqDuFutGRrhf.jpg",
            "plot": "Sam and Dean enlist the help of Rowena to track down a demi god who feasts on human flesh. The challenge of keeping Michael at bay is proving to be more difficult than originally anticipated.",
            "director": [],
            "duration": 2520,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/fP3fai8vEfCnHtyZqDuFutGRrhf.jpg"
          },
          "video": ""
        },
        {
          "episode": 15,
          "name": "Peace of Mind",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/24HLpGuTzZ0QMFMWf3XpM7G6HA9.jpg",
            "plot": "Sam and Castiel follow a case to a picturesque little town in Arkansas, only to find out nothing is as idyllic as it appears to be. Dean and Jack take a road trip to visit an old friend.",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/24HLpGuTzZ0QMFMWf3XpM7G6HA9.jpg"
          },
          "video": ""
        },
        {
          "episode": 16,
          "name": "Don't Go in the Woods",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/2b2ZykCAvOuI5fshy1XUR4pCca8.jpg",
            "plot": "Sam and Dean are baffled when they come up against a monster they have never heard of before. Jack does his best to impress a new group of friends.",
            "director": [],
            "duration": 2460,
            "rating": "6.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/2b2ZykCAvOuI5fshy1XUR4pCca8.jpg"
          },
          "video": ""
        },
        {
          "episode": 17,
          "name": "Game Night",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/q7cosSom3XC8jYPKV1x4RUthLmQ.jpg",
            "plot": "Sam and Dean race to help a friend in need. Meanwhile, Mary is concerned for Jack’s well-being, and Castiel enlists help from Jo/Anael to track down a miracle.",
            "director": [],
            "duration": 2520,
            "rating": "6.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/q7cosSom3XC8jYPKV1x4RUthLmQ.jpg"
          },
          "video": ""
        },
        {
          "episode": 18,
          "name": "Absence",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/90GLDB79EifULn0WhGQk2JK25nS.jpg",
            "plot": "Sam and Dean continue to worry about the condition of Jack’s soul.",
            "director": [],
            "duration": 2520,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/90GLDB79EifULn0WhGQk2JK25nS.jpg"
          },
          "video": ""
        },
        {
          "episode": 19,
          "name": "Jack in the Box",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ma6XhWpDHDmD41LeU7eo5pQnf8r.jpg",
            "plot": "Sam, Dean and Castiel investigate a string of suspicious deaths that have a biblical element to them.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ma6XhWpDHDmD41LeU7eo5pQnf8r.jpg"
          },
          "video": ""
        },
        {
          "episode": 20,
          "name": "Moriah",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/aWZZHwuaRRD6DFyeIYvKZPC5V5.jpg",
            "plot": "Sam, Dean and Castiel are thrown into an epic battle. Meanwhile, Jack becomes disenchanted with all the lies, and an old friend from the past shows up.",
            "director": [],
            "duration": 2520,
            "rating": "8.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/aWZZHwuaRRD6DFyeIYvKZPC5V5.jpg"
          },
          "video": ""
        }
      ]
    },
    {
      "season": 15,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/j3kk9PK1Xp8G3r6nDxVLOL1rqLo.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "The Winchester brothers' epic journey comes to a thrilling and terrifying close in Season 15.",
        "cast": [],
        "year": "2019",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Back and to the Future",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/gOdsgcvRqK11e0c9eL3ILEke1pn.jpg",
            "plot": "Picking up here we left off last season, Sam, Dean and Castiel are left to defend the world after all the souls in hell have been released and are back on Earth and free to kill again.",
            "director": [],
            "duration": 2460,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/gOdsgcvRqK11e0c9eL3ILEke1pn.jpg"
          },
          "video": ""
        },
        {
          "episode": 2,
          "name": "Raising Hell",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/eJS5KPXfa0vuaSLXNV9wnQxQMQJ.jpg",
            "plot": "Sam, Dean and Castiel call on Rowena to help keep the evil souls at bay and get an unexpected assist from Ketch.",
            "director": [],
            "duration": 2520,
            "rating": "6.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/eJS5KPXfa0vuaSLXNV9wnQxQMQJ.jpg"
          },
          "video": ""
        },
        {
          "episode": 3,
          "name": "The Rupture",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/9OOdt8aGA2G5UNJWc2j5HhzqjMo.jpg",
            "plot": "Sam and Dean together with Rowena work tirelessly to keep all of hell from breaking loose. Castiel cannot forgive an arrogant betrayal.",
            "director": [],
            "duration": 2460,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/9OOdt8aGA2G5UNJWc2j5HhzqjMo.jpg"
          },
          "video": ""
        },
        {
          "episode": 4,
          "name": "Atomic Monsters",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/zukePbvG2FUgnPEvTGcIVM4FKWc.jpg",
            "plot": "Sam and Dean investigate the mysterious death of a girl and the disappearance of another.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/zukePbvG2FUgnPEvTGcIVM4FKWc.jpg"
          },
          "video": ""
        },
        {
          "episode": 5,
          "name": "Proverbs 17:3",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/vDocJPyJIfIhJzGCgXlkhQCZGur.jpg",
            "plot": "Sam and Dean’s routine case turns out to be anything but.",
            "director": [],
            "duration": 2520,
            "rating": "7.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/vDocJPyJIfIhJzGCgXlkhQCZGur.jpg"
          },
          "video": ""
        },
        {
          "episode": 6,
          "name": "Golden Time",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/h1Um35J4ml4L1KLCsOnOYOSttQe.jpg",
            "plot": "Sam and Dean are visited by an old friend. Castiel investigates the disappearance of a local teen.",
            "director": [],
            "duration": 2520,
            "rating": "6.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/h1Um35J4ml4L1KLCsOnOYOSttQe.jpg"
          },
          "video": ""
        },
        {
          "episode": 7,
          "name": "Last Call",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/3A47t2hckQe0RB4PnKVHLRBYOaN.jpg",
            "plot": "Dean goes off on his own to take on a case. Meanwhile, Castiel has an idea of how he can help Sam track down God.",
            "director": [],
            "duration": 2520,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/3A47t2hckQe0RB4PnKVHLRBYOaN.jpg"
          },
          "video": ""
        },
        {
          "episode": 8,
          "name": "Our Father, Who Aren't in Heaven",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/kClbqTOPyNQer5FIblkPoHcI5aJ.jpg",
            "plot": "Sam, Dean and Castiel’s continued search for a way to defeat Chuck leads them to unexpected places and toward unlikely allies.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/kClbqTOPyNQer5FIblkPoHcI5aJ.jpg"
          },
          "video": ""
        },
        {
          "episode": 9,
          "name": "The Trap",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/cfCv6navhRZQBQPuEY83DRQJfo8.jpg",
            "plot": "Sam and Eileen are faced with the brutal truth. Meanwhile Dean and Cass work together in the hopes of getting a step ahead of Chuck.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/cfCv6navhRZQBQPuEY83DRQJfo8.jpg"
          },
          "video": ""
        },
        {
          "episode": 10,
          "name": "The Heroes' Journey",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/kAxxgHbnfAavbZaJIkB6Rb4tDu3.jpg",
            "plot": "Sam and Dean hit the road to help an old friend, but it appears that their luck may have finally run out and they are the ones who may be in need of rescue.",
            "director": [],
            "duration": 2520,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/kAxxgHbnfAavbZaJIkB6Rb4tDu3.jpg"
          },
          "video": ""
        },
        {
          "episode": 11,
          "name": "The Gamblers",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/4BN8JV7kn6b7GD2OqI2LIOzgGEV.jpg",
            "plot": "Sam and Dean press their luck in a winner-takes-all game of pool. Meanwhile, Castiel hunts down a would-be murderer, but not for reasons one might think.",
            "director": [],
            "duration": 2520,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/4BN8JV7kn6b7GD2OqI2LIOzgGEV.jpg"
          },
          "video": ""
        },
        {
          "episode": 12,
          "name": "Galaxy Brain",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/AtZkIR0Azy6klwJleZ7ugX7xDTG.jpg",
            "plot": "Sam and Dean respond to a frantic call and together along with Castiel, Jack and Jody, assist in an extraordinary and heartbreaking rescue. Billie surprises everyone with a visit to the bunker.",
            "director": [],
            "duration": 2520,
            "rating": "6.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/AtZkIR0Azy6klwJleZ7ugX7xDTG.jpg"
          },
          "video": ""
        },
        {
          "episode": 13,
          "name": "Destiny's Child",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/2WQwdohqH9h6Qr94XMfo5HhT5QQ.jpg",
            "plot": "A search for the one thing that may give the Winchesters an edge against God leads Sam and Dean to Jo’s door and to a secret that may have died with Ruby. Meanwhile, Castiel asks Jack to do the unthinkable to help the brothers in their quest.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/2WQwdohqH9h6Qr94XMfo5HhT5QQ.jpg"
          },
          "video": ""
        },
        {
          "episode": 14,
          "name": "Last Holiday",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/7PaAID5SU5mBuNnMg88m845YXdp.jpg",
            "plot": "Sam and Dean discover a wood nymph living in the bunker who is determined to protect her family, at any cost.",
            "director": [],
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/7PaAID5SU5mBuNnMg88m845YXdp.jpg"
          },
          "video": ""
        },
        {
          "episode": 15,
          "name": "Gimme Shelter",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/yFkF4KkPsgUb72NcuV7eSZgGmRM.jpg",
            "plot": "Castiel and Jack work a case involving members of a local church. Meanwhile, Sam and Dean go off in search of Amara.",
            "director": [],
            "duration": 2520,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/yFkF4KkPsgUb72NcuV7eSZgGmRM.jpg"
          },
          "video": ""
        },
        {
          "episode": 16,
          "name": "Drag Me Away (From You)",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/2rZMzoDJlbnGRhw1WMVQUgvoYF.jpg",
            "plot": "Sam and Dean are asked to investigate the murder of a childhood friend, calling them back to a motel from their past and perplexing the brothers with a case they thought was solved a long time ago.",
            "director": [],
            "duration": 2520,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/2rZMzoDJlbnGRhw1WMVQUgvoYF.jpg"
          },
          "video": ""
        },
        {
          "episode": 17,
          "name": "Unity",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/sFynBN8uxKfYKW2aoRqVhPNEp5p.jpg",
            "plot": "Dean hits the road with Jack who needs to complete a final ritual in the quest to beat Chuck. A difference of opinion leaves Sam and Castiel behind looking for answers to questions of their own.",
            "director": [],
            "duration": 2520,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/sFynBN8uxKfYKW2aoRqVhPNEp5p.jpg"
          },
          "video": ""
        },
        {
          "episode": 18,
          "name": "Despair",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/sdBnjJxoitWamhnrjstuXx0R3Mb.jpg",
            "plot": "With the plan in full motion, Sam, Dean, Castiel and Jack fight for the good of the common goal.",
            "director": [],
            "duration": 2460,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/sdBnjJxoitWamhnrjstuXx0R3Mb.jpg"
          },
          "video": ""
        },
        {
          "episode": 19,
          "name": "Inherit the Earth",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/wUuwkiLKd2peA1YLfKMW4EifCTd.jpg",
            "plot": "Everything is on the line as the battle against God continues. A familiar face returns to join the fight.",
            "director": [],
            "duration": 2520,
            "rating": "8.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/wUuwkiLKd2peA1YLfKMW4EifCTd.jpg"
          },
          "video": ""
        },
        {
          "episode": 20,
          "name": "Carry On",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/frpiXDldkh3P2VtNPxetsRawbpm.jpg",
            "plot": "It's the final ride for the Winchesters saving people and hunting things.",
            "director": [],
            "duration": 2520,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/frpiXDldkh3P2VtNPxetsRawbpm.jpg"
          },
          "video": ""
        }
      ]
    }
  ]
}
