{
  "name": "The Pacific",
  "category": "🄿 The Pacific",
  "info": {
    "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/x9Y1IMFdY8Ma222KcQadFEau0EB.jpg",
    "bg": "https://image.tmdb.org/t/p/w500_and_h282_face/nWfpVLgioDXQsAbfL6UJxYz6d3d.jpg",
    "plot": "Track the intertwined real-life stories of three U.S. Marines – Robert Leckie, John Basilone, and Eugene Sledge – across the vast canvas of the Pacific Theater during World War II. A companion piece to the 2001 miniseries Band of Brothers.",
    "rating": "7.8",
    "genre": [
      "drama",
      "action & adventure",
      "war & politics"
    ],
    "cast": [
      "James Badge Dale",
      "Jon Seda",
      "Joseph Mazzello",
      "Ashton Holmes",
      "Jacob Pitts"
    ]
  },
  "seasons": [
    {
      "season": 1,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/1AmsfHHyp76W71qiqLlvYMkSTie.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "",
        "year": "2010",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Guadalcanal/Leckie",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/uJKK19WYmcdoSCLaMkyZPm88fYG.jpg",
            "plot": "In the immediate aftermath of the Japanese attack on Pearl Harbor, Marine Sgt. John Basilone prepares to ship out and confront the enemy somewhere in the Pacific, while budding journalist Robert Leckie enlists in the Marine Corps.  Eugene Sledge, unable to enlist because of a heart murmur, says farewell to his best friend, Sidney Phillips, who is about to leave for boot camp.  Exactly eight months after Pearl Harbor, the 1st Marine Division, including Leckie and Phillips, lands on Guadalcanal in order to secure its strategically vital airfield and prepare for the inevitable counterattack.",
            "duration": 3120,
            "rating": "7.4",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/uJKK19WYmcdoSCLaMkyZPm88fYG.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 2,
          "name": "Basilone",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ungnd637TCGKSVWcEEhSaeGrSrH.jpg",
            "plot": "Basilone and the 7th Marines arrive on Guadalcanal to reinforce Leckie and the rest of the 1st Marine Division as they continue to defend the crucial airstrip.  Basilone plays a key role in repelling a nighttime Japanese attack, but suffers a frightful personal loss.  After four months of continuous action, the exhausted and disease-ridden members of the 1st Marine Division are evacuated off the island.",
            "duration": 3000,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ungnd637TCGKSVWcEEhSaeGrSrH.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 3,
          "name": "Melbourne",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/1IfBBkdDT4QMsSxNTYqweAfpnoe.jpg",
            "plot": "Physically and mentally debilitated after the four-month ordeal on Guadalcanal, Leckie, Basilone and thousands of their comrades land in Melbourne, where they are greeted by adoring crowds and viewed as the saviors of Australia. While his buddies carouse, Leckie becomes deeply attached to an Australian woman and her first-generation Greek family. Meanwhile, Basilone is awarded the Medal of Honor and is asked to return home to help sell U.S. war bonds.",
            "duration": 3360,
            "rating": "6.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/1IfBBkdDT4QMsSxNTYqweAfpnoe.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 4,
          "name": "Gloucester/Pavuvu/Banika",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/5SgppUHp1nPwH9qtpghwGP1c79J.jpg",
            "plot": "Finally enlisted as a Marine, Sledge trains for combat at Camp Elliott. The 1st Marine Division lands at Cape Gloucester on the Japanese-held island of New Britain. As Leckie and the other Marines battle the Japanese, they quickly realize that the more ominous enemy is the smothering jungle itself. Having survived Gloucester and stationed on the godforsaken island of Pavuvu, Leckie begins displaying the physical and mental effects of combat and is sent to a naval hospital on nearby Banika for psychiatric observation.",
            "duration": 3060,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/5SgppUHp1nPwH9qtpghwGP1c79J.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 5,
          "name": "Peleliu Landing",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/pehMtBjg9Mk4Yr8feKWszPXVI8F.jpg",
            "plot": "Basilone’s celebrity grows as he travels across the country on the war bonds tour. On Pavuvu, Sledge, assigned to the 5th Marines, 1st Marine Division, is briefly reunited with Phillips and Leckie rejoins his company. Sledge then gets his first taste of combat as he, Leckie, and the rest of the 1st Marine Division meet fierce Japanese resistance while landing on the intricately and heavily defended coral island of Peleliu.",
            "duration": 2940,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/pehMtBjg9Mk4Yr8feKWszPXVI8F.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 6,
          "name": "Peleliu Airfield",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/95LHuCQk6djsAwxdFtxGeWH90Aq.jpg",
            "plot": "Despite the suffocating 115-degree heat and a lack of clean drinking water, Sledge, Leckie and the other Marines confront the highly-fortified enemy as they attempt to capture the Peleliu airfield. After seeing his comrades badly injured, Leckie himself is wounded and evacuated from the island. Sledge witnesses the shocking truth about what is sometimes required to survive and fight another day.",
            "duration": 3000,
            "rating": "8.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/95LHuCQk6djsAwxdFtxGeWH90Aq.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 7,
          "name": "Peleliu Hills",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/16ODp0OS2Fu6iXsJoxvnOPzUNhX.jpg",
            "plot": "The Marines, including the newly christened “Sledgehammer,” continue the battle of Peleliu against an enemy determined to fight to the last man. Devastated by the loss of a revered leader, and witnessing unimaginable barbarity on both sides, Sledge veers to the very edge of moral collapse. Their objective finally secured, the Marines return to Pavuvu fundamentally changed by their experience on Peleliu.",
            "duration": 3060,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/16ODp0OS2Fu6iXsJoxvnOPzUNhX.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 8,
          "name": "Iwo Jima",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/7dZNabmUrKtjg1Icz6XOW8ovfuS.jpg",
            "plot": "Increasingly frustrated by his role campaigning for war bonds, Basilone convinces the Marines to allow him to train troops headed for combat. Transferred to Camp Pendleton, he enjoys a whirlwind romance with an initially reluctant female Marine, Lena Riggi. But the couple know they are living on borrowed time, as Basilone is soon to take part in the Marine landing on Iwo Jima.",
            "duration": 3360,
            "rating": "7.5",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/7dZNabmUrKtjg1Icz6XOW8ovfuS.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 9,
          "name": "Okinawa",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/9DMANbFOS4aSr5n1uBCRseTkGs1.jpg",
            "plot": "After battling across the island of Okinawa for more than a month, Sledge and the rest of the 1st Marine Division are ordered to relieve an Army division that has been in combat against the most strongly defended Japanese position on the island. The primordial conditions and the moral dilemma posed by the presence of civilians put tremendous strain on the physical and psychological endurance of Sledge and the other Marines.",
            "duration": 3480,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/9DMANbFOS4aSr5n1uBCRseTkGs1.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        },
        {
          "episode": 10,
          "name": "Home",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/xhBYjUYmeXI9oEANGBlIcPRoFH2.jpg",
            "plot": "After the Japanese surrender, Leckie, healed from his wounds, leaves the hospital and returns home, while Sledge heads back to Alabama to be reunited with his family and Sid Phillips. Lena visits Basilone’s home and has an emotional meeting with his family. Leckie adjusts to post-war life by resuming his old job and starting a new relationship, but for Sledge, unsure why he survived the war seemingly unscathed, adjustment will require more time.",
            "duration": 3660,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/xhBYjUYmeXI9oEANGBlIcPRoFH2.jpg"
          },
          "video": "",
          "drm": "clearkey",
          "drmkey": ""
        }
      ]
    }
  ]
}