{
  "name": "Warrior",
  "category": "🅆 Warrior",
  "info": {
    "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/hR9qPFMI6BoR63XK6BBX5Ueghan.jpg",
    "bg": "https://image.tmdb.org/t/p/w500_and_h282_face/jSBUu67DL0ajUo2e8b2orVX2TOw.jpg",
    "plot": "A gritty, action-packed crime drama set during the brutal Tong Wars of San Francisco’s Chinatown in the second half of the 19th century. The series follows Ah Sahm, a martial arts prodigy who immigrates from China to San Francisco under mysterious circumstances, and becomes a hatchet man for one of Chinatown’s most powerful tongs.",
    "rating": "8.0",
    "genre": [
      "crime",
      "drama",
      "action & adventure",
      "western"
    ],
    "cast": [
      "Andrew Koji",
      "Olivia Cheng",
      "Jason Tobin",
      "Dianne Doan",
      "Kieran Bew"
    ]
  },
  "seasons": [
    {
      "season": 1,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/4DNM2DrFhrwctQlOowYHm2trnet.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "",
        "year": "2019",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "The Itchy Onion",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/8DbVOFbjMJ9x2Gm1laoqSJ8Bgyb.jpg",
            "plot": "San Francisco, 1878. Ah Sahm, a newly arrived Chinese immigrant with serious fighting skills, is introduced to Chinatown’s most ruthless tong, the Hop Wei, by Chao, a fixer. After impressing Young Jun, son of tong leader Father Jun, Ah Sahm is branded and taken to a brothel, where he befriends Ah Toy, a courtesan with connections.",
            "duration": 3600,
            "rating": "6.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/8DbVOFbjMJ9x2Gm1laoqSJ8Bgyb.jpg"
          }
        },
        {
          "episode": 2,
          "name": "There's No China in the Bible",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ac4UomT9sDWFPAYIIMuLBd2dHd5.jpg",
            "plot": "Intercepting a shipment of opium at the docks, Young Jun, with Ah Sahm and his Hop Wei lieutenant Bolo in tow, decides to send a message to Long Zii. Big Bill and Lee investigate a grisly murder scene in an alley next to an Irish bar, The Banshee. Penny Blake, the young wife of San Francisco’s mayor, finds herself in a bind while visiting the wharf with her Chinese manservant, Jacob. Ah Sahm pays a steep price for playing the hero. The Long Zii clean up a mess, and brace for more bloodshed.",
            "duration": 2580,
            "rating": "6.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ac4UomT9sDWFPAYIIMuLBd2dHd5.jpg"
          }
        },
        {
          "episode": 3,
          "name": "John Chinaman",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/uC7atSU2znb08Yo6QBHMHQEtOTf.jpg",
            "plot": "Leary pressures gentleman industrialist Byron Mercer, who is Penny’s father, to hire his men for a cable-car track job — despite the fact that Mayor Blake hasn’t yet awarded Mercer the contract. Accused of assault and perhaps worse, Ah Sahm gets a cold shoulder from the Hop Wei, with his fate in the hands of an unexpected ally. Buckley urges Mai Ling to eschew restraint and start a war with the Hop Wei.",
            "duration": 2880,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/uC7atSU2znb08Yo6QBHMHQEtOTf.jpg"
          }
        },
        {
          "episode": 4,
          "name": "The White Mountain",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/nhXwMxMN9mpNT4uRFppl4NdhV2L.jpg",
            "plot": "Big Bill finds himself compromised by his gambling excesses, but discovers a possible solution after an opium-den raid. Penny reveals the circumstances that prompted her to marry Mayor Blake, who’s determined to show voters he won’t tolerate San Francisco’s “Yellow Peril.” After meeting with leaders of the Fung Hai tong, Mai Ling offers Ah Sahm a way out of a protracted — and bloody — tong war.",
            "duration": 2820,
            "rating": "6.9",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/nhXwMxMN9mpNT4uRFppl4NdhV2L.jpg"
          }
        },
        {
          "episode": 5,
          "name": "The Blood and the Shit",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/5L1qberXKTm3qPJ16GFFGGKyden.jpg",
            "plot": "Transporting precious cargo via stagecoach through the Sierra Nevada, Ah Sahm and Young Jun are forced to spend the night with three strangers at a frontier saloon in the middle of nowhere. The detour turns perilous when Harlan French, a notorious outlaw, shows up with his henchmen, looking for a lucrative payday.",
            "duration": 2880,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/5L1qberXKTm3qPJ16GFFGGKyden.jpg"
          }
        },
        {
          "episode": 6,
          "name": "Chewed Up, Spit Out, and Stepped On",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/tXilyaDETjlXQQ9N0LfF2F7momL.jpg",
            "plot": "Tensions escalate between the Hop Wei and Long Zii after an assassination attempt during a boisterous Chinatown parade. Big Bill sets out to pay his debt to Jack Damon, leaving Lee to keep watch over Lucy and the kids. Mayor Blake and Deputy Mayor Buckley get a mandate from Robert Crestwood, a senator with eyes on the White House.",
            "duration": 2640,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/tXilyaDETjlXQQ9N0LfF2F7momL.jpg"
          }
        },
        {
          "episode": 7,
          "name": "The Tiger and the Fox",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/qOBT2DjARJZpkSHOZKq4h91kvmA.jpg",
            "plot": "Ah Sahm faces a dilemma when Father Jun sends Bolo to hunt down Long Zii and Mai Ling . Ah Toy recruits a special girl from a whore monger, and takes on a business partner for a land deal. Penny is faced with an unsavory choice in order to save her home. Lee’s past catches up with him.",
            "duration": 2820,
            "rating": "7.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/qOBT2DjARJZpkSHOZKq4h91kvmA.jpg"
          }
        },
        {
          "episode": 8,
          "name": "They Don't Pay Us Enough to Think",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/8DOXAl5QIruZP08wuZTgU5Phzwh.jpg",
            "plot": "After a bloodbath on the streets of Chinatown, the Hop Wei and Long Zii consider a novel way to end hostilities. Ah Toy and her real-estate business partner, Leonard Patterson, hit a fork in the road in their effort to buy a valuable piece of land. After promising jobs to Leary’s Irish workers, Mercer toasts Crestwood at a fundraiser, while Penny struggles to hold her tongue. Mai Ling warns her brother against waging a battle he may not win.",
            "duration": 2640,
            "rating": "7.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/8DOXAl5QIruZP08wuZTgU5Phzwh.jpg"
          }
        },
        {
          "episode": 9,
          "name": "Chinese Boxing",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/siHk9ChRisTyEESK1Hewu21PkfG.jpg",
            "plot": "Chinatown gathers to witness a “prize fight” between elite warriors from the Hop Wei and Long Zii. Buckley plays a bluff in hopes of getting Mercer to lower his fee. Ah Sahm remembers his roots as a fighter, as Ah Toy warns him of the dangers that await. Bill and Lee question Wang Chao about the recent series of sword killings in San Francisco.",
            "duration": 2880,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/siHk9ChRisTyEESK1Hewu21PkfG.jpg"
          }
        },
        {
          "episode": 10,
          "name": "If You're Going to Bow, Bow Low",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ujgzPS4GBalW8AO7KYjH2m88GDW.jpg",
            "plot": "Ah Sahm rejects his warrior roots and retreats into the netherworld of the Chinese working class. A guilty Big Bill stands vigil for Lee at the hospital. With the police roughing up tong members in retaliation for their violence, Zing and the Fung Hai make a show of force to compel Mai Ling to honor her partnership. Burned by Buckley, Leary decides to take matters into his own hands at Mercer's factory. Seeking to snap Ah Sahm out of his funk, Chao shares a harrowing story of personal hardship. Ah Toy preaches a not-so-ancient message to Ah Sahm: In the middle of chaos lies opportunity. Season One Finale.",
            "duration": 3060,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ujgzPS4GBalW8AO7KYjH2m88GDW.jpg"
          }
        }
      ]
    },
    {
      "season": 2,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/fvbQtIfBSmDvlgELUkCe6AtcgTA.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "Season two follows rival Chinatown tongs, the Hop Wei and the Long Zii, as they fight for dominance amidst the growing anti-Chinese racism that threatens to destroy them all.",
        "year": "2020",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Learn to Endure, or Hire a Bodyguard",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/k8KBjtv7bTLQhPh43ZYgzOVvxym.jpg",
            "plot": "Back with the Hop Wei, Ah Sahm spends his nights at the Barbary Coast fight pit, confronting a new anti-Chinese group, Teddy’s Boys. While Ah Toy accuses him of just looking for another fight, an empowered Mai Ling worries about her brother’s next steps. Meanwhile, Bill finds it hard to break out of his role as enforcer for Zing; Penny is determined to continue running Mercer Steel, much to Blake’s dismay; and Chao offers Ah Sahm some advice for his future with Young Jun.",
            "duration": 3060,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/k8KBjtv7bTLQhPh43ZYgzOVvxym.jpg"
          }
        },
        {
          "episode": 2,
          "name": "The Chinese Connection",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ub2566pT4wZNy1qIbYr9JkphLDx.jpg",
            "plot": "Ah Sahm and Young Jun search for a discreet place to hide their product after striking a deal with a new opium supplier. As Lee becomes increasingly dependent on laudanum, he and Bill continue to investigate the swordsman murders. Mai Ling sends Li Yong and Zing to deliver a message to a rival tong. Penny asks for Ah Sahm’s help in protecting her factory. Sophie continues to pique Leary’s interest. Ah Toy receives a visit from Nellie Davenport, a wealthy widow committed to ending the exploitation of Chinese women.",
            "duration": 3060,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ub2566pT4wZNy1qIbYr9JkphLDx.jpg"
          }
        },
        {
          "episode": 3,
          "name": "Not How We Do Business",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/igyqhIasYURdR0Vf0Ou9DOCBSmR.jpg",
            "plot": "With their new enterprise going well, Young Jun shares his worries with Ah Sahm about the new men Father Jun has brought over from China, and later, the partners are impressed by Hong, an enthusiastic recruit with a secret. Meanwhile, Chao goes to Mai Ling for help keeping Zing away from his business, Sophie grows closer to Leary, Nellie’s politics raise questions from her peers, and things take a deadly turn at Bill’s home.",
            "duration": 2760,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/igyqhIasYURdR0Vf0Ou9DOCBSmR.jpg"
          }
        },
        {
          "episode": 4,
          "name": "If You Don't See Blood, You Didn't Come to Play",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/3bHrCLxVfOofliqapTgoY18l3bc.jpg",
            "plot": "As the police prepare for retribution, Chao comes to Bill with a mutually beneficial proposal. A sympathetic Sophie offers Leary a new plan. Ah Sahm and Penny have a moment when he confides his plans for the future. Buckley urges Blake to take a stand against the Chinese, Lee seeks to ease his pain, Mai Ling invests in a legitimate business, and Nellie urges Ah Toy to imagine a different kind of life for her sex workers.",
            "duration": 3060,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/3bHrCLxVfOofliqapTgoY18l3bc.jpg"
          }
        },
        {
          "episode": 5,
          "name": "Not for a Drink, a F*ck, or a G**damn Prayer",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/eQz0jXzcS1eFRnE8XDHSxUvpzZb.jpg",
            "plot": "A guilty Mai Ling tries to make things right with Ah Sahm, who’s more intent than ever on seeking revenge. Penny finds her business in trouble and learns that Ah Sahm has been using her. Leary gets a warning and offers one of his own. Ah Toy pays an emotional visit to Nellie’s Sonoma winery. Bill and Chao put their plot against the Fung Hai into action.",
            "duration": 3060,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/eQz0jXzcS1eFRnE8XDHSxUvpzZb.jpg"
          }
        },
        {
          "episode": 6,
          "name": "To a Man with a Hammer, Everything Looks Like a Nail",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/wZEstDf1P87LktDgHsBxjKoo546.jpg",
            "plot": "Ah Sahm, Young Jun, and Hong travel with Vega to Rooker’s Mill, a U.S.-Mexico border town owned by Elijah Rooker, the wealthy host of a lucrative fight tournament that Ah Sahm is determined to win. As he learns more about Vega, Ah Sahm draws the attention of another fighter, Dolph, and later, Rooker himself.",
            "duration": 2640,
            "rating": "8.2",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/wZEstDf1P87LktDgHsBxjKoo546.jpg"
          }
        },
        {
          "episode": 7,
          "name": "If You Wait by the River Long Enough",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/qIJjZU8jzTZjwFD11Of83zroBFJ.jpg",
            "plot": "Change is afoot for the Hop Wei after Father Jun, Ah Sahm, and Young Jun face off. Ah Toy decides that Nellie may be the answer to her problems and takes matters at a sadistic rival brothel into her own hands. Leary is urged by both Buckley and Sophie to utilize his political influence. Just as his heroics are trumpeted, Bill is faced with another swordsman murder. A fatal clash unfolds at the Blake household.",
            "duration": 3240,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/qIJjZU8jzTZjwFD11Of83zroBFJ.jpg"
          }
        },
        {
          "episode": 8,
          "name": "All Enemies, Foreign and Domestic",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/qMp7zankichW83ZrKujgDhCIo3X.jpg",
            "plot": "The police shut down Chinatown in their hunt for a killer, just as the Hop Wei make a move that puts Mai Ling on edge. Buckley steps into a new role and considers a proposition from Leary, who faces questions from the Irish workingmen. Ah Toy fights for her life, while Chao faces a major dilemma.",
            "duration": 2520,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/qMp7zankichW83ZrKujgDhCIo3X.jpg"
          }
        },
        {
          "episode": 9,
          "name": "Enter the Dragon",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/eiKyypoPipgEv0NbyPkLIXa8CnO.jpg",
            "plot": "After Bill and his men are confronted by an angry mob, Chinatown erupts into chaos, forcing the tongs to work together to protect their streets. As Chao and Mai Ling seek shelter, Mai Ling tends to an ailing Ah Toy. Sophie opens her eyes to Leary's world. Lee decides which side he's on.",
            "duration": 3000,
            "rating": "7.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/eiKyypoPipgEv0NbyPkLIXa8CnO.jpg"
          }
        },
        {
          "episode": 10,
          "name": "Man on the Wall",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/1NGfogRQBbHvsK9sTon97Za54OJ.jpg",
            "plot": "Young Jun faces a crucial decision after Mai Ling tries to drive a wedge between him and Ah Sahm, who has emerged as a hero in Chinatown and takes the opportunity to go on the offensive against Leary. Determined to take Buckley down, Penny goes to the press. Bill reckons with what he's become, and Lee seeks out a familiar face. Mai Ling finally plays her hand against the Hop Wei.",
            "duration": 3420,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/1NGfogRQBbHvsK9sTon97Za54OJ.jpg"
          }
        }
      ]
    },
    {
      "season": 3,
      "info": {
        "poster": "https://image.tmdb.org/t/p/w220_and_h330_face/d3g74Ivl3NYeyqhvI4mqwjqmv6k.jpg",
        "bg": "https://image.tmdb.org/t/p/w500_and_h282_face",
        "plot": "In the wake of the race riots that upended Chinatown in season two, Mai Ling uses her government connections to consolidate power, while Ah Sahm and the Hop Wei must find new ways to survive.",
        "year": "2023",
        "trailer": ""
      },
      "episodes": [
        {
          "episode": 1,
          "name": "Exactly the Wrong Time to Get Proud",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/o75jkGHOxmttRMfGxLa6X4Yw7h5.jpg",
            "plot": "Struggling under the pressure of an increased police presence, the Hop Wei search for a new, lucrative way to survive.",
            "duration": 3240,
            "rating": "7.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/o75jkGHOxmttRMfGxLa6X4Yw7h5.jpg"
          }
        },
        {
          "episode": 2,
          "name": "Anything Short of a Blow to the Head",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/qPjMeYgnKh4M3HVZfoCRRbF3byV.jpg",
            "plot": "As Ah Sahm and Young Jun struggle to produce authentic bills, they get valuable printing advice from an unexpected source.",
            "duration": 3540,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/qPjMeYgnKh4M3HVZfoCRRbF3byV.jpg"
          }
        },
        {
          "episode": 3,
          "name": "No Time for F*cking Chemistry",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/3RQUR5uZS4qJwz1rgIgBpKmo07U.jpg",
            "plot": "While taking menacing steps to secure Nellie's land, Strickland instills confidence in Leary's political abilities.",
            "duration": 3180,
            "rating": "7.6",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/3RQUR5uZS4qJwz1rgIgBpKmo07U.jpg"
          }
        },
        {
          "episode": 4,
          "name": "In Chinatown, No One Thinks About Forever",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/ML4vEpW0unBCyzIDPLIG9K0UkN.jpg",
            "plot": "Shaken by the loss of Nellie's land, Ah Toy grapples with a difficult choice. Ah Sahm and Yan Mi think on their toes during a police raid.",
            "duration": 2820,
            "rating": "7.3",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/ML4vEpW0unBCyzIDPLIG9K0UkN.jpg"
          }
        },
        {
          "episode": 5,
          "name": "Whiskey and Sticky and All the Rest Can Wait",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/hQqBGHpoYnQLQpCqmfp3Plx6rB6.jpg",
            "plot": "Ah Sahm and Hong race against time to free a captured Young Jun before he's sent back to China. Meanwhile, an imprisoned Mai Ling hits rock bottom.",
            "duration": 3360,
            "rating": "6.8",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/hQqBGHpoYnQLQpCqmfp3Plx6rB6.jpg"
          }
        },
        {
          "episode": 6,
          "name": "A Soft Heart Won't Do You No Favors",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/3fqEKm5v8W7jO3AV0pcuBL4zYVa.jpg",
            "plot": "Chao and Lee band together after an unexpected tossup threatens their lives. Meanwhile, the Hop Wei navigate a tense deal with German traders.",
            "duration": 3360,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/3fqEKm5v8W7jO3AV0pcuBL4zYVa.jpg"
          }
        },
        {
          "episode": 7,
          "name": "Gotta Be Crooked to Get Along in a Crooked World",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/5a3F5k4Hq0jqmAemFtW2906dzQ5.jpg",
            "plot": "In the wake of Father Jun's injury, Young Jun steps up for the Hop Wei. Leary struggles to smooth over rising working-class tensions.",
            "duration": 3120,
            "rating": "7.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/5a3F5k4Hq0jqmAemFtW2906dzQ5.jpg"
          }
        },
        {
          "episode": 8,
          "name": "You Know When You're Losing a Fight",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/3BFqlAKDHOXESItUYpRioJxFcn2.jpg",
            "plot": "As Mai Ling's wedding briefly unites the Hop Wei and Long Zii, Li Yong receives a grim final warning from Kong Pak.",
            "duration": 3120,
            "rating": "8.1",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/3BFqlAKDHOXESItUYpRioJxFcn2.jpg"
          }
        },
        {
          "episode": 9,
          "name": "All of Death Is a Going Home",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/lq9KB3JTPEWQsqcWcWT3zqjBxzt.jpg",
            "plot": "Ah Sahm makes a bold sacrifice to protect Yan Mi, Mai Ling reckons with the consequences of her actions, and Leary reaches his breaking point.",
            "duration": 2760,
            "rating": "8.0",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/lq9KB3JTPEWQsqcWcWT3zqjBxzt.jpg"
          }
        },
        {
          "episode": 10,
          "name": "A Window of F*cking Opportunity",
          "info": {
            "poster": "https://image.tmdb.org/t/p/w227_and_h127_bestv2/8Fwm3x0tEZ7ASxoqMa3RHf3KZVm.jpg",
            "plot": "As the Secret Service finally corners the Tongs' printing operation, Ah Sahm must choose between his brothers in the Hop Wei and a future with Yan Mi.",
            "duration": 3240,
            "rating": "8.7",
            "backdrop": "https://image.tmdb.org/t/p/w500_and_h282_face/8Fwm3x0tEZ7ASxoqMa3RHf3KZVm.jpg"
          }
        }
      ]
    }
  ]
}